[
    {
        "Id": 2086,
        "Name": "Amur Maackia",
        "Scientific name": "Maackia amurensis",
        "Binomial": "MAAM",
        "Plant Type": "Deciduous Tree",
        "Height": 30,
        "Spread": 30,
        "Root Depth": 48,
        "Seasonal Interest": "All Year",
        "Notes": "Best in well-drained soil. Prefers growing in full sun. Heavy blooming does not occur every year. Starts flowering when fairly young. This member of the pea family is both closely related and similar in appearance to the slightly larger yellowwood (Cladrastis). Yellowwood has more attractive flowers and excellent fall color. Amur maackia is planted in urban areas because of its unique appearance and tolerance to both flooding and drought conditions (Meyer). The bark of the tree is described by some as “zombie skin” because of its amber color, peeling texture, and green undertones. Propagation: Pre-soak the seed for 24 hours in hot water and then sow it in a cold frame in the autumn. The seed can also be pre-soaked and sown in late winter in a greenhouse. Variable germination. When they are large enough to handle, prick the seedlings out into individual pots and grow them on in the greenhouse for at least their first winter. Plant them out into their permanent positions in late spring or early summer, after the last expected frosts. Root cuttings 4cm long in December.",
        "Flower Color": "White",
        "Root Type": "Fibrous Deep",
        "Bloom Time": "Summer - Late Summer",
        "Fruit Time": "Fall - Winter",
        "Texture": "Medium",
        "Form": "Rounded",
        "Growth Rate": "Slow",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "3 -- 7",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "5.5 - 8.5",
        "Ecological Function": "Insectory, Nitrogen Fixer, Wildlife Habitat",
        "Human Use/Crop\r": "Aromatics/Fragrance, Container Garden, Dye, Food, Medicine, Ornamental, Soap, Wood\"\r\n2358,Haralson Apple,Malus pumila 'Haralson',MAPU,Deciduous Tree,14,10,36,Spring-Fall,White-pink flower; fall harvest of edible fruits; can be grown in partial shade with less fruit production. Ripen early October.,White,Fibrous Deep,Late Spring,Fall,Medium,Rounded,Slow,Medium,Medium,\"Full_Sun, Partial_Shade"
    },
    {
        "Id": 2359,
        "Name": "Honeycrisp Apple",
        "Scientific name": "Malus pumila 'Honeycrisp'",
        "Binomial": "MAPU",
        "Plant Type": "Deciduous Tree",
        "Height": 14,
        "Spread": 10,
        "Root Depth": 36,
        "Seasonal Interest": "Spring-Fall",
        "Notes": "White-pink flower; fall harvest of edible fruits; can be grown in partial shade with less fruit production. Ripen early October.",
        "Flower Color": "White",
        "Root Type": "Fibrous Deep",
        "Bloom Time": "Late Spring",
        "Fruit Time": "Fall",
        "Texture": "Medium",
        "Form": "Rounded",
        "Growth Rate": "Slow",
        "Insect Predation": "Medium",
        "Disease": "Medium",
        "Light": "Full_Sun",
        "Hardiness Zone": "3 -- 9",
        "Soil Moisture": "Moderate",
        "Soil pH": "5.1 - 7.5",
        "Ecological Function": "Soil Builder",
        "Human Use/Crop\r": "Food\r"
    },
    {
        "Id": 2656,
        "Name": "Honeygold Apple",
        "Scientific name": "Malus pumila 'Honeygold'",
        "Binomial": "MAPU",
        "Plant Type": "Deciduous Tree",
        "Height": 14,
        "Spread": 10,
        "Root Depth": 0,
        "Seasonal Interest": "Spring-Fall",
        "Notes": "A sweet, crisp golden apple good for eating and cooking.",
        "Flower Color": "White",
        "Root Type": "Fibrous Deep",
        "Bloom Time": "Late Spring",
        "Fruit Time": "",
        "Texture": "Medium",
        "Form": "Rounded",
        "Growth Rate": "Slow",
        "Insect Predation": "Medium",
        "Disease": "Medium",
        "Light": "",
        "Hardiness Zone": "4 -- 8",
        "Soil Moisture": "Moderate",
        "Soil pH": "5.1 - 7.5",
        "Ecological Function": "Erosion Control, Soil Builder",
        "Human Use/Crop\r": "Food\r"
    },
    {
        "Id": 4414,
        "Name": "Texas White Ash (Mountain Ash)",
        "Scientific name": "Fraxinus texensis",
        "Binomial": "FRTE",
        "Plant Type": "Deciduous Tree",
        "Height": 50,
        "Spread": 40,
        "Root Depth": 18,
        "Seasonal Interest": "All Year",
        "Notes": "Texas Ash is a smaller, more drought tolerant relative of White Ash, F. americana. HABITAT: Limestone bluffs. RANGE: Dallas in north central Texas west & south through central Texas and Southern Oklahoma. Deciduous. Water requirements are low, although it can tolerate moderate amounts of moisture with good drainage. Leaves turn glowing red, gold, orange & purple in the fall. Distinguished from White Ash by its leaflets, which are more rounded, & by having 5-7 leaflets instead of 7-9. Fruit Characteristics: small woody winged samara in 6\" - 8\" long panicles. Soil Requirements: adaptable. Male and female flowers borne on separate trees. Female flowers in loose clusters appearing with the new leaves; male flowers appear as dark, purplish clusters near the end of the twigs, often before the leaves. Prune for strong structure. Thorny. PROPAGATION: Seeds, cuttings or transplants. Fruit characteristics: does not attract wildlife; no significant litter problem; persistent on the tree; showy. LIFESPAN: 40 - 50 Years.",
        "Flower Color": "Green, Purple, White",
        "Root Type": "Fibrous Shallow, Long Rhizome",
        "Bloom Time": "Spring",
        "Fruit Time": "Summer",
        "Texture": "Medium",
        "Form": "Rounded",
        "Growth Rate": "Slow",
        "Insect Predation": "Minor",
        "Disease": "Major",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "5 -- 9",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "5.6 - 8.4",
        "Ecological Function": "Domestic Animal Forage, Reclamator, Wildlife Habitat, Wildlife Habitat",
        "Human Use/Crop\r": "Biomass, Ornamental, Wood\"\r\n4379,Azarole,Crataegus azarolus,CRAZ,Deciduous Tree,15,15,60,Spring,\"Although the species regenerates after fire, repeated fires may destroy some individuals. Thorny."
    },
    {
        "Id": 140,
        "Name": "Black Maple",
        "Scientific name": "Acer saccharum subsp. nigrum",
        "Binomial": "ACSA",
        "Plant Type": "Deciduous Tree",
        "Height": 100,
        "Spread": 75,
        "Root Depth": 30,
        "Seasonal Interest": "Spring",
        "Notes": "A close relative, and sometimes considered a subspecies, of the sugar maple (A. saccharum). May have slightly higher heat/drought tolerance than sugar maple. Not readily available in the nursery trade. Monoecious.",
        "Flower Color": "Green, Yellow",
        "Root Type": "Fibrous Shallow",
        "Bloom Time": "Spring - Late Spring",
        "Fruit Time": "Summer - Fall",
        "Texture": "Medium",
        "Form": "Globe",
        "Growth Rate": "Slow",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade, Shade",
        "Hardiness Zone": "3 -- 6",
        "Soil Moisture": "Wet, Moderate",
        "Soil pH": "4.5 - 6.0",
        "Ecological Function": "Mulch Maker, Reclamator, Wildlife Food, Wildlife Habitat, Windbreak",
        "Human Use/Crop\r": "Food, Food, Medicine, Ornamental, Wood\"\r\n4304,Black Maple,Acer saccharum subsp. nigrum,ACSA,Deciduous Tree,80,60,40,Summer-Fall,\"Black Maple is a large deciduous tree native to Eastern and Central USA and can be found in the mountains of NC. It differs from A. saccharum (sugar maple) buy having darker bark, leafy stipules at the base of leaf stems and leaves that are 3-lobed and a darker green. Subsp. nigrum commonly called black maple is very similar in appearance to sugar maple. It is a large, deciduous tree with ascending branching, typically growing 60-75’ (less frequently to 100’) tall with a dense rounded crown. Like sugar maple, black maple is indigenous to the northeast and upper midwest and southern Canada. It is native to Missouri where it typically occurs in rich woods, ravines, valleys, slopes and along streams, mostly in the northern and central parts of the state. In comparison to sugar maple, black maple generally has (a) darker bark, (b) darker leaves that are mostly 3-lobed, droopy at the edges, and hairy underneath, and (c) leafy stipules at the bases of many of the leaf petioles. Dark green leaves (to 6” wide) turn beautiful shades of yellow, orange and red in fall. Pale yellowish green flowers appear in clusters in spring. Flowers give way to clusters of paired samaras (to 1” long) that"
    },
    {
        "Id": 287,
        "Name": "Tatarian Maple",
        "Scientific name": "Acer tataricum",
        "Binomial": "ACTA",
        "Plant Type": "Deciduous Tree",
        "Height": 30,
        "Spread": 30,
        "Root Depth": 32,
        "Seasonal Interest": "Spring-Fall",
        "Notes": "Hybridizes easily with Amur maple. Tolerates alkaline and dry conditions better than Amur maple. Warrants greater use than presently exists.",
        "Flower Color": "Green, White",
        "Root Type": "Fibrous Shallow",
        "Bloom Time": "Spring - Late Spring",
        "Fruit Time": "Summer - Fall",
        "Texture": "Medium",
        "Form": "Rounded",
        "Growth Rate": "Slow",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "3 -- 6",
        "Soil Moisture": "Moderate",
        "Soil pH": "5.8 - 8.0",
        "Ecological Function": "Wildlife Food, Wildlife Habitat, Windbreak",
        "Human Use/Crop\r": "Biomass, Container Garden, Food, Ornamental, Pollard, Wood\"\r\n3977,Eastern Mayhaw,Crataegus aestivalis,CRAE,Deciduous Tree,35,45,72,Spring,\"Native of the southern United States; introduced early in the nineteenth century, but has frequently quite disappeared from cultivation. The spreading, low branching habit of growth makes this best suited for planting in a large open area of turf. If regular pruning can be provided to keep low, drooping branches pruned, it can be located closer to a walk. Fruits are speckled with silver. Thorns to an inch and a half long. Pruning requirement: needed for strong structure. According to Dr. J. C. Raulston at North Carolina State University, this may be one of the best Hawthorns for the south due to superior disease resistance. Increased demand for mayhaw fruit, along with the tree’s ability to grow on land too wet for most crops, has created significant interest in commercial mayhaw production. Small commercial manufacturers of mayhaw jelly and syrup have become more prominent, and demand for pick-your-own and direct sales to consumers has also increased."
    },
    {
        "Id": 4598,
        "Name": "Post Oak",
        "Scientific name": "Quercus stellata",
        "Binomial": "QUST",
        "Plant Type": "Deciduous Tree",
        "Height": 70,
        "Spread": 70,
        "Root Depth": 60,
        "Seasonal Interest": "Fall",
        "Notes": "Has a variable growth form and can be either a tree or shrub. Hybridizes with other species in the white oak subgenus. AKA brash, runner, cross, iron, and box oak and Q. boyntonii, mississippienesis, drumondii, and similis.",
        "Flower Color": "",
        "Root Type": "Tap, Long Rhizome",
        "Bloom Time": "Spring - Late Spring",
        "Fruit Time": "Summer - Fall",
        "Texture": "Coarse",
        "Form": "Rounded",
        "Growth Rate": "Slow",
        "Insect Predation": "Major",
        "Disease": "Medium",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "5 -- 9",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "5.0 - 7.5",
        "Ecological Function": "Erosion Control, Hedge, Nurse, Wildlife Food, Wildlife Habitat, Windbreak",
        "Human Use/Crop\r": "Biomass, Container Garden, Coppice, Fiber, Food, Food, Medicine, Ornamental, Ornamental, Wood\"\r\n4594,Rock Chestnut Oak,Quercus prinus,QUPR,Deciduous Tree,70,70,36,Fall,\"Main taproot fades and is replaced by shorter tap roots coming from the laterals after reaching ten feet height. Hybridizes with Q. stellat, robur, alba, and bicolor in the white oak subgenus. Also known as Q. montana, cow oak, awamp chestnut oak, rock oak, basket oak, and tan oak."
    },
    {
        "Id": 251,
        "Name": "Black Ash",
        "Scientific name": "Fraxinus nigra",
        "Binomial": "FRNI",
        "Plant Type": "Deciduous Tree",
        "Height": 50,
        "Spread": 45,
        "Root Depth": 40,
        "Seasonal Interest": "Spring",
        "Notes": "Scaly & flaking bark. Usually found growing in swamps & wet sites.",
        "Flower Color": "Purple",
        "Root Type": "Fibrous Shallow",
        "Bloom Time": "Spring - Late Spring",
        "Fruit Time": "",
        "Texture": "Medium",
        "Form": "Irregular",
        "Growth Rate": "Fast",
        "Insect Predation": "Minor",
        "Disease": "Major",
        "Light": "Full_Sun",
        "Hardiness Zone": "2 -- 6",
        "Soil Moisture": "Wet, Moderate",
        "Soil pH": "4.1 - 6.0",
        "Ecological Function": "Erosion Control, Nurse, Soil Builder, Wildlife Food",
        "Human Use/Crop\r": "Ornamental, Wood\"\r\n35,Cimmaron Ash,Fraxinus pennsylvanica 'Cimmzam',FRPE,Deciduous Tree,60,30,40,Fall,\"Very similar in growth habit to summit ash. Brick red fall color. This tree is listed as hardy to zone 5, but if planted in a protected location it may be one worth trying. Developed cv from Flemings Nurseries in Australia. Planting new green ash trees is no longer recommended given the susceptibility of this tree to the emerald ash borer. Ash trees have typically been used over time in a variety of applications including shade tree, street tree or lawn tree."
    },
    {
        "Id": 198,
        "Name": "Green Ash",
        "Scientific name": "Fraxinus pennsylvanica",
        "Binomial": "FRPE",
        "Plant Type": "Deciduous Tree",
        "Height": 75,
        "Spread": 50,
        "Root Depth": 40,
        "Seasonal Interest": "Spring",
        "Notes": "Tree has been overplanted due to great adaptability. Formerly listed as F.p. var. lanceolata-- Red & Green Ash now included in same species. Used as a street tree, in lawns, windbreaks, and farmsteads. Planting new green ash trees is no longer recommended given the susceptibility of this tree to the emerald ash borer. Ash trees have typically been used over time in a variety of applications including shade tree, street tree or lawn tree.",
        "Flower Color": "Green, Purple, Yellow",
        "Root Type": "Fibrous Shallow, Long Rhizome",
        "Bloom Time": "Spring - Late Spring",
        "Fruit Time": "Spring - Summer",
        "Texture": "Medium",
        "Form": "Irregular",
        "Growth Rate": "Fast",
        "Insect Predation": "Minor",
        "Disease": "Major",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "2 -- 7",
        "Soil Moisture": "Wet, Moderate, Dry",
        "Soil pH": "6.0 - 8.0",
        "Ecological Function": "Domestic Animal Forage, Domestic Animal Forage, Erosion Control, Insecticide, Insectory, Reclamator, Soil Builder, Wildlife Food, Wildlife Food, Wildlife Habitat, Windbreak, Windbreak",
        "Human Use/Crop\r": "Coppice, Fiber, Food, Medicine, Ornamental, Ornamental, Wood\"\r\n36,Kindred Ash,Fraxinus pennsylvanica 'Kindred',FRPE,Deciduous Tree,60,35,40,Spring,Maintains a central leader. Seedless. A selection from North Dakota State Univ.,\"Green, Purple"
    },
    {
        "Id": 183,
        "Name": "Quaking Aspen (Trembling Aspen)",
        "Scientific name": "Populus tremuloides",
        "Binomial": "POTR",
        "Plant Type": "Deciduous Tree",
        "Height": 60,
        "Spread": 30,
        "Root Depth": 32,
        "Seasonal Interest": "Fall",
        "Notes": "Quaking aspen is native to and the most widely distributed tree in North America. It occurs from Newfoundland west to Alaska and south to Virginia, Missouri, Nebraska, and northern Mexico. A few scattered populations occur farther south in Mexico to Guanajuato. Quaking aspen is distributed fairly continuously in the East. Native species that reseeds itself after forest fires. Good in naturalistic plantings. Plant named because leaves quake in wind. Bark greenish to white. Subject to canker. It is typically dioecious, with a given clone being either male or female. The root system is relatively shallow, with widespreading lateral roots and vertical sinker roots descending from the laterals. Laterals may extend over 100 feet (30 m) into open areas. Vertical roots of quaking aspen in Utah extended more than 9 feet (2.7 m) down, branching into fine, dense roots at their extremities. Quaking aspen forms clones connected by a common parent root system. It is typically dioecious, with a given clone being either male or female. Some clones produce both stamens and pistils, however. Quaking aspen stands may consist of a single clone or aggregates of clones.",
        "Flower Color": "Gray",
        "Root Type": "Fibrous Shallow, Long Rhizome",
        "Bloom Time": "Spring - Late Spring",
        "Fruit Time": "Summer",
        "Texture": "Medium",
        "Form": "Pyramidal",
        "Growth Rate": "Fast",
        "Insect Predation": "Major",
        "Disease": "Major",
        "Light": "Full_Sun",
        "Hardiness Zone": "2 -- 6",
        "Soil Moisture": "Wet, Moderate, Dry",
        "Soil pH": "6.0 - 9.0",
        "Ecological Function": "Domestic Animal Forage, Erosion Control, Erosion Control, Reclamator, Soil Builder, Water Purifier, Water Purifier, Wildlife Food, Wildlife Habitat, Wildlife Habitat, Windbreak",
        "Human Use/Crop\r": "Aromatics/Fragrance, Biomass, Coppice, Food, Food, Food, Medicine, Medicine, Medicine, Ornamental, Ornamental, Wood\"\r\n2722,\"Swedish Columnar Aspen, Eurasian aspen"
    },
    {
        "Id": 7973,
        "Name": "Atemoya",
        "Scientific name": "Annona squamosa × A. cherimola",
        "Binomial": "ANSQ",
        "Plant Type": "Deciduous Tree",
        "Height": 30,
        "Spread": 30,
        "Root Depth": 24,
        "Seasonal Interest": "Spring",
        "Notes": "he atemoya, Annona squamosa × A. cherimola, is a hybrid of the sugar apple and cherimoya, qq.v. It was for many years mistakenly called custard apple or cherimoya in Queensland and New South Wales. The name applied in Venezuela is chirimorinon. Atemoyas for rootstocks are raised from seeds which germinate in about 4 weeks in seedbeds. Seedlings are transplanted to nursery rows when they are a year old and they are placed 18 in (45 cm) apart in rows 3 ft (90 cm) apart. Grafting is done in the spring, using the whip- or tongue-graft. If older trees are top worked, it is done by cleft- or bark-grafting. Scion wood is taken from selected cultivars after the leaves have fallen. In Florida and India, the atemoya is usually grafted onto the custard apple or sugar apple. Cherimoya is used as a rootstock in Israel. Atemoya trees in the home landscape are susceptible to trunk injury caused by lawn mowers and weed eaters. Maintain a grass-free area 2 to 5 or more feet (0.6–1.5 m) away from the trunk of the tree. Never hit the tree trunk with lawn mowing equipment and never use a weed eater near the tree trunk. Mechanical damage to the trunk of the tree will result in weakening the tree and if",
        "Flower Color": "Green, White",
        "Root Type": "Fibrous Shallow, Short Rhizome",
        "Bloom Time": "Spring - Early Summer",
        "Fruit Time": "Summer",
        "Texture": "Medium",
        "Form": "Rounded",
        "Growth Rate": "Fast",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "",
        "Hardiness Zone": "10 -- 13",
        "Soil Moisture": "",
        "Soil pH": "4.3 - 8.0",
        "Ecological Function": "Dynamic Accumulator, Insectory",
        "Human Use/Crop\r": "Food\r"
    },
    {
        "Id": 2901,
        "Name": "Avocado",
        "Scientific name": "Persea americana",
        "Binomial": "PEAM",
        "Plant Type": "Deciduous Tree",
        "Height": 50,
        "Spread": 35,
        "Root Depth": 36,
        "Seasonal Interest": "All Year",
        "Notes": "Cold tenderness varies with different cultivars. Needs well-drained soils.",
        "Flower Color": "Green, White",
        "Root Type": "Fibrous Shallow, Short Rhizome",
        "Bloom Time": "Winter - Early Spring",
        "Fruit Time": "Spring - Fall",
        "Texture": "Coarse",
        "Form": "Rounded",
        "Growth Rate": "Fast",
        "Insect Predation": "Minor",
        "Disease": "Medium",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "9 -- 11",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "5.0 - 8.0",
        "Ecological Function": "Domestic Animal Forage, Insectory, Insectory",
        "Human Use/Crop\r": "Dye, Essential Oil, Food, Medicine, Soap, Wood, Wood\"\r\n2939,Basul (Guato),Erythrina edulis,ERED,Deciduous Tree,45,23,48,,\"Unpredictable harvest time, even for trees in the same stand. Needs shade when young. Does best in well-drained soils. . Erythrina edulis is easily propagated from seed or cuttings, but seedlings tend to root deeper and live longer than cuttings. Seed should be removed from pods immediately and stored in paper bags in a cool, dark place. They lose viability quickly and should be planted within eight days of harvesting. Viability can be extended up to 20 days by dipping seeds for a moment in molten paraffin so that a thin layer of paraffin coats the entire seed."
    },
    {
        "Id": 315,
        "Name": "Pin Cherry (Fire Cherry)",
        "Scientific name": "Prunus pensylvanica",
        "Binomial": "PRPE",
        "Plant Type": "Deciduous Tree",
        "Height": 35,
        "Spread": 35,
        "Root Depth": 20,
        "Seasonal Interest": "Spring",
        "Notes": "Pin cherry is a shrub or small tree. It generally has a straight trunk and a narrow, round-topped crown, though it may form thickets. Branches, at first ascending, become more or less horizontal and spreading with age. Pin cherry generally grows 15 to 50 feet (5-15 m) tall and 4 to 20 inches (10-51 cm) in diameter. However, trees up to 100 feet tall (30 m) have been found in the southern Appalachians, with the largest size attained on western slopes of the Great Smoky Mountains. Though Prunus spp. have been reported to be ectomycorrhizal, studies in Ontario found no evidence of ectomycorrhizae in pin cherry roots. Endomycorrhizae were generally scarce in pin cherry roots, and most often absent altogether. Seldom planted native tree even though it has attractive flowers, fruit, and fall color. Tolerant of all but poorly drained soils. Pin cherry is short lived, maturing rapidly and dying off at 20 to 40 years. Stands may begin to have a pulse of dead pin cherry wood deposition 15 years after disturbance. Pin cherry allocates relatively less carbon to structural stem issues and to fine roots than do other hardwoods, contributing to the common occurrence of stem snap at the root crown",
        "Flower Color": "White",
        "Root Type": "Fibrous Shallow, Long Rhizome",
        "Bloom Time": "Spring - Late Spring",
        "Fruit Time": "Spring - Summer",
        "Texture": "Medium",
        "Form": "Columnar",
        "Growth Rate": "Fast",
        "Insect Predation": "Major",
        "Disease": "Major",
        "Light": "Full_Sun",
        "Hardiness Zone": "2 -- 6",
        "Soil Moisture": "Wet, Moderate, Dry",
        "Soil pH": "4.3 - 6.5",
        "Ecological Function": "Erosion Control, Insectory, Nurse, Reclamator, Wildlife Food, Wildlife Habitat",
        "Human Use/Crop\r": "Biomass, Dye, Food, Food, Medicine, Medicine, Ornamental, Wood\"\r\n8314,Short Petaled Bush Cherry,Prunus brachypetala,PRBR,Deciduous Tree,8,6,18,Spring-Fall,\"Prunus brachypetala is a species of bush cherry native to Turkey, Iraq and Iran. Distribution: Turkey (E-Anatolia, SE-Anatolia); Iran (EC-Iran, S-Iran, W-Iran); Iraq (NE-Iraq, NW-Iraq) 34 IRN IRQ TUR. - The clade to which P. brachypetala belongs according to the two studies is now a section of Prunus subg. Prunus. The plant is used in fruit breeding programs. A deciduous shrub of sturdy habit, usually growing 3.28 - 6.56 feet tall. It originates in Central to Western Asia – from Afghanistan to Turkey, including the Caucasus. This area is also called the Irano-Turanian phytogeographical region. HABITAT: Dry stony & pebbly mountain slopes amongst shrubs, Woodland Garden Sunny Edge. The species is hermaphrodite (has both male and female organs) and is pollinated by insects. Thrives in a well-drained moisture-retentive loamy soil. Prefers some lime in the soil but is likely to become chlorotic if too much lime is present. Requires the sunniest possible position. Succeeds in a hot dry position. Most members of this genus are shallow-rooted and will produce suckers if the roots are damaged. ELEVATION: Above 3000 feet. PROPAGATION: Seeds, cuttings, & layering."
    },
    {
        "Id": 278,
        "Name": "American Elm (Gray Elm, White Elm)",
        "Scientific name": "Ulmus americana",
        "Binomial": "ULAM",
        "Plant Type": "Deciduous Tree",
        "Height": 100,
        "Spread": 100,
        "Root Depth": 42,
        "Seasonal Interest": "Spring",
        "Notes": "Not recommended because of Dutch Elm Disease. Before DED, this was the most widely planted shade and street tree in the northern U.S. and Canada because of its tolerance to a wide range of conditions. The root system of American elm varies according to soil moisture and texture. In heavy, wet soils the root system is wide spreading, with most of the roots within 3 to 4 feet (1.0 - 1.2 m) of the surface. On drier soils, American elm develops a deep taproot. Dutch elm disease, a fatal fungal disease spread by airborne bark beetles that attacks the water-conducting tissue of the tree, resulting in wilting, defoliation and death. There is no known cure. Phloem necrosis, disease caused by a phytoplasma that attacks the food-conducting tissue of this tree, usually resulting in a loosening of the bark, wilting, defoliation and death. Wetwood, bacterial disease that results in wilting and dieback. Various wilts, rots, cankers and leaf spots may also occur. Insect visitors include borers, leaf miner, beetles, mealy bugs, caterpillars and scaleis.",
        "Flower Color": "Brown",
        "Root Type": "Tap, Fibrous Shallow",
        "Bloom Time": "Spring - Late Spring",
        "Fruit Time": "Spring",
        "Texture": "Medium",
        "Form": "Upright",
        "Growth Rate": "Fast",
        "Insect Predation": "Major",
        "Disease": "Major",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "3 -- 9",
        "Soil Moisture": "Wet, Moderate, Dry",
        "Soil pH": "5.5 - 8.0",
        "Ecological Function": "Erosion Control, Erosion Control, Insectory, Reclamator, Soil Builder, Wildlife Food, Wildlife Habitat, Windbreak",
        "Human Use/Crop\r": "Biomass, Fiber, Fiber, Food, Medicine, Ornamental, Ornamental, Wood, Wood, Wood, Wood\"\r\n8032,\"European White Elm (Fluttering Elm, Spreading Elm)"
    },
    {
        "Id": 4647,
        "Name": "Japanese Elm",
        "Scientific name": "Ulmus davidiana var. japonica",
        "Binomial": "ULDA",
        "Plant Type": "Deciduous Tree",
        "Height": 55,
        "Spread": 35,
        "Root Depth": 60,
        "Seasonal Interest": "Spring-Fall",
        "Notes": "A hardy spreading umbrella-shaped tree native to Japan and northeastern Asia. This species is reported to be highly resistant to Dutch Elm disease and is used to develop resistant cultivars. Roots easily from softwood cuttings under mist, 3000–8000 ppm IBA, in 3 to 4 weeks.",
        "Flower Color": "Green, Red",
        "Root Type": "Fibrous Deep, Long Rhizome",
        "Bloom Time": "Early Spring - Spring",
        "Fruit Time": "Summer",
        "Texture": "Coarse",
        "Form": "Rounded",
        "Growth Rate": "Fast",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun",
        "Hardiness Zone": "2 -- 8",
        "Soil Moisture": "Wet, Moderate",
        "Soil pH": "5.5 - 8.0",
        "Ecological Function": "Erosion Control, Insectory, Windbreak",
        "Human Use/Crop\r": "Cleanser/Scourer, Medicine, Medicine\"\r\n279,Regal Elm,Ulmus carpinifolia 'Regal',ULCA,Deciduous Tree,60,40,42,Spring,Introduced in 1983 by the University of Wisconsin. Develops a strong central leader and rather open growth habit without the majestic qualities of the American Elm. Hardiness south of zone 4 is unknown.,Brown,Fibrous Shallow,Spring - Late Spring,,Medium,Upright,Fast,Major,Minor,\"Full_Sun, Partial_Shade"
    },
    {
        "Id": 280,
        "Name": "Sapporo Autumn Gold Elm",
        "Scientific name": "Ulmus carpinifolia 'Sapporo Autumn Gold'",
        "Binomial": "ULCA",
        "Plant Type": "Deciduous Tree",
        "Height": 65,
        "Spread": 40,
        "Root Depth": 42,
        "Seasonal Interest": "Spring",
        "Notes": "Developed in Wisconsin and introduced in 1975. Upright v-shaped form resembling a densely branched American Elm. Glossy dark green leaves. Elm leaf beetle can be a problem. Hardiness south of zone 4 is unknown.",
        "Flower Color": "Brown",
        "Root Type": "Fibrous Shallow",
        "Bloom Time": "Spring - Late Spring",
        "Fruit Time": "",
        "Texture": "Medium",
        "Form": "Upright",
        "Growth Rate": "Fast",
        "Insect Predation": "Major",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "3 -- 5",
        "Soil Moisture": "Wet, Moderate",
        "Soil pH": "7.0 - 8.0",
        "Ecological Function": "Nurse",
        "Human Use/Crop\r": "\r"
    },
    {
        "Id": 200,
        "Name": "Siberian Elm",
        "Scientific name": "Ulmus pumila",
        "Binomial": "ULPU",
        "Plant Type": "Deciduous Tree",
        "Height": 70,
        "Spread": 50,
        "Root Depth": 24,
        "Seasonal Interest": "Spring",
        "Notes": "Native to eastern Siberia, northern China, Manchuria, and Korea. Tree grows under any kind of conditions. Has been widely planted in shelterbelts but considered to have little ornamental use. Very adaptable, often grows under adverse conditions. Resistant to Dutch elm disease. Generally considered a poor ornamental tree, mostly because of its weak branches, messy habit, and susceptibility to insect attack, especially leaf beetles. The leaves often eaten by elm leaf beetle. Other problem insects include borers, leaf miners, mealy bugs, caterpillars, and scale. It is resistant but not immune to dutch elm disease and phloem necrosis. It suffers from various wilts, rots, and cankers.",
        "Flower Color": "Purple",
        "Root Type": "Fibrous Shallow, Fibrous Deep",
        "Bloom Time": "Early Spring - Spring",
        "Fruit Time": "Spring - Summer",
        "Texture": "Medium",
        "Form": "Irregular",
        "Growth Rate": "Fast",
        "Insect Predation": "Major",
        "Disease": "Medium",
        "Light": "Full_Sun",
        "Hardiness Zone": "4 -- 9",
        "Soil Moisture": "Wet, Moderate, Dry",
        "Soil pH": "5.5 - 8.0",
        "Ecological Function": "Domestic Animal Forage, Erosion Control, Erosion Control, Hedge, Reclamator, Reclamator, Windbreak",
        "Human Use/Crop\r": "Fiber, Food, Medicine, Ornamental, Wood\"\r\n7824,\"Small Leaved Elm (Field Elm, Smooth Leaf Elm)"
    },
    {
        "Id": 4294,
        "Name": "Field Maple (Hedge Maple)",
        "Scientific name": "Acer campestre",
        "Binomial": "ACCA",
        "Plant Type": "Deciduous Tree",
        "Height": 32,
        "Spread": 35,
        "Root Depth": 24,
        "Seasonal Interest": "All Year",
        "Notes": "Native to Europe, W. Asia. The UK's only native maple, it is found growing in woods, scrub and hedgerows, and on chalk lowland. Acer campestre is a deciduous tree with a round-headed canopy; it usually grows from 20-32 feet tall, with occasional specimens to 66 feet. It is a very cold-hardy plant, able to tolerate temperatures down to around -22°f when dormant. Does well in chalky soils. Growth is fast once the trees are established, but this later slows down and trees take about 50 years to reach maturity. Trees produce seed in about 10 years from sowing. Air pollution tolerant. The field maple is a bad companion plant, inhibiting the growth of nearby plants. The plant is harvested from the wild, mainly for local use as a food, medicine and source of materials. After pollination by insects, flowers develop into large, winged fruits which are dispersed by wind.",
        "Flower Color": "Green",
        "Root Type": "Tap, Fibrous Shallow",
        "Bloom Time": "Early Spring - Late Spring",
        "Fruit Time": "Fall",
        "Texture": "Medium",
        "Form": "Rounded",
        "Growth Rate": "Fast",
        "Insect Predation": "Minor",
        "Disease": "Medium",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "5 -- 8",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "6.0 - 8.0",
        "Ecological Function": "Air Cleaner, Hedge, Insectory, Insectory, Reclamator",
        "Human Use/Crop\r": "Biomass, Coppice, Food, Medicine, Ornamental, Ornamental, Wood, Wood, Wood, Wood\"\r\n288,Freeman's Maple,Acer x freemanii,ACx,Deciduous Tree,60,40,32,Spring,\"Hybrid cross between red maple and silver maple. Leaf resembles silver more than red. Distinctly upright and good for narrow planting space. Silver gray bark. Own root stock. Cvs include Armstrong (Autumn Blaze),Jeffersred, Celebration, Marmo, Morgan, and Scarlet Sentinel. This hybrid has the strong branch attachment of the red maple and fast growth rate of the silver maple. Less susceptible to chlorosis symptoms (yellowing leaves) than red or silver maples."
    },
    {
        "Id": 2402,
        "Name": "White Mulberry",
        "Scientific name": "Morus alba",
        "Binomial": "MOAL",
        "Plant Type": "Deciduous Tree",
        "Height": 50,
        "Spread": 40,
        "Root Depth": 24,
        "Seasonal Interest": "Spring-Summer",
        "Notes": "Resembling blackberries in shape, cylindrical, 1 to 1 ¼ inch long, fleshy multiple of drupes, pale pink to dark red, not as juicy as red mulberry, maturing in June to August; unripe fruit is a known stomach irritant. Wind pollinated. Tolerates juglone. Breakage: susceptible to breakage either at the crotch due to poor collar formation, or the wood itself is weak and tends to break.",
        "Flower Color": "White",
        "Root Type": "Tap, Fibrous Deep",
        "Bloom Time": "Spring - Late Spring",
        "Fruit Time": "Spring - Summer",
        "Texture": "Medium",
        "Form": "Rounded",
        "Growth Rate": "Fast",
        "Insect Predation": "Medium",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "5 -- 10",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "6.0 - 7.5",
        "Ecological Function": "Domestic Animal Forage, Erosion Control, Hedge, Soil Builder, Wildlife Food, Wildlife Habitat",
        "Human Use/Crop\r": "Biomass, Coppice, Dye, Fiber, Fiber, Food, Medicine, Oil, Wax, Resin or Polish, Ornamental, Pollard, Wood, Wood\"\r\n4595,Downy Oak,Quercus pubescens,QUPU,Deciduous Tree,60,60,250,Fall,\"The bark of downy oaks is characterised by deep furrows and rough and thick plates which represent an effective protection against grazing fires. Species concept is particularly hard to be applied to downy oak, primarily because of frequent hybridisation with other sympatric deciduous oaks such as Pyrenean oak (Quercus pyrenaica) and Portuguese oak (Quercus faginea)4, 5, sessile oak (Quercus petraea) and Hungarian oak (Quercus frainetto)6-8; secondly the complex history of its climate-driven survival and migration during Pleistocene glaciations9-13; and finally the fragmentation and isolation of its populations due to millennia of deforestation. These counteracting mechanisms (hybridisation vs. inbreeding and genetic drift due to habitat fragmentation) explain most of the high morphological variability of its populations."
    },
    {
        "Id": 41,
        "Name": "Tower Poplar",
        "Scientific name": "Populus canescens 'Tower'",
        "Binomial": "POCA",
        "Plant Type": "Deciduous Tree",
        "Height": 50,
        "Spread": 10,
        "Root Depth": 12,
        "Seasonal Interest": "Spring",
        "Notes": "Hardy disease resistant variety for cold climates. Use for narrow screening. Seedless.",
        "Flower Color": "Green",
        "Root Type": "Fibrous Shallow",
        "Bloom Time": "Spring - Late Spring",
        "Fruit Time": "",
        "Texture": "Medium",
        "Form": "Columnar",
        "Growth Rate": "Fast",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun",
        "Hardiness Zone": "3 -- 5",
        "Soil Moisture": "Wet, Moderate, Dry",
        "Soil pH": "6.0 - 8.0",
        "Ecological Function": "Erosion Control, Toxin Absorber, Water Purifier, Wildlife Food, Windbreak",
        "Human Use/Crop\r": "Coppice, Food, Medicine, Ornamental, Wood\"\r\n33,\"White Poplar (Abele, Silver Poplar)"
    },
    {
        "Id": 4489,
        "Name": "Foxglove Tree",
        "Scientific name": "Paulownia tomentosa",
        "Binomial": "PATO",
        "Plant Type": "Deciduous Tree",
        "Height": 105,
        "Spread": 50,
        "Root Depth": 48,
        "Seasonal Interest": "Spring",
        "Notes": "Landscapes with high fire severity may provide quality habitat for princesstree. High-severity fire produces favorable conditions for princesstree germination and establishment but killing mature trees and some seeds, particularly those in the litter. Conversely, low-severity fire may not kill mature princesstree trees or their seeds but is less likely to create conditions necessary for germination and establishment. More information is needed about the establishment and persistence of princesstree seedlings and sprouts and their ability to compete with native vegetation after fire.",
        "Flower Color": "Purple",
        "Root Type": "Fibrous Deep, Fibrous Shallow",
        "Bloom Time": "Spring - Late Spring",
        "Fruit Time": "Summer - Fall",
        "Texture": "Medium",
        "Form": "Pyramidal",
        "Growth Rate": "Fast",
        "Insect Predation": "",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "6 -- 9",
        "Soil Moisture": "",
        "Soil pH": "5.5 - 7.5",
        "Ecological Function": "Domestic Animal Forage, Insectory, Reclamator",
        "Human Use/Crop\r": "Coppice, Medicine, Ornamental, Wood\"\r\n8022,Tallow Tree,Falconeria insignis,FAIN,Deciduous Tree,50,60,48,Spring-Fall,\"Often fruiting when leafless; bark very thick and rough. During flowering, the tree has a curious appearance - it is completely leafless, with only long, sharp, upright spikes at the end of branches."
    },
    {
        "Id": 4426,
        "Name": "Japanese Walnut (Heartnut)",
        "Scientific name": "Juglans ailanthifolia",
        "Binomial": "JUAI",
        "Plant Type": "Deciduous Tree",
        "Height": 65,
        "Spread": 65,
        "Root Depth": 60,
        "Seasonal Interest": "Summer-Fall",
        "Notes": "Juglans ailantifolia is resistent to canker fungus that has attacked native butternut (Juglans cinerea), and has become a popular street tree. It can hybridize with butternut, and nurseries are trying several backcrosses to breed a more resistant butternut. A variety of the Japanese walnut, Juglans ailantifolia var. cordiformis, is known as the Heartnut because of its heart-shaped nuts (cordiformis = heart-shaped). Cultivars of Heartnut have been developed and are grown commercially. The nuts of these selections easily crack at the suture and released the heart-shaped kernel in one or two pieces. Heartnut trees are partially self-pollinating, however, at least two different seedlings or improved cultivars will be required for full production. Persian walnuts, butternuts, or buartnuts (butternut x heartnut) will also pollinate heartnuts, however, pollination by other heartnuts is most recommended.",
        "Flower Color": "Green",
        "Root Type": "Tap, Long Rhizome",
        "Bloom Time": "Spring - Late Spring",
        "Fruit Time": "Fall",
        "Texture": "Coarse",
        "Form": "Rounded",
        "Growth Rate": "Fast",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun",
        "Hardiness Zone": "5 -- 7",
        "Soil Moisture": "Moderate",
        "Soil pH": "5.0 - 6.0",
        "Ecological Function": "Insectory, Insectory, Wildlife Food, Wildlife Food",
        "Human Use/Crop\r": "Dye, Food, Food, Medicine, Oil, Wax, Resin or Polish, Ornamental, Wood\"\r\n8250,\"Black Wattle (Australian Acacia, Green Wattle)"
    },
    {
        "Id": 7719,
        "Name": "Safsaf Willow (Cape Willow, Wild Willow)",
        "Scientific name": "Salix mucronata",
        "Binomial": "SAMU",
        "Plant Type": "Deciduous Tree",
        "Height": 39,
        "Spread": 40,
        "Root Depth": 36,
        "Seasonal Interest": "Spring-Fall",
        "Notes": "The Safsaf Willow may be found growing along streams and riverbanks in much of the south east, south, and south west Cape, specifically along the Kei and Bashee Rivers, the Sundays River, the Fish River, the Breede River and the Groot and Klein Berg Rivers of South Africa. This graceful semi-deciduous to evergreen tree grows up to 15 m with an open crown and slightly drooping branches. Older trees have fissured, brown bark, while younger trees have smooth, green-red bark. The leaves are simple, alternate and taper to both ends. They are glossy, dark green above and light green below. Drooping branches are present and the overall appearance may be untidy. It requires a damp spot and cannot tolerate dry conditions. The roots can be aggressive. Propagation is most rapidly achieved through cultivation of cuttings or truncheons, but seeds may be sown in trays filled with river sand.",
        "Flower Color": "Green, Yellow",
        "Root Type": "Fibrous Shallow, Long Rhizome",
        "Bloom Time": "Early Spring - Spring",
        "Fruit Time": "Summer - Fall",
        "Texture": "Medium",
        "Form": "Spreading",
        "Growth Rate": "Fast",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "9 -- 10",
        "Soil Moisture": "Wet, Moderate",
        "Soil pH": "6.5 - 8.0",
        "Ecological Function": "Domestic Animal Forage, Erosion Control, Insectory, Insectory, Insectory, Toxin Absorber, Water Purifier, Wildlife Food, Windbreak",
        "Human Use/Crop\r": "Coppice, Dye, Fiber, Medicine, Ornamental, Wood\"\r\n4619,Scouler's Willow,Salix scouleriana,SASC,Deciduous Tree,35,30,12,Spring-Fall,Dioecious. Single or multi stemmed. Occurs on drier habitats than most willows. Best in full sun. Hybridizes easily with other Salix spp. Easily propagated with stem cuttings.,\"Green, Yellow"
    },
    {
        "Id": 2657,
        "Name": "Zestar! Apple",
        "Scientific name": "Malus pumila 'Zestar!'",
        "Binomial": "MAPU",
        "Plant Type": "Deciduous Tree",
        "Height": 14,
        "Spread": 10,
        "Root Depth": 36,
        "Seasonal Interest": "Spring-Fall",
        "Notes": "A summer apple that is sweet, crisp and juicy.",
        "Flower Color": "White",
        "Root Type": "Fibrous Deep",
        "Bloom Time": "Late Spring",
        "Fruit Time": "Summer - Fall",
        "Texture": "Medium",
        "Form": "Rounded",
        "Growth Rate": "Moderate",
        "Insect Predation": "Medium",
        "Disease": "Medium",
        "Light": "Full_Sun",
        "Hardiness Zone": "4 -- 9",
        "Soil Moisture": "Moderate",
        "Soil pH": "5.1 - 7.5",
        "Ecological Function": "Erosion Control, Soil Builder",
        "Human Use/Crop\r": "Food\r"
    },
    {
        "Id": 2046,
        "Name": "Apricot",
        "Scientific name": "Prunus armeniaca",
        "Binomial": "PRAR",
        "Plant Type": "Deciduous Tree",
        "Height": 25,
        "Spread": 25,
        "Root Depth": 36,
        "Seasonal Interest": "Spring-Fall",
        "Notes": "White flowers in March; bronze foliage in spring that turns green in summer",
        "Flower Color": "White",
        "Root Type": "Fibrous Shallow, Short Rhizome",
        "Bloom Time": "Spring - Late Spring",
        "Fruit Time": "Summer",
        "Texture": "Medium",
        "Form": "Rounded",
        "Growth Rate": "Moderate",
        "Insect Predation": "Medium",
        "Disease": "Medium",
        "Light": "Full_Sun",
        "Hardiness Zone": "3 -- 8",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "6.5 - 7.5",
        "Ecological Function": "Insectory, Soil Builder",
        "Human Use/Crop\r": "Dye, Essential Oil, Food, Medicine, Wood\"\r\n2395,Moongold Apricot,Prunus armeniaca 'Moongold',PRAR,Deciduous Tree,20,20,,Spring-Fall,White flowers in March; bronze foliage in spring that turns green in summer,White,Fibrous Shallow,Spring - Late Spring,,,Rounded,Moderate,Minor,Medium,Full_Sun,3 -- 8,Moderate,6.5 - 7.5,,\"Dye, Essential Oil, Food, Medicine, Wood\"\r\n2383,Sungold Apricot,Prunus armeniaca 'Sungold',PRAR,Deciduous Tree,20,20,,Spring-Fall,White flowers in March; bronze foliage in spring that turns green in summer,White,Fibrous Shallow,Spring - Late Spring,,,Rounded,Moderate,Minor,Medium,Full_Sun,3 -- 8,Moderate,6.5 - 7.5,,\"Dye, Essential Oil, Food, Medicine, Wood\"\r\n100,Autumn Blaze Ash,Fraxinus americana 'Autumn Blaze',FRAM,Deciduous Tree,60,35,40,Spring,\"First White Ash developed for the prairie region; originated near Roseau, MN. Female has a light seed crop. It is highly tolerant of urban pollution and will even thrive in inner city environments. This is a selection of a native North American species. Planting new ash trees is no longer recommended due to the trees susceptibility to the emerald ash borer, a pest that feeds under the bark and bores into the wood. Emerald ash borer will will typically kill an ash tree within 3 to 5 years after infestation and, once infestation occurs, it is difficult to eradicate."
    },
    {
        "Id": 2368,
        "Name": "Northstar Cherry",
        "Scientific name": "Prunus cerasus 'Northstar'",
        "Binomial": "PRCE",
        "Plant Type": "Deciduous Tree",
        "Height": 10,
        "Spread": 8,
        "Root Depth": 0,
        "Seasonal Interest": "Spring-Summer",
        "Notes": "White flower; early harvest; deep green leaves;attractive rose-brown bark",
        "Flower Color": "White",
        "Root Type": "",
        "Bloom Time": "Late Spring - Early Summer",
        "Fruit Time": "",
        "Texture": "Medium",
        "Form": "Rounded",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Medium",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "4 -- 9",
        "Soil Moisture": "Moderate",
        "Soil pH": "6.5 - 7.5",
        "Ecological Function": "Hedge, Insectory, Wildlife Food",
        "Human Use/Crop\r": "Dye, Food, Medicine\"\r\n1969,Sour Cherry,Prunus cerasus,PRCE,Deciduous Tree,25,45,24,Spring-Summer,\"White flower; early harvest; deep green leaves;attractive rose-brown bark. The species is believed to have originated as a natural hybrid between Prunus avium and Prunus fruticosa in the Iranian Plateau or Eastern Europe where the two species come into contact. Prunus fruticosa is believed to have provided its smaller size and its sour tasting fruit. The hybrids then stabilised and interbred to form a new, distinct species from which, over time, many cultivars have been selected. The various cultivars have been classified into groups by different authors, often placing these groups as different subspecies. There does not, however, appear to be a generally accepted taxonomy for these groups. Unlike sweet cherry, all widely grown varieties of sour cherry are self-fertile. Propagation: Seed - requires 2 - 3 months cold stratification and is best sown in a cold frame as soon as it is ripe. Sow stored seed in a cold frame as early in the year as possible. Protect the seed from mice etc. The seed can be rather slow, sometimes taking 18 months to germinate. Prick out the seedlings into individual pots when they are large enough to handle. Grow them on in a greenhouse or cold frame for t"
    },
    {
        "Id": 37,
        "Name": "Roundleaf Dogwood",
        "Scientific name": "Cornus rugosa",
        "Binomial": "CORU",
        "Plant Type": "Deciduous Tree",
        "Height": 12,
        "Spread": 12,
        "Root Depth": 18,
        "Seasonal Interest": "Summer",
        "Notes": "Tolerant of heavy clay soil.",
        "Flower Color": "White",
        "Root Type": "Fibrous Shallow",
        "Bloom Time": "Spring - Late Spring",
        "Fruit Time": "Summer - Fall",
        "Texture": "Coarse",
        "Form": "Rounded",
        "Growth Rate": "Moderate",
        "Insect Predation": "Major",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "3 -- 10",
        "Soil Moisture": "Moderate",
        "Soil pH": "6.4 - 7.8",
        "Ecological Function": "Domestic Animal Forage, Hedge, Insectory, Wildlife Food",
        "Human Use/Crop\r": "Aromatics/Fragrance, Medicine, Ornamental\"\r\n40,Yellow Twig Dogwood,Cornus sericea 'Bud's Yellow',COSE,Deciduous Tree,8,6,16,Spring,\"Also listed as C. lutea. Selection with yellow stems. Originally developed by Arnold Arboretum, first offered for sale by Spath Nursery, in Germany."
    },
    {
        "Id": 202,
        "Name": "Cathedral Elm",
        "Scientific name": "Ulmus x cathedral",
        "Binomial": "ULx",
        "Plant Type": "Deciduous Tree",
        "Height": 80,
        "Spread": 60,
        "Root Depth": 42,
        "Seasonal Interest": "Spring",
        "Notes": "Cathedral Elm is a hybrid developed at the University of Wisconsin by crossing Japanese Elm (Ulmus parvifolia) with Siberian Elm (Ulmus pumila). It has a spreading vase-like shape, with good resistance to Dutch elm disease, elm leaf beetle and other leaf-cutting insects. It requires regular pruning during the first 15 years to develop a sound structure. Developed at the University of Wisconsin and resembles the Japanese elm in appearance. When inoculated with Dutch Elm Disease, it has no observable damage or only tip injury and the tree is able to wall off the area to prevent disease spread. The tree requires relatively high levels of maintenance owing to its predilection for breaks occasioned by branch inclusions.",
        "Flower Color": "Brown",
        "Root Type": "Fibrous Shallow",
        "Bloom Time": "Spring - Late Spring",
        "Fruit Time": "Spring - Summer",
        "Texture": "Medium",
        "Form": "Upright",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "5 -- 9",
        "Soil Moisture": "Wet, Moderate",
        "Soil pH": "7.0 - 8.0",
        "Ecological Function": "Air Cleaner",
        "Human Use/Crop\r": "Ornamental\r"
    },
    {
        "Id": 7893,
        "Name": "Cedar elm",
        "Scientific name": "Ulmus crassifolia",
        "Binomial": "ULCR",
        "Plant Type": "Deciduous Tree",
        "Height": 90,
        "Spread": 60,
        "Root Depth": 36,
        "Seasonal Interest": "Spring-Summer",
        "Notes": "Long-lived, grow moderately fast, have shown some susceptibility to Dutch Elm. Susceptible to breakage either at the crotch due to poor collar formation, or the wood itself is weak and tends to break. Propagation: Collect seeds by raking from the ground soon after they fall or by stripping them from the branches. Air-dry a few days before storing. Store in sealed, refrigerated containers. Seed Treatment: Fall-ripened seeds may be stratified for 30-60 days at 36-40 degrees. Elms germinate quickly from fresh, untreated seeds. Sow spring-ripening species immediately after collection; fall-ripening after winter storage and stratification.",
        "Flower Color": "Green",
        "Root Type": "Fibrous Shallow, Fibrous Deep",
        "Bloom Time": "Late Summer - Early Fall",
        "Fruit Time": "Fall - ?",
        "Texture": "Medium",
        "Form": "Rounded",
        "Growth Rate": "Moderate",
        "Insect Predation": "Major",
        "Disease": "Major",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "6 -- 9",
        "Soil Moisture": "Wet, Moderate, Dry",
        "Soil pH": "6.1 - 9.0",
        "Ecological Function": "Wildlife Food, Wildlife Food, Wildlife Habitat",
        "Human Use/Crop\r": "Food, Ornamental, Wood\"\r\n4648,Chinese Elm (Lacebark Elm),Ulmus parvifolia,ULPA,Deciduous Tree,60,60,48,All Year,\"Plant in the full sun to partial shade and while it is adaptable to different soil and pH types, it prefers well-drained soil. It tolerates being planted in wet sites and is moderately salt tolerant. Chinese Elm makes a shade-resistant street or urban tree that is resistant to Dutch elm disease and air pollution. Unfortunately, it has very low wind resistance and has the potential to be weedy through self-seeding in surrounding landscapes. Chinese elm has good resistance to Dutch elm disease, a fatal fungal disease spread by airborne bark beetles. It also has good resistance to Japanese beetle and elm leaf beetle. Occasional disease problems include wilts, rots, cankers and leaf spots. Branches tend to break when stressed with snow, ice or wind. This species should not be confused with the much inferior Siberian elm, Ulmus pumila, which is often referred to as Chinese elm. The tree is evergreen in the southern extent of its range. Many cultivars are available for size and form."
    },
    {
        "Id": 300,
        "Name": "Red Elm (Slippery Elm, Gray Elm, Soft Elm)",
        "Scientific name": "Ulmus rubra",
        "Binomial": "ULRU",
        "Plant Type": "Deciduous Tree",
        "Height": 70,
        "Spread": 50,
        "Root Depth": 40,
        "Seasonal Interest": "Spring",
        "Notes": "Synonymous with Ulmus fulva. In nature, it can be found in wooded areas with moist to fairly dry calcareous soils and in cove forests in the low mountains containing soils rich in organic matter, and drier upland soils in Central and southern North America - Maine to Florida, west to Texas and North Dakota. throughout Canada and the lower 48 United States. A moderately fast-growing tree, it can live about 200 years in the wild. It can be weedy and messy due to seed production. In dense deciduous woodlands, Slippery Elm exists primarily as an understory tree. It benefits from disturbance that reduces competition from dominant canopy trees. The inner bark is slippery, thus its common name. Dutch elm disease, a fungal disease spread by beetles, attacks the inner tissue of the tree, resulting in wilting, defoliation and death. Susceptible to other elm diseases including phloem necrosis and wetwood, and various wilts, rots, cankers and leaf spots may also occur. Insects include borers, leaf miner, beetles, mealy bugs, caterpillars and scale.",
        "Flower Color": "Green, Red",
        "Root Type": "Fibrous Shallow",
        "Bloom Time": "Spring",
        "Fruit Time": "Spring - Summer",
        "Texture": "Medium",
        "Form": "Rounded",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Major",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "3 -- 7",
        "Soil Moisture": "Wet, Moderate, Dry",
        "Soil pH": "5.5 - 7.0",
        "Ecological Function": "Insectory, Wildlife Food, Wildlife Habitat",
        "Human Use/Crop\r": "Coppice, Medicine, Medicine, Medicine, Ornamental, Wood, Wood\"\r\n2732,Prairie Radiance Euonymus,Euonymus bungeana 'Verona',EUBU,Deciduous Tree,18,18,16,Spring-Fall,Selected in part for good winter hardiness.,Pink,Fibrous Shallow,Spring - Late Spring,Summer - Fall,Medium,Rounded,Moderate,Minor,Minor,\"Full_Sun, Partial_Shade"
    },
    {
        "Id": 3049,
        "Name": "Common Fig",
        "Scientific name": "Ficus carica",
        "Binomial": "FICA",
        "Plant Type": "Deciduous Tree",
        "Height": 30,
        "Spread": 35,
        "Root Depth": 36,
        "Seasonal Interest": "All Year",
        "Notes": "Best in organically rich and well-drained soils. Can be grown in zones 6 and 7 with significant dieback, and down to zone 5 with special care. Some cultivars have additional cold-hardiness. Some varieties produce 2 crops/year. Tolerant of hillsides. The fruits actually ripen inside the flpower. It is known as a syconium, an aggregate accessory fruits.",
        "Flower Color": "Green",
        "Root Type": "Fibrous Shallow, Rhizome",
        "Bloom Time": "",
        "Fruit Time": "Summer - Fall",
        "Texture": "Coarse",
        "Form": "Spreading",
        "Growth Rate": "Moderate",
        "Insect Predation": "Medium",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "6 -- 10",
        "Soil Moisture": "Moderate",
        "Soil pH": "4.5 - 8.5",
        "Ecological Function": "Domestic Animal Forage, Insectory, Wildlife Food",
        "Human Use/Crop\r": "Aromatics/Fragrance, Container Garden, Food, Medicine, Oil, Wax, Resin or Polish, Ornamental\"\r\n4373,\"Siberian Filbert (Asian Hazel, Glabrous Filbert)"
    },
    {
        "Id": 4374,
        "Name": "Indian Tree Hazel",
        "Scientific name": "Corylus jacquemontii",
        "Binomial": "COJA",
        "Plant Type": "Deciduous Tree",
        "Height": 82,
        "Spread": 50,
        "Root Depth": 36,
        "Seasonal Interest": "Spring-Fall",
        "Notes": "Found in the Himalayas, from Afghanistan to W. Nepal, at altitudes of 1800-3000 m. Closely allied to Corylus colurna, and considered to be no more than a sub-species by some botanists, it is an upright growing tree that does not produce suckers. C. jacquemonti is one of the important trees of temperate forest ecosystems. It provides provisioning, regulating and supportive ecosystem services to the human and wildlife. Seeds are highly nutritious and rich in protein, and comparable with Almond. The seeds collected from the natural forests and populations are traded in the local and regional markets.",
        "Flower Color": "Brown, Yellow",
        "Root Type": "Rhizome, Long Rhizome",
        "Bloom Time": "Early Spring - Spring",
        "Fruit Time": "Fall - Winter",
        "Texture": "Coarse",
        "Form": "Rounded",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "4 -- 8",
        "Soil Moisture": "Wet, Moderate",
        "Soil pH": "4.7 - 7.7",
        "Ecological Function": "Domestic Animal Forage, Reclamator, Wildlife Food",
        "Human Use/Crop\r": "Dye, Food, Food, Medicine, Medicine, Medicine, Wood\"\r\n4340,Scrub Hickory,Carya floridana,CAFL,Deciduous Tree,70,60,60,Spring-Fall,\"Scrub hickory varies in habit from a multi-trunked shrub, bearing fruit on stems 3 to 4 feet in height, to a single trunked tree of 50 to 70 feet in height. Confined to Central and South Florida. Grows in coastal scrub communities. Notable for wind resistance in hurricane prone sites.In the Coastal Plain in Florida, C. floridana has been found in sand pine woods with Lyonia ferruginea; sand pine-oak scrubs; sand ridge scrubs; hardwood hammocks; scrub oak-wiregrass ridges; and scrub barrens. It is an aggressive invader of open xeric woodlands; however, nutrient availability and water limit seedling survival. Scrub hickory is well-adapted to fire and following a burn quickly regenerates through production of new ramets rather than through germination of nuts in the soil."
    },
    {
        "Id": 26,
        "Name": "Northern Red Oak",
        "Scientific name": "Quercus rubra",
        "Binomial": "QURU",
        "Plant Type": "Deciduous Tree",
        "Height": 80,
        "Spread": 50,
        "Root Depth": 120,
        "Seasonal Interest": "Spring",
        "Notes": "Susceptible to oak wilt. Withstands city conditions. Will develop chlorosis in high PH soils. Leaves persist into winter. Bare root plants require sweating; not recommended for fall planting. Toxicity reported with browsing livestock.",
        "Flower Color": "Yellow",
        "Root Type": "Tap, Long Rhizome",
        "Bloom Time": "Spring - Late Spring",
        "Fruit Time": "Fall",
        "Texture": "Medium",
        "Form": "Rounded",
        "Growth Rate": "Moderate",
        "Insect Predation": "Major",
        "Disease": "Major",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "3 -- 8",
        "Soil Moisture": "Wet, Moderate",
        "Soil pH": "4.0 - 6.0",
        "Ecological Function": "Domestic Animal Forage, Erosion Control, Reclamator, Wildlife Food, Wildlife Habitat",
        "Human Use/Crop\r": "Dye, Food, Medicine, Ornamental, Wood\"\r\n4581,Oregon White Oak (Garry Oak),Quercus garryana,QUGA,Deciduous Tree,90,80,72,Spring-Fall,\"In more open stands and on poor sites, boles are typically short and crooked; shrubby stands of stunted trees are common. Open-grown trees develop very broad, rounded crowns (crown width may equal total height) with massive, crooked branches on short, massive boles. The root system of this species is composed of a deep taproot and well-developed laterals."
    },
    {
        "Id": 4573,
        "Name": "Sawthorn Oak (Japanese Chestnut Oak)",
        "Scientific name": "Quercus acutissima",
        "Binomial": "QUAC",
        "Plant Type": "Deciduous Tree",
        "Height": 60,
        "Spread": 60,
        "Root Depth": 60,
        "Seasonal Interest": "Spring-Fall",
        "Notes": "Quercus acutissima is a very cold-hardy tree, tolerating temperatures down to around -25°c when dormant. It grows best in areas with hot summers. In areas with cooler summers, such as the maritime regions of the temperate zone, it often grows poorly, failing to properly ripen its wood and suffering frost damage over the winter.",
        "Flower Color": "Brown, Green",
        "Root Type": "Tap, Long Rhizome",
        "Bloom Time": "Early Spring - Spring",
        "Fruit Time": "Summer - Fall",
        "Texture": "Medium",
        "Form": "Rounded",
        "Growth Rate": "Moderate",
        "Insect Predation": "Medium",
        "Disease": "Medium",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "6 -- 10",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "5.0 - 7.5",
        "Ecological Function": "Domestic Animal Forage, Wildlife Food",
        "Human Use/Crop\r": "Biomass, Dye, Dye, Food, Medicine, Medicine, Wood\"\r\n4576,Scarlet Oak,Quercus coccinea,QUCO,Deciduous Tree,75,75,60,Fall,\"Difficult to transplant. In black oak subgenus and hybridizes with Q. ilicifolia, velutina, and palustris. Grows well in rocky crevasses. Creates organic material in granite slopes filling spaces for water collection and plant support."
    },
    {
        "Id": 8155,
        "Name": "Indian Tragacanth (Marathi)",
        "Scientific name": "Firmiana simplex",
        "Binomial": "FISI",
        "Plant Type": "Deciduous Tree",
        "Height": 49,
        "Spread": 35,
        "Root Depth": 36,
        "Seasonal Interest": "All Year",
        "Notes": "The leaves are large, 23 to 30 cm (9 to 12) long and just as wide, with five pointed lobes, resembling a maple leaf. They are clustered at the ends of the branches and with the onset of the dry season change colour from green to yellow then fall to the ground, leaving the branches bare and exposed. The bark is smooth, fibrous and thick, greenish-grey, with the surface layer peeling off in large flakes. It is a common species and grows in deciduous forests of the Indian subcontinent, both wet and dry. The tree usually occurs on stony or rocky soils, derived from quartzite, gneiss and schists. It is often found on steep, rock-strewn slopes at altitudes between 400 and 800 metres (1,300 and 2,600 ft). The tree usually has a clean, crooked, short bole that can be up to 2 metres in diameter. Seed - germination takes 10 - 15 days and gives nearly 100 % seedlings that reach 15 - 20cm in height n three months. A physical dormancy caused by the hard seed coat of the mature seeds of many species in this genus can be overcome by scarifying the seed.",
        "Flower Color": "Green, Yellow",
        "Root Type": "Fibrous Deep",
        "Bloom Time": "Winter - Late Winter",
        "Fruit Time": "Spring",
        "Texture": "Coarse",
        "Form": "Irregular",
        "Growth Rate": "Moderate",
        "Insect Predation": "Unknown",
        "Disease": "Unknown",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "10 -- 11",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "5.5 - 7.8",
        "Ecological Function": "Insectory, Reclamator",
        "Human Use/Crop\r": "Coppice, Fiber, Food, Food, Medicine, Oil, Wax, Resin or Polish, Wood\"\r\n8156,Bidi Leaf Tree,Bauhinia racemosa,BARA,Deciduous Tree,16,24,48,Fall-Winter,\"Bauhinia racemosa Lam (The Sonpatta Tree) is a small, crooked, bushy, deciduous tree with drooping branches, which can grow in poor and very harsh climatic conditions. The deciduous tree is propagated easily from seed. Young plants grow quite rapidly and also form side-branches in the first year of growth. Under ideal conditions, the side branches can be 1 metre long by the end of the first year's growth Irrigated plants can be 4.5 metres tall within 3 years. Does not form symbiotic relationships with N fixing bacteria."
    },
    {
        "Id": 113,
        "Name": "Prairie Willow (Upland Willow)",
        "Scientific name": "Salix humilis",
        "Binomial": "SAHU",
        "Plant Type": "Deciduous Tree",
        "Height": 12,
        "Spread": 12,
        "Root Depth": 10,
        "Seasonal Interest": "Spring",
        "Notes": "Edible leaves. Fuzzy flowers open March-May, before leaves emerge. The slowly spreading nature of this shrub results in a multi-stemmed plant that is wider than tall (usually around 4 ft). Unlike many other moisture-loving willows, this one prefers drier ground. Rabbits and deer eat twigs, leaves and shoots. Bees use the nectar to produce high quality honey. Dense thickets provide good wildlife cover.",
        "Flower Color": "Green",
        "Root Type": "Fibrous Shallow",
        "Bloom Time": "Spring - Late Spring",
        "Fruit Time": "Summer",
        "Texture": "Medium",
        "Form": "Mound",
        "Growth Rate": "Moderate",
        "Insect Predation": "Major",
        "Disease": "Major",
        "Light": "Full_Sun",
        "Hardiness Zone": "3 -- 7",
        "Soil Moisture": "Wet, Moderate, Dry",
        "Soil pH": "5.9 - 7.0",
        "Ecological Function": "Domestic Animal Forage, Insectory, Water Purifier, Wildlife Food, Wildlife Habitat",
        "Human Use/Crop\r": "Dye, Food, Medicine\"\r\n1972,Yellow Buckeye (Sweet Buckeye),Aesculus flava,AEFL,Deciduous Tree,65,40,36,Spring,Orange-yellow flowers; scaly-textured bark,,,Spring - Late Spring,,,Oval,Moderate,,,,5 -- 9,Moderate,5.0 - 7.0,\"Insectory, Wildlife Food, Wildlife Habitat"
    }
]