[
    {
        "Id": 5398,
        "Name": "American Agave (Century Plant)",
        "Scientific name": "Agave americana",
        "Binomial": "AGAM",
        "Plant Type": "Perennial",
        "Height": 72,
        "Spread": 120,
        "Root Depth": 30,
        "Seasonal Interest": "All Year",
        "Notes": "Best in gritty well-drained soils. Tolerant of shallow low-nutrient soils. Propagated by seeds and offsets. Blooms only once and then sets seeds and dies. Monocarpic (blooms only once then dies). Bloom spike can reach 12-25ft (4-7.5m). A. americana is a CAM species with characteristic nocturnal stomatal opening and tissue succulence. These traits that have allow this species to colonize water-stressed habitats such as deserts and dry grasslands. The plant typically lives between 10 and 30 years. Small infestations of A. americana can be controlled by digging out small plants manually. Large plants can be moved by machinery. Care should be taken to dig out the taproot to prevent spread by suckering, and all pieces need to be disposed of properly. Agave americana plants are monocarpic, meaning that a plant lives for many years before flowering and then dies once it has flowered. Plants are slow-growing and take between 10 and 25 years to flower, depending on climatic conditions. Plants, therefore, do not take 100 years before flowering, as one of the common names suggests. Plants produce basal offsets that will eventually replace the plant that flower. These offsets are easy to grow",
        "Flower Color": "Green, Yellow",
        "Root Type": "Tap, Rhizome",
        "Bloom Time": "Late Spring - Early Summer",
        "Fruit Time": "",
        "Texture": "Coarse",
        "Form": "Rosette",
        "Growth Rate": "Slow",
        "Insect Predation": "Medium",
        "Disease": "Medium",
        "Light": "Full_Sun",
        "Hardiness Zone": "8 -- 10",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "5.6 - 6.5",
        "Ecological Function": "Domestic Animal Forage, Erosion Control, Hedge, Hedge, Insecticide, Insectory, Insectory, Reclamator, Wildlife Food, Wildlife Food, Wildlife Food, Wildlife Habitat",
        "Human Use/Crop\r": "Container Garden, Container Garden, Fiber, Fiber, Food, Medicine, Ornamental, Ornamental, Soap, Wood\"\r\n5399,Century Plant,Agave parryi,AGPA,Perennial,24,36,24,All Year,\"Also known as Parry's agave or mescal agave. Rosette-forming perennial succulent with blue-gray to gray-green evergreen leaves. Flowers once and then dies, but the 12-20' flowering spike has been called spectacular. Relatively short lifespan of 15-30 years despite the name. Once established it will produce suckers, sometimes popping up 1m away but easily removed. In fact,obtaining such a young plant from a tried and tested parent is the surest way of finding a good, hardy clone from such a variable group. Some will survive -15°c or lower."
    },
    {
        "Id": 2009,
        "Name": "Dwarf Alpine Aster",
        "Scientific name": "Aster alpinus",
        "Binomial": "ASAL",
        "Plant Type": "Perennial",
        "Height": 10,
        "Spread": 8,
        "Root Depth": 15,
        "Seasonal Interest": "Summer",
        "Notes": "White flower; green foliage; blue, pink, rose or purple flowers",
        "Flower Color": "",
        "Root Type": "Fibrous Deep",
        "Bloom Time": "",
        "Fruit Time": "",
        "Texture": "",
        "Form": "Upright",
        "Growth Rate": "Slow",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun",
        "Hardiness Zone": "3 -- 10",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "6.0 - 7.5",
        "Ecological Function": "Erosion Control, Insectory, Soil Builder",
        "Human Use/Crop\r": "\r"
    },
    {
        "Id": 1766,
        "Name": "Sky-Blue Aster",
        "Scientific name": "Symphyotrichum oolentangiensis",
        "Binomial": "SYOO",
        "Plant Type": "Perennial",
        "Height": 36,
        "Spread": 24,
        "Root Depth": 0,
        "Seasonal Interest": "Summer-Fall",
        "Notes": "Attracts birds and crescent spot butterflies.",
        "Flower Color": "Blue",
        "Root Type": "Fibrous Shallow",
        "Bloom Time": "Late Summer - Fall",
        "Fruit Time": "",
        "Texture": "Fine",
        "Form": "Upright",
        "Growth Rate": "Slow",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "3 -- 8",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "6.0 - 8.0",
        "Ecological Function": "Erosion Control, Insectory, Insectory, Soil Builder, Wildlife Food",
        "Human Use/Crop\r": "Cut Flower\r"
    },
    {
        "Id": 7713,
        "Name": "Baboon Grape (Bobbejaandruif)",
        "Scientific name": "Rhoicissus digitata",
        "Binomial": "RHDI",
        "Plant Type": "Perennial",
        "Height": 49,
        "Spread": 49,
        "Root Depth": 10,
        "Seasonal Interest": "All Year",
        "Notes": "A grapevine leafminer described as Holocacista capensis has been found on native Rhoicissus digitata. It is easily propagated from seed sown in spring or early summer and takes from three to six weeks to germinate. Soaking in hand-hot water overnight and treating with a fungicide that combats pre- and post-emergence damping off, although not essential for germination, will increase the number of successful seedlings. Sow cleaned seed in a seed tray in a well-drained, well-aerated soil mix. Spread the seeds evenly and cover with a layer of sand. Water the seed tray and place it in a warm place until germination takes place in three to five weeks under optimum conditions. Prick out soon after the first pair of true leaves has developed - taking care not to damage the young root. Also easy to propagate from semihardwood cuttings made in spring and summer when plants are actively growing. Use a well-draining medium such as a 1:1 mixture of fine bark and river sand, 1:1 fine bark and polystyrene or plain coarse river sand. Cuttings do best placed under mist with bottom heat, and rooting is improved if hormones are used. Rooting will occur within three to four weeks. Propagation by layer",
        "Flower Color": "Brown, Cream, Green, Yellow",
        "Root Type": "Tuber, Tuber",
        "Bloom Time": "Late Summer - Fall",
        "Fruit Time": "Fall - Winter",
        "Texture": "Fine",
        "Form": "Climbing",
        "Growth Rate": "Slow",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "9 -- 11",
        "Soil Moisture": "",
        "Soil pH": "5.0 - 7.0",
        "Ecological Function": "Erosion Control, Groundcover, Insectory, Reclamator, Wildlife Food",
        "Human Use/Crop\r": "Container Garden, Fiber, Food, Medicine, Ornamental, Ornamental\"\r\n5385,White Baneberry (Doll’s eyes),Actaea pachypoda,ACPA,Perennial,30,36,2,All Year,\"Actaea pachypoda is a herbaceous perennial plant producing a cluster of leafy growth from thick, dark rhizomes. Grows to 30 inches. RANGE: Eastern N. America - southeastern Canada to Georgia, west to Oklahoma & Minnesota. HABITAT: Deciduous forests. Less often with pines, junipers, or other conifers. Deep woods, north-facing wooded slopes, bluff bases and ravines. ELEVATIONS up to 1,640 feet. Prefers moist, organically rich, humussy, well-drained soil in part shade to full shade, though it's a tough plant that tolerates most conditions. Grows best in the wild or woodland garden. Self-seeding may occur in optimum growing conditions where the berries fall to the ground. If naturalization is desired, the berries may be picked as soon as they ripen & then immediately planted into the ground in order to promote colonial spread. PROPAGATION: Seeds. Division in spring. Genus name is the Latin name adopted by Linnaeus from Pliny. POLLINATION: Insects. The plants are dioecious, meaning some plants produce male flowers and others produce female flowers."
    },
    {
        "Id": 1891,
        "Name": "Dotted Blazingstar (Colic Root, Dotted Gayfeather)",
        "Scientific name": "Liatris punctata",
        "Binomial": "LIPU",
        "Plant Type": "Perennial",
        "Height": 24,
        "Spread": 24,
        "Root Depth": 4,
        "Seasonal Interest": "Summer",
        "Notes": "Attracts bees and butterflies. Rodents are very fond of the tubers so the plants may require some protection. Liatris can easily be grown from seed. Start indoors or sow directly in the garden in early spring. Seeds should germinate in 20-45 days. Seed germination is improved after a pretreatment of 4 to 6 weeks of cold moist stratification or when planted outside in the fall or early winter. Plants generally will not bloom until their second year. Dig and divide large clumps in the spring just as the leaves are emerging. Separate the corms or cut the tuberous roots with a sharp knife, keeping at least one eye on each division.",
        "Flower Color": "Pink, Purple",
        "Root Type": "Tap, Short Rhizome",
        "Bloom Time": "Summer - Early Fall",
        "Fruit Time": "Fall",
        "Texture": "Medium",
        "Form": "Upright",
        "Growth Rate": "Slow",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun",
        "Hardiness Zone": "2 -- 8",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "6.0 - 8.0",
        "Ecological Function": "Domestic Animal Forage, Erosion Control, Insectory, Reclamator, Wildlife Food, Wildlife Food",
        "Human Use/Crop\r": "Cut Flower, Food, Medicine, Medicine, Medicine\"\r\n2548,Marsh Blazingstar,Liatris spicata,LISP,Perennial,53,18,14,Summer-Fall,\"Marsh Blazingstar is an attractive plant while in bloom, resembling a magic wand."
    },
    {
        "Id": 7528,
        "Name": "Blisterleaf (Peperwortel, Brandblaar)",
        "Scientific name": "Anemone vesicatoria",
        "Binomial": "ANVE",
        "Plant Type": "Perennial",
        "Height": 48,
        "Spread": 36,
        "Root Depth": 6,
        "Seasonal Interest": "Spring-Summer",
        "Notes": "Anemone vesicatoria is one of the few and best fynbos plants for the shady garden. HABITATS: It grows in the shade of bushes, in wooded patches, forests, kloofs and river valleys. Anemone vesicatoria is a perennial herb with a tuft of leathery, dark green leaves up to 4 feet tall. - RANGE: SA Distribution: Eastern Cape, Western Cape. Variable & adaptable: sandy coastal dunes & rich humus. ELEVATION: Sea level to 2,953 feet. Frost is not common in its natural habitat, but it should be able to withstand light frost with its underground rootstock. Best suited to areas with a Mediterranean-type climate. The name Anemone comes from a Greek legend where red anemones grew on Mount Olympus from blood shed by Adonis when he was killed by a wild boar. There are 11 species in South Africa. PROPAGATION: Seeds and seedlings.",
        "Flower Color": "Cream, Green, White, Yellow",
        "Root Type": "Tuber, Long Rhizome",
        "Bloom Time": "Winter - Late Summer",
        "Fruit Time": "Spring - Summer",
        "Texture": "Medium",
        "Form": "Clump",
        "Growth Rate": "Slow",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Partial_Shade, Shade",
        "Hardiness Zone": "6 -- 10",
        "Soil Moisture": "Moderate",
        "Soil pH": "5.6 - 7.8",
        "Ecological Function": "Insectory, Reclamator",
        "Human Use/Crop\r": "Medicine, Medicine, Ornamental\"\r\n1666,Common Bugleweed (Blue Bugle),Ajuga reptans,AJRE,Perennial,8,20,10,Summer,\"It tolerates all light levels and is an excellent choice for moist areas, although it will tolerate moderately dry soils. In cool, shady areas where grass will not grow it makes a thick, attractive ground cover. Avoid planting in wet, heavy soils, and provide good air circulation. Divide these plants when they grow too crowded in the spring or fall, or propagate by seed. Flowers attract bees. Tolerates acid soils. Deer resistant. Needs snow cover or mulch to survive over winter. Bugleweed is attractive in a mass planting in a naturalized area, on a slope or bank, or in a woodland garden. A dense mat will help smother weeds, but avoid planting near perennial beds or lawns where its spreading nature could pose removal problems. This plant is resistant to browsing by deer. Tolerate: Rabbit, Black Walnut."
    },
    {
        "Id": 8442,
        "Name": "American Cancer-Root (Bear Corn,Squawroot)",
        "Scientific name": "Conopholis americana",
        "Binomial": "COAM",
        "Plant Type": "Perennial",
        "Height": 8,
        "Spread": 1,
        "Root Depth": 2,
        "Seasonal Interest": "Spring-Fall",
        "Notes": "Cancer-root is an herbaceous perennial parasitic plant in the boomrape (Orobanchaceae) family. There is no evidence to prove that it can cure cancer. It grows in large areas of Eastern America on organically rich forest soils. It needs well-drained soils but grows in a wide variety of light conditions. This plant does not photosynthesize, hence its lack of the green pigment chlorophyll. It is usually found in dense clumps of several erect stems and growing in shady forested sites. It occurs over a wide geographic range in most of the eastern half of the U.S. and Canada. Across its range, it grows on sites that are relatively rich with deep soils and a thick forest canopy where at least some oak trees present. It typically grows from 2 to 8 inches tall and is less than an inch wide. Inflorescences that look like the cones from a conifer break through the surface of the soil when the plants are approximately four years old after they have been growing underground attached to oak roots. Stem Description: Thick (1/2 inch - 1 inch) stout unbranched stems. No true leaves, brown ovate 1/2\" long scales appear underneath each flower. The inflorescence can appear anywhere from April-Ju",
        "Flower Color": "Cream",
        "Root Type": "Fibrous Shallow",
        "Bloom Time": "Spring - Early Summer",
        "Fruit Time": "Summer - Fall",
        "Texture": "Medium",
        "Form": "Upright",
        "Growth Rate": "Slow",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade, Shade",
        "Hardiness Zone": "3 -- 9",
        "Soil Moisture": "Moderate",
        "Soil pH": "5.0 - 7.5",
        "Ecological Function": "Insectory, Wildlife Food",
        "Human Use/Crop\r": "Food, Medicine\"\r\n3234,Chinese Evergreen,Aglaonema crispum,AGCR,Perennial,36,36,0,All Year,\"Thrives in humid environments with rich, well-draining soils. Easily propagated from stem cuttings."
    },
    {
        "Id": 1889,
        "Name": "Round-Headed Bush Clover (Rabbit Foot)",
        "Scientific name": "Lespedeza capitata",
        "Binomial": "LECA",
        "Plant Type": "Perennial",
        "Height": 48,
        "Spread": 24,
        "Root Depth": 96,
        "Seasonal Interest": "Summer",
        "Notes": "Attracts birds, butterflies. Easily grown in average, dry to medium, well-drained soil in full sun to part shade. Does well in infertile, dryish, sandy soils in full sun. Good drainage is essential. Tolerates drought. May self-seed in optimum growing conditions. Seed benefits from inoculation with EL rhizobium before being planted. This and other Lespedeza species often have both open and cleistogamous flowers mixed together in the same flower cluster. Cleistogamous (kly-STAH-guh-muss) flowers never open, but they fertilize themselves and produce viable seed anyway. They ensure that the plant can reproduce itself even in years with little pollinator activity or adverse flowering conditions. It is reported to be very susceptible to herbicide drift. The Omaha and Ponca people called it \"te-hunton-hi-nuga\" which means \"female buffalo bellow plant.\" It was called this because its bloom coincides with buffalo rut.",
        "Flower Color": "Cream, White",
        "Root Type": "Tap, Rhizome",
        "Bloom Time": "Summer - Late Summer",
        "Fruit Time": "Summer - Fall",
        "Texture": "Medium",
        "Form": "Upright",
        "Growth Rate": "Slow",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "4 -- 8",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "5.6 - 8.1",
        "Ecological Function": "Domestic Animal Forage, Erosion Control, Insectory, Insectory, Nitrogen Fixer, Reclamator, Soil Builder, Wildlife Food, Wildlife Food",
        "Human Use/Crop\r": "Dried Flower, Food, Food, Medicine\"\r\n1746,Compass Plant,Silphium laciniatum,SILA,Perennial,84,36,15,Summer,\"Other common name-- Roshweed. A mature specimen of this perennial plant ranges from 6-12' tall. The central stem is thick, light to medium green, and has conspicuous white hairs. There is some branching into flowering stems in the upper part of the plant. The basal leaves are 12-24\" long and about half as wide. They are covered in fine white hairs, broadly lanceolate in overall shape, but deeply lobed or pinnatifid. The leaves become much smaller as they ascend up the stem. The inflorescence is very tall and elongated, with yellow composite flowers about 3-4\" across. They resemble wild sunflowers in overall size, shape, and structure. However, like other Silphium spp., the small tubular disk florets are sterile, while the ray florets are fertile. There is little floral scent. A mature Compass Plant has 6-30 of these composite flowers, which bloom during mid-summer for about 1½ months. The seeds are large-sized, but flat and light, and can be carried several feet by the wind. A large central taproot can extend 15 ft. into the ground. A resinous substance is produced by the upper stem when the plant is blooming. This plant can live up to 100 years. The preference is full sun and mois"
    },
    {
        "Id": 1864,
        "Name": "Globe Flower",
        "Scientific name": "Trollius europeaus",
        "Binomial": "TREU",
        "Plant Type": "Perennial",
        "Height": 30,
        "Spread": 20,
        "Root Depth": 0,
        "Seasonal Interest": "Summer",
        "Notes": "Severely toxic. The toxicity is concentrated in the vigorous growth shoots. Wear gloves when weeding or transplanting as the plant is especially irritating to the skin. Due to the bad taste, it is unlikely that much of the plant will be eaten.",
        "Flower Color": "Orange, White, Yellow",
        "Root Type": "Fibrous Deep",
        "Bloom Time": "Late Spring - Early Summer",
        "Fruit Time": "",
        "Texture": "Medium",
        "Form": "Upright",
        "Growth Rate": "Slow",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "5 -- 8",
        "Soil Moisture": "Wet, Moderate",
        "Soil pH": "6.0 - 7.0",
        "Ecological Function": "Erosion Control",
        "Human Use/Crop\r": "Medicine\r"
    },
    {
        "Id": 1737,
        "Name": "Glory Of The Snow",
        "Scientific name": "Chionodoxa luciliae",
        "Binomial": "CHLU",
        "Plant Type": "Perennial",
        "Height": 6,
        "Spread": 3,
        "Root Depth": 5,
        "Seasonal Interest": "Spring",
        "Notes": "Low toxicity if eaten. Nematodes are serious stem and bulb problem in some areas. Tolerates summer drought but requires moist growing conditions throughout its growing season. Grows best if soils are well-drained. Tolerates proximity to black walnut trees. Naturalizes and spreads easily.",
        "Flower Color": "Blue, White",
        "Root Type": "Bulb",
        "Bloom Time": "Early Spring - Spring",
        "Fruit Time": "",
        "Texture": "Fine",
        "Form": "Upright",
        "Growth Rate": "Slow",
        "Insect Predation": "Medium",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "3 -- 8",
        "Soil Moisture": "Moderate",
        "Soil pH": "5.5 - 7.5",
        "Ecological Function": "Groundcover, Insectory",
        "Human Use/Crop\r": "Container Garden, Cut Flower, Ornamental\"\r\n7512,Engelmann's Hedgehog Cactus,Echinocereus engelmanii,ECEN,Perennial,24,36,0,All Year,\"Other common names include calico cactus and strawberry cactus. May occur as single plants or clusters. This species includes 8 varieties that vary in their stem, spine, and flower characteristics. Blooms are diurnal. Root rot can easily occur in soils that are not well drained, too moist, or with too much organic matter."
    },
    {
        "Id": 3116,
        "Name": "Horseshoe Vetch",
        "Scientific name": "Hippocrepis comosa",
        "Binomial": "HICO",
        "Plant Type": "Perennial",
        "Height": 12,
        "Spread": 40,
        "Root Depth": 24,
        "Seasonal Interest": "Spring",
        "Notes": "Morphology varies significantly depending on its habitat. Horseshoe Vetch is a calciole and is only found on chalk and limestone soils that are shallow and well-drained. Hippocrepis comosa is a calciole (found only on chalk and limestone). It is a hardy plant that survives long periods of cold winters and dry summers years after year. Colonies are not harmed by sheep grazing, and are resistant to moderate trampling; they do not thrive after heavy ploughing or disturbance of the ground. In areas grazed by cattle they disappear, sometimes after several years (depending on grazing intensity.). Horseshoe Vetch is not really a grassland plant. It comes after the mosses and in ecological succession on bare chalk and the grasses only come when the soil and nutrition levels increase and then the succession favours the diminution of Horseshoe Vetch until the land becomes too fertile and it disappears entirely. Its range is from bare chalk with mosses (in chalk pits and chalk cliffs inland) through original chalk herbland* (maximum amounts) and then a diminution on extensive sheep pastures and Rights of Way and wasteland and inaccessible (to livestock) hill tops, to occasional clumps in wil",
        "Flower Color": "Yellow",
        "Root Type": "Tap, Short Rhizome",
        "Bloom Time": "Spring - Late Spring",
        "Fruit Time": "Summer - Fall",
        "Texture": "Fine",
        "Form": "Prostrate",
        "Growth Rate": "Slow",
        "Insect Predation": "Medium",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "7 -- 9",
        "Soil Moisture": "Dry",
        "Soil pH": "7.0 - 1.0",
        "Ecological Function": "Domestic Animal Forage, Insectory, Insectory, Nitrogen Fixer, Reclamator",
        "Human Use/Crop\r": "Aromatics/Fragrance\r"
    },
    {
        "Id": 1785,
        "Name": "Common Hyacinth",
        "Scientific name": "Hyacinthus orientalis",
        "Binomial": "HYOR",
        "Plant Type": "Perennial",
        "Height": 12,
        "Spread": 12,
        "Root Depth": 10,
        "Seasonal Interest": "Spring",
        "Notes": "Unexpected frosts can damage flowers. Toxic only if large amount eaten, minor skin irritation. Deep digging in bed preparation (15\") is essential for good root growth. Tend to be short lived. Steadily declining flower quality. Typical bulb lives for",
        "Flower Color": "Blue, Orange, Pink, Purple, Red, White, Yellow",
        "Root Type": "Rhizome",
        "Bloom Time": "Spring - Late Spring",
        "Fruit Time": "",
        "Texture": "Medium",
        "Form": "Upright",
        "Growth Rate": "Slow",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "3 -- 7",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "6.6 - 7.5",
        "Ecological Function": "",
        "Human Use/Crop\r": "Cut Flower\r"
    },
    {
        "Id": 1699,
        "Name": "Indian Pipe",
        "Scientific name": "Monotropa uniflora",
        "Binomial": "MOUN",
        "Plant Type": "Perennial",
        "Height": 10,
        "Spread": 4,
        "Root Depth": 4,
        "Seasonal Interest": "Summer",
        "Notes": "Spring foliage color- white. Summer foliage color- white. Fall foliage color- black. Parisitic on hardwood roots. Not commercially propagated or grown.",
        "Flower Color": "White",
        "Root Type": "Fibrous Shallow",
        "Bloom Time": "Late Spring - Summer",
        "Fruit Time": "",
        "Texture": "",
        "Form": "Upright",
        "Growth Rate": "Slow",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Partial_Shade, Shade",
        "Hardiness Zone": "3 -- 9",
        "Soil Moisture": "Moderate",
        "Soil pH": "5.0 - 7.0",
        "Ecological Function": "Erosion Control",
        "Human Use/Crop\r": "Medicine\r"
    },
    {
        "Id": 3251,
        "Name": "Blue Wild Indigo",
        "Scientific name": "Baptisia australis",
        "Binomial": "BAAU",
        "Plant Type": "Perennial",
        "Height": 36,
        "Spread": 48,
        "Root Depth": 24,
        "Seasonal Interest": "All Year",
        "Notes": "This is one of the earliest plants to bloom in the prairie, and is quite showy and attractive.",
        "Flower Color": "Blue",
        "Root Type": "Fibrous Deep, Fibrous Shallow",
        "Bloom Time": "Late Spring - Early Summer",
        "Fruit Time": "Summer - Fall",
        "Texture": "Medium",
        "Form": "Clump",
        "Growth Rate": "Slow",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "2 -- 8",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "6.0 - 8.0",
        "Ecological Function": "Erosion Control, Insectory, Mulch Maker, Nitrogen Fixer",
        "Human Use/Crop\r": "Cut Flower, Dye, Medicine, Ornamental\"\r\n1824,White Wild Indigo (Thin-Pod White Wild Indigo),Baptisia alba,BAAL,Perennial,60,48,7,Summer,\"Low toxicity if ingested. B. australis-- violet flowers. Other common name-- Prairie False Indigo. Young plants should be watered carefully until established. It should not be disturbed once established because of its deep and extensive root system. White wild indigo is propagated by root division, stem cuttings, and seed. Seed pods begin to dry and split when fully ripened in mid- to late summer, when they release numerous kidney-shaped seed. These are dispersed by gravity, birds, mammals, mechanical equipment, and surface water. Seed germination may require stratification because of the hard seed coat. Root division and stem cuttings result in quicker establishment, but flowering from new seedlings may not occur for 2–3 years."
    },
    {
        "Id": 7470,
        "Name": "White Ladyslipper",
        "Scientific name": "Cypripedium candidum",
        "Binomial": "CYCA",
        "Plant Type": "Perennial",
        "Height": 16,
        "Spread": 16,
        "Root Depth": 0,
        "Seasonal Interest": "Spring-Summer",
        "Notes": "Threatened/endangered throughout its native range. Native habitat is in deep-soil mesic prairies. Requires the presence of orchid-specific mycorrhizae. Can form dense clumps of multiple stems. Known to hybridize with other members of the genus. Prescribed burns can help maintain appropriate habitats.",
        "Flower Color": "Purple, White",
        "Root Type": "Rhizome, Fibrous Shallow",
        "Bloom Time": "Late Spring - Early Summer",
        "Fruit Time": "Fall - ?",
        "Texture": "Medium",
        "Form": "Upright",
        "Growth Rate": "Slow",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun",
        "Hardiness Zone": "3 -- 6",
        "Soil Moisture": "Wet, Moderate",
        "Soil pH": "7.0 - 8.5",
        "Ecological Function": "Insectory",
        "Human Use/Crop\r": "Aromatics/Fragrance, Medicine, Ornamental\"\r\n2615,Lenten Rose,Helleborus orientalis,HEOR,Perennial,24,18,5,Spring,Durable plants with evergreen foliage that competes well with tree roots. Tolerant of dry rocky soils and air pollution. Grows best in rich humusy soils that well-drained. Obtain new plants by dividing clumps in spring. Evergreen in warm climates.,\"Cream, Pink, Rose"
    },
    {
        "Id": 1778,
        "Name": "Tiger Lily",
        "Scientific name": "Lilium lancifolium",
        "Binomial": "LILA",
        "Plant Type": "Perennial",
        "Height": 72,
        "Spread": 48,
        "Root Depth": 0,
        "Seasonal Interest": "Summer",
        "Notes": "Tolerates summer drought but requires a moist growing season during spring.",
        "Flower Color": "Orange",
        "Root Type": "Rhizome",
        "Bloom Time": "Early Summer - Summer",
        "Fruit Time": "",
        "Texture": "Medium",
        "Form": "Upright",
        "Growth Rate": "Slow",
        "Insect Predation": "Minor",
        "Disease": "Major",
        "Light": "Partial_Shade",
        "Hardiness Zone": "3 -- 8",
        "Soil Moisture": "Moderate",
        "Soil pH": "0 - 0",
        "Ecological Function": "",
        "Human Use/Crop\r": "Cut Flower, Food, Medicine\"\r\n1717,Lily-Of-The-Valley,Convallaria majalis,COMA,Perennial,10,24,10,Spring,Propagation is by division after leaves die back in October or early spring. Deer resistant. Tolerant of poor sites. Long lived. Highly toxic.,White,Fibrous Shallow,Late Spring - Early Summer,,Medium,Upright,Slow,Minor,Minor,\"Partial_Shade, Shade"
    },
    {
        "Id": 1789,
        "Name": "Lupine",
        "Scientific name": "Lupinus",
        "Binomial": "LUx",
        "Plant Type": "Perennial",
        "Height": 48,
        "Spread": 30,
        "Root Depth": 8,
        "Seasonal Interest": "Summer",
        "Notes": "Grows best in acid soils (lime free). Plant community - \"Oak barrens\". Blooms early spring and again late summer if seed isn't allowed to set. \"Russell\" hybrids are very popular. Garden cultivars are short lived. Some cultivars (usually the annual one",
        "Flower Color": "Blue, Green, Pink, Purple, Red, Rust, Silver, White, Yellow",
        "Root Type": "Rhizome",
        "Bloom Time": "Late Spring - Summer",
        "Fruit Time": "",
        "Texture": "Medium",
        "Form": "Upright",
        "Growth Rate": "Slow",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "",
        "Hardiness Zone": "4 -- 6",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "4.0 - 7.0",
        "Ecological Function": "Domestic Animal Forage, Erosion Control, Nitrogen Fixer",
        "Human Use/Crop\r": "Fiber, Food, Soap\"\r\n5637,Poppy Mallow,Callirhoe involucrata,CAIN,Perennial,18,36,18,Summer-Fall,\"Easily grown in dry to medium moisture, well-drained soils in full sun. Grows well from seed and may self-seed in the garden in optimum growing conditions. Long tap root gives plant good drought tolerance but makes transplanting of established plants difficult. Winecups will often go into dormancy in the summer, but new leaves will emerge after good rains. Its growing season can be prolonged by removing old flowers before they set seed. Winecup is susceptible to a rust during wet seasons. Winecups are green all year, except in late summer. Intermixing with a late summer bloomer such as black-eyed Susan will help provide color during the period when they disappear."
    },
    {
        "Id": 1852,
        "Name": "Pitcher Plant",
        "Scientific name": "Sarracenia purpurea",
        "Binomial": "SAPU",
        "Plant Type": "Perennial",
        "Height": 24,
        "Spread": 30,
        "Root Depth": 0,
        "Seasonal Interest": "Summer",
        "Notes": "Flowers sometimes yellowish. The leaves (pitches) are generally purplish with green stripes. The fruit can appear but is typically brown. Not commercially propagated.",
        "Flower Color": "Purple, Red",
        "Root Type": "Fibrous Shallow",
        "Bloom Time": "Late Spring - Late Summer",
        "Fruit Time": "",
        "Texture": "",
        "Form": "Upright",
        "Growth Rate": "Slow",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "2 -- 5",
        "Soil Moisture": "Wet",
        "Soil pH": "5.8 - 7.8",
        "Ecological Function": "Erosion Control, Insectory, Soil Builder",
        "Human Use/Crop\r": "Medicine\r"
    },
    {
        "Id": 2890,
        "Name": "Prayer Plant",
        "Scientific name": "Maranta leuconeura",
        "Binomial": "MALE",
        "Plant Type": "Perennial",
        "Height": 18,
        "Spread": 36,
        "Root Depth": 0,
        "Seasonal Interest": "All Year",
        "Notes": "Needs a humid environment. Plant in moderate to very fertile, well-draining soil. Shallow root-system. Flowers sporadically in some areas.",
        "Flower Color": "Pink, White",
        "Root Type": "Rhizome",
        "Bloom Time": "Late Spring - Summer",
        "Fruit Time": "",
        "Texture": "Coarse",
        "Form": "Clump",
        "Growth Rate": "Slow",
        "Insect Predation": "Medium",
        "Disease": "Minor",
        "Light": "Partial_Shade, Shade",
        "Hardiness Zone": "11 -- 12",
        "Soil Moisture": "Moderate",
        "Soil pH": "6.1 - 7.8",
        "Ecological Function": "Air Cleaner, Groundcover",
        "Human Use/Crop\r": "Container Garden, Hanging Basket, Medicine, Ornamental\"\r\n1892,Hoary Puccoon,Lithospermum canescens,LICA,Perennial,18,24,50,Spring,\"This is one of the first wildflowers to bloom in open habitats like prairies, glades, savannas, and woodlands. It is extremely difficult to propagate this species from seed and so it is seldom seen in restorations. It is common in the Midwest, from the Dakotas to Arkansas, and east to Virginia. The preference is full sun, mesic to dry conditions, and soil containing loam, rocky material, or sand. The seeds of Hoary Puccoon are notoriously difficult to germinate, and its root system (consisting of a taproot) is not readily divided. As a result, this plant is rarely cultivated. This is a pity, because the flowers are very showy. Roots make a red dye. Virtually impossible to obtain either seed or plants. Difficult to transplant."
    },
    {
        "Id": 1811,
        "Name": "Russian Sage",
        "Scientific name": "Perovskia atriplicifolia",
        "Binomial": "PEAT",
        "Plant Type": "Perennial",
        "Height": 48,
        "Spread": 48,
        "Root Depth": 0,
        "Seasonal Interest": "Summer",
        "Notes": "Semi-woody, dies back to the ground in zone 4. Attractive in combination plantings with Echinacea. Hardiness varies in soil type, needs a well drained soil to succeed. Easily grown in average, dry to medium, well-drained soils in full sun. Sharp soil drainage is especially important. Avoid wet, poorly drained soils. Plants have good drought tolerance. Best flowering occurs in full sun locations. Stems are more likely to flop if plants are grown in part shade. Cut back plants almost to the ground in late winter to early spring as soon as new growth appears. Propagate by softwood cuttings in late spring or semi-ripe cuttings in summer.",
        "Flower Color": "Blue, Purple",
        "Root Type": "Tap, Rhizome",
        "Bloom Time": "Summer - Late Summer",
        "Fruit Time": "Fall",
        "Texture": "Fine",
        "Form": "Upright",
        "Growth Rate": "Slow",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun",
        "Hardiness Zone": "3 -- 8",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "4.6 - 6.5",
        "Ecological Function": "Air Cleaner, Dynamic Accumulator, Groundcover, Hedge, Reclamator",
        "Human Use/Crop\r": "Aromatics/Fragrance, Aromatics/Fragrance, Dye, Food, Medicine, Ornamental, Ornamental\"\r\n2552,Midland Shooting Star,Dodecatheon meadia,DOME,Perennial,24,12,12,Spring-Summer,Tolerates damp soil as long as it is well-drained. Plants die back entirely by mid-summer. Difficult to grow from seed. Most plants flower once every 3 years.,\"Lavender, Pink, White"
    },
    {
        "Id": 6236,
        "Name": "Spignel (Bearwort, Baldmoney)",
        "Scientific name": "Meum athamanticum",
        "Binomial": "MEAT",
        "Plant Type": "Perennial",
        "Height": 18,
        "Spread": 18,
        "Root Depth": 6,
        "Seasonal Interest": "Spring-Fall",
        "Notes": "Bearwort needs little attention, requiring neither dividing nor re-planting. The strong main root, forking with age, goes deep and means the plant can survive even in difficult conditions. In better soil, development into a dense clump is faster. Growing the plant from seed is a slow process, which may be why it is seldom seen for sale at nurseries. It takes several years to gather the large stores of energy needed to produce the dense spring foliage. Bearwort is an old herbal medicine. The whole plant is extremely aromatic. Both leaves and roots have also been used in soups and stews. Milk from cows which have grazed on it is strongly flavored. Propagation of the herb: Seed - best sown as soon as it is ripe in a cold frame. Stored seed should be sown as early in the year as possible in a cold frame. Prick out the seedlings into individual pots when they are large enough to handle and plant them out in the summer or the following spring. Division in autumn. Large divisions can be planted out direct into their permanent positions.",
        "Flower Color": "Pink, Purple, White",
        "Root Type": "Tap, Short Rhizome",
        "Bloom Time": "Late Spring - Summer",
        "Fruit Time": "Summer - Fall",
        "Texture": "Fine",
        "Form": "Upright",
        "Growth Rate": "Slow",
        "Insect Predation": "Medium",
        "Disease": "Minor",
        "Light": "Full_Sun",
        "Hardiness Zone": "5 -- 9",
        "Soil Moisture": "Moderate",
        "Soil pH": "4.6 - 6.0",
        "Ecological Function": "Insectory,\"",
        "Human Use/Crop\r": " Aromatics/Fragrance"
    },
    {
        "Id": 1709,
        "Name": "Japanese Spurge",
        "Scientific name": "Pachysandra terminalis",
        "Binomial": "PATE",
        "Plant Type": "Perennial",
        "Height": 12,
        "Spread": 36,
        "Root Depth": 12,
        "Seasonal Interest": "Spring",
        "Notes": "Grows well under Maple. Looks great among evergreens. Prefers well drained soils with good organic matter. Foliage tends to bleach when grown in too much sun. Will not tolerate foot-traffic and is not a good choice where it will be disturbed by rambunctious children and pets. Hardy winter ground cover.",
        "Flower Color": "White",
        "Root Type": "Rhizome",
        "Bloom Time": "Late Spring",
        "Fruit Time": "Summer - Fall",
        "Texture": "Medium",
        "Form": "Spreading",
        "Growth Rate": "Slow",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Partial_Shade, Shade",
        "Hardiness Zone": "4 -- 9",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "5.5 - 7.5",
        "Ecological Function": "Erosion Control, Groundcover",
        "Human Use/Crop\r": "Ornamental\r"
    },
    {
        "Id": 2022,
        "Name": "Orange Stonecrop",
        "Scientific name": "Sedum kamtschaticum",
        "Binomial": "SEKA",
        "Plant Type": "Perennial",
        "Height": 12,
        "Spread": 12,
        "Root Depth": 2,
        "Seasonal Interest": "All Year",
        "Notes": "Deep green, succulent foliage; yellow-orange flower. Non mycorrhizal.",
        "Flower Color": "Green, Yellow",
        "Root Type": "Short Rhizome",
        "Bloom Time": "Spring - Early Summer",
        "Fruit Time": "Summer - Fall",
        "Texture": "Fine",
        "Form": "Creeping",
        "Growth Rate": "Slow",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "3 -- 8",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "6.5 - 7.5",
        "Ecological Function": "Erosion Control, Groundcover, Insectory",
        "Human Use/Crop\r": "Container Garden, Medicine, Ornamental\"\r\n2521,Sundew,Drosera rotundifolia,DRRO,Perennial,8,0,2,Summer-Fall,Not recommended to harvest in the wild. Habitat is becoming rare.,\"Pink, White"
    },
    {
        "Id": 8312,
        "Name": "Mountain Tulip (Montana Tulip)",
        "Scientific name": "Tulipa montana",
        "Binomial": "TUMO",
        "Plant Type": "Perennial",
        "Height": 8,
        "Spread": 20,
        "Root Depth": 6,
        "Seasonal Interest": "Spring-Summer",
        "Notes": "Tulipa montana is a species of tulip is native to temperate Asia and Europe. The mountains of Iran & Turkmenistan. With its deep red petals (there is also a yellow morph) it has been proposed as a candidate for the Biblical Rose of Sharon, whose identity is unknown. Richard Wilford in his 2006 published book \"Tulips\" writes \"This really is one of the most alluring of the smaller tulip species\". T. montana is a low-growing perennial bulb. RANGE: Mountains of Iran, & Iraq, around the Caspian Sea. First found in Persia in 1826, & then published & described by John Lindley in The Botanical Register. HABITAT: Rocky and stony hills to 9,843 feet. PROPAGATION: Seeds sown lightly on the ground. Bulbs left in grown will spread. The species is hermaphrodite (has both male and female organs). Requires a very well-drained sandy soil in a sunny position. Bulbs can be harvested after the plants have died down in July, stored in a cool dry place & then replanted in October. This species is closely related to T. linifolia and T. maximowiczii.",
        "Flower Color": "Red",
        "Root Type": "Bulb, Fibrous Shallow",
        "Bloom Time": "Early Spring - Summer",
        "Fruit Time": "Summer",
        "Texture": "Medium",
        "Form": "Upright",
        "Growth Rate": "Slow",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "5 -- 10",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "5.6 - 8.4",
        "Ecological Function": "Insectory, Soil Builder, Wildlife Food",
        "Human Use/Crop\r": "Container Garden, Cut Flower, Food, Medicine, Ornamental, Ornamental\"\r\n6079,Twinleaf,Jeffersonia diphylla,JEDI,Perennial,18,10,8,,\"Each large, blue-green leaf has two deeply divided symmetrical lobes, somewhat like a butterfly with its wings spread open, which gives rise to its common name of twinleaf. The foliage is only about 6-8 inches tall when the flowers open before or as the leaves expand. The clumps of plants later grow up to 18 inches tall, forming a mound of foliage through early to midsummer before senescing and disappearing for the remainder of the year. This plant is easily propagated from fresh seed or by careful division of large clumps in late summer or fall. Dormant bare root plants can be transplanted in early spring. Young plants are easily outcompeted by other plants and take many years to begin blooming."
    },
    {
        "Id": 2513,
        "Name": "Water Pepper",
        "Scientific name": "Polygonum hydropiperoides",
        "Binomial": "POHY",
        "Plant Type": "Perennial",
        "Height": 30,
        "Spread": 12,
        "Root Depth": 10,
        "Seasonal Interest": "Summer",
        "Notes": "",
        "Flower Color": "Green, White",
        "Root Type": "Rhizome",
        "Bloom Time": "Early Summer - Late Summer",
        "Fruit Time": "",
        "Texture": "Fine",
        "Form": "Upright",
        "Growth Rate": "Slow",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade, Shade",
        "Hardiness Zone": "3 -- 9",
        "Soil Moisture": "Wet",
        "Soil pH": "4.5 - 8.0",
        "Ecological Function": "",
        "Human Use/Crop\r": "Medicine\r"
    },
    {
        "Id": 3149,
        "Name": "Elephant Foot Yam",
        "Scientific name": "Amorphophallus paeoniifolius",
        "Binomial": "AMPA",
        "Plant Type": "Perennial",
        "Height": 31,
        "Spread": 24,
        "Root Depth": 12,
        "Seasonal Interest": "Spring-Fall",
        "Notes": "Monoecious. Best in organically rich and well-draining soils. 60-90 day dormancy period.",
        "Flower Color": "Green, Purple, Red, Yellow",
        "Root Type": "Rhizome, Corm",
        "Bloom Time": "Spring - ?",
        "Fruit Time": "Summer - ?",
        "Texture": "Coarse",
        "Form": "Irregular",
        "Growth Rate": "Slow",
        "Insect Predation": "Medium",
        "Disease": "Minor",
        "Light": "Partial_Shade",
        "Hardiness Zone": "9 -- 11",
        "Soil Moisture": "Wet, Moderate",
        "Soil pH": "5.5 - 6.2",
        "Ecological Function": "Domestic Animal Forage, Insectory",
        "Human Use/Crop\r": "Food, Medicine, Ornamental\"\r\n1733,Yucca,Yucca glauca,YUGL,Perennial,60,48,6,Summer,\"Other common name-- Soapweed If not planted in sandy soils, cold injury will be frequent."
    },
    {
        "Id": 1771,
        "Name": "Astilbe",
        "Scientific name": "Astilbe arendsii",
        "Binomial": "ASAR",
        "Plant Type": "Perennial",
        "Height": 40,
        "Spread": 36,
        "Root Depth": 0,
        "Seasonal Interest": "Summer",
        "Notes": "Minor disease concern- root rot. Grows vigorously and quickly. Divide every 3-4 years. Numerous cultivars available. Full sun ok only with adequate moisture.",
        "Flower Color": "Pink, Purple, Red, White",
        "Root Type": "Fibrous Shallow",
        "Bloom Time": "Late Spring - Late Summer",
        "Fruit Time": "",
        "Texture": "Medium",
        "Form": "Upright",
        "Growth Rate": "Fast",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade, Shade",
        "Hardiness Zone": "4 -- 9",
        "Soil Moisture": "Wet, Moderate",
        "Soil pH": "5.6 - 7.5",
        "Ecological Function": "Erosion Control, Soil Builder",
        "Human Use/Crop\r": "Cut Flower\r"
    },
    {
        "Id": 1822,
        "Name": "Dwarf Astilbe",
        "Scientific name": "Astilbe chinensis pumila",
        "Binomial": "ASCH",
        "Plant Type": "Perennial",
        "Height": 12,
        "Spread": 14,
        "Root Depth": 0,
        "Seasonal Interest": "Summer",
        "Notes": "Minor disease concern- root rot.",
        "Flower Color": "Purple",
        "Root Type": "Tap",
        "Bloom Time": "Early Summer - Late Summer",
        "Fruit Time": "",
        "Texture": "Fine",
        "Form": "Prostrate",
        "Growth Rate": "Fast",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade, Shade",
        "Hardiness Zone": "4 -- 8",
        "Soil Moisture": "Wet, Moderate, Dry",
        "Soil pH": "5.6 - 7.5",
        "Ecological Function": "Erosion Control",
        "Human Use/Crop\r": "\r"
    },
    {
        "Id": 7566,
        "Name": "Three-tooth Athanas (Samphire-leaf athanasia)",
        "Scientific name": "Athanasia trifurcata",
        "Binomial": "ATTR",
        "Plant Type": "Perennial",
        "Height": 60,
        "Spread": 59,
        "Root Depth": 4,
        "Seasonal Interest": "Spring-Summer",
        "Notes": "Athanasia trifurcata is native to South Africa and a fast-growing, dense, leafy herbaceous shrub with grey-green foliage and showy bright yellow flower-heads in early to midsummer; it’s easy to grow and water wise, but can also be a bit weedy. RANGE: Namaqualand, through the Western Cape to Port Elizabeth, in the Eastern Cape. - HABITATS: Flats and rocky slopes, on overgrazed, recently burnt or disturbed veld. Grows in the south-western Cape near the coast, preferably in sandy soils. Important species in coastal Rhenosterveld. Broad strip approximately 62 miles wide along southern Cape coast. ELEVATIONS: up to 984 feet. They can withstand light frosts. Poor, rocky, sandy, well-drained soils. PROPAGATION: by seeds sown in autumn in a seedbed or by cuttings in summer. The name Athanasia means ‘without death’, derived from the Greek a- meaning ‘without’ and thanatos, ‘death’. Fertilization is not necessary. The common name Klouterbos, derives from the propensity of the plants to pack up against the colter (kouter) of a plough.",
        "Flower Color": "Yellow",
        "Root Type": "Fibrous Shallow, Fibrous Deep",
        "Bloom Time": "Early Spring - Early Summer",
        "Fruit Time": "Summer - Fall",
        "Texture": "Medium",
        "Form": "Matlike",
        "Growth Rate": "Fast",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun",
        "Hardiness Zone": "8 -- 11",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "6.0 - 8.0",
        "Ecological Function": "Erosion Control, Insectory, Reclamator, Wildlife Food",
        "Human Use/Crop\r": "Cut Flower, Ornamental\"\r\n8307,Kotschyi Autumn Crocus,Colchicum kotschyi,COKO,Perennial,6,12,4,Summer-Fall,\"It is native to Iran, Iraq and Turkey. It blooms relatively early for an autumn flowering colchicum, as early as August. Plants can take 4 - 5 years to flower when grown from seed."
    },
    {
        "Id": 1728,
        "Name": "Babys Breath",
        "Scientific name": "Gypsophila paniculata",
        "Binomial": "GYPA",
        "Plant Type": "Perennial",
        "Height": 36,
        "Spread": 48,
        "Root Depth": 0,
        "Seasonal Interest": "Summer",
        "Notes": "Difficult to transplant. Invasive in fresh water dune areas along the great lakes and on outwash plains. Used as a filler in bouquets. Good dried flower. Some double varieties exist.",
        "Flower Color": "White",
        "Root Type": "Stolon",
        "Bloom Time": "Early Summer - Late Summer",
        "Fruit Time": "",
        "Texture": "Fine",
        "Form": "Upright",
        "Growth Rate": "Fast",
        "Insect Predation": "",
        "Disease": "",
        "Light": "Full_Sun",
        "Hardiness Zone": "3 -- 9",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "7.0 - 7.0",
        "Ecological Function": "Dynamic Accumulator, Nurse",
        "Human Use/Crop\r": "Cut Flower, Dried Flower, Medicine\"\r\n3228,\"Banana, Cavendish"
    },
    {
        "Id": 1780,
        "Name": "Clustered Bellflower (Dane's Blood)",
        "Scientific name": "Campanula glomerata",
        "Binomial": "CAGL",
        "Plant Type": "Perennial",
        "Height": 24,
        "Spread": 36,
        "Root Depth": 12,
        "Seasonal Interest": "Summer",
        "Notes": "Campanula glomerata, commonly known as clustered bellflower, is an upright perennial that is native to Europe and temperate Asia. It forms a dense foliage clump of ovate to lance-shaped, toothed, somewhat hairy, long-stalked, medium green basal leaves (to 5” long). Thrives on calcareous soils. Blooms May through July. Upward facing flowers bloom in spherical terminal clusters atop smaller-leaved stems that rise 12 to 18 inches above the basal clump. Smaller flower clusters simultaneously bloom in the upper leaf axils. Common name refers to the densely packed inflorescences, each having a cluster of up to 15 flowers. Bellflower naturalizes by rhizomes and can be invasive, particularly in moist soils. To keep the plant growing vigorously while preventing it from spreading indiscriminately, divide the clumps in the fall every 3 to 5 years. Plants naturalize by rhizomes and occasionally, small colonies of plants are produced from the long rhizomes, particularly in moist soils. Minor insect concern - slugs, snails.",
        "Flower Color": "Blue, Lavender, Purple, White",
        "Root Type": "Rhizome, Fibrous Shallow",
        "Bloom Time": "Spring - Early Summer",
        "Fruit Time": "Fall",
        "Texture": "Medium",
        "Form": "Clump",
        "Growth Rate": "Fast",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "3 -- 8",
        "Soil Moisture": "Moderate",
        "Soil pH": "5.0 - 7.0",
        "Ecological Function": "Erosion Control, Insectory, Insectory, Water Purifier",
        "Human Use/Crop\r": "Cut Flower, Food, Ornamental\"\r\n5664,Creeping Bellflower,Campanula rapunculoides,CARA,Perennial,36,8,6,Spring,Little used root vegetable. Formerly popular in medieval Europe.,Blue,\"Fibrous Shallow, Short Rhizome"
    },
    {
        "Id": 2001,
        "Name": "Butter and Eggs (Yellow Toadflax, Ransted-Weed)",
        "Scientific name": "Linaria vulgaris",
        "Binomial": "LIVU",
        "Plant Type": "Perennial",
        "Height": 36,
        "Spread": 8,
        "Root Depth": 12,
        "Seasonal Interest": "Spring",
        "Notes": "Common European perennial with orange and yellow flowers. A naturalized weed in North America. Dalmatian and yellow toadflax are deep-rooted, short-lived, herbaceous perennials. They reproduce by seed, and can form colonies by means of adventitious buds on roots. Toadflax shoots are tough and somewhat woody near the base, and are produced singly or in clumps of up to 25 stems per crown, spaced along the shallow, lateral roots. Superficial yellow toadflax roots do not overwinter; however, the roots are able to survive freezing to 5 degrees Fahrenheit (-15 C) after artificial acclimatization to low temperatures. This plant tends to show up in disturbed areas as along roads, railways or after fires as well as in fields, pastures or forest edges. It is difficult to eradicate and is not recommended for home landscapes. Yellow toadflax is difficult to eradicate, due to its extensive root system. L. vulgaris can establish from root fragments as short as 1 cm long. The root system may penetrate up to one metre deep and several metres laterally, but shoots mainly originate from the shallower roots at depths of 2-5 cm.Tillage beginning in the early summer and continued at 3-4 week interva",
        "Flower Color": "Orange, Yellow",
        "Root Type": "Tap, Fibrous Shallow",
        "Bloom Time": "Summer - Early Fall",
        "Fruit Time": "Fall",
        "Texture": "Medium",
        "Form": "Matlike",
        "Growth Rate": "Fast",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "4 -- 8",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "6.1 - 7.8",
        "Ecological Function": "Domestic Animal Forage, Erosion Control, Groundcover, Insecticide, Insectory, Insectory, Reclamator, Wildlife Habitat",
        "Human Use/Crop\r": "Dye, Medicine, Ornamental\"\r\n6397,Butterbur,Petasites hybridus,PEHY,Perennial,39,108,0,Spring-Summer,\"Other common names include sweet coltsfoot and bog rhubarb. Spreads primarily via rhizome. Dioecious. Best in deep, rich, humus-rich soils. The flower stalk develops before the leaves. The large leaves tend to shade out anything growing beneath them."
    },
    {
        "Id": 2923,
        "Name": "Edible Canna",
        "Scientific name": "Canna edulis",
        "Binomial": "CAED",
        "Plant Type": "Perennial",
        "Height": 96,
        "Spread": 0,
        "Root Depth": 24,
        "Seasonal Interest": "All Year",
        "Notes": "Often grown as an annual.",
        "Flower Color": "Orange, Red",
        "Root Type": "Tuber, Long Rhizome",
        "Bloom Time": "Late Summer - Fall",
        "Fruit Time": "Fall - ?",
        "Texture": "Coarse",
        "Form": "Upright",
        "Growth Rate": "Fast",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "8 -- 11",
        "Soil Moisture": "Wet, Moderate",
        "Soil pH": "4.5 - 8.0",
        "Ecological Function": "Domestic Animal Forage, Hedge, Soil Builder",
        "Human Use/Crop\r": "Food\r"
    },
    {
        "Id": 8145,
        "Name": "Persian Cat Mint (Raceme Catnip)",
        "Scientific name": "Nepeta racemosa",
        "Binomial": "NERA",
        "Plant Type": "Perennial",
        "Height": 40,
        "Spread": 48,
        "Root Depth": 8,
        "Seasonal Interest": "Spring-Fall",
        "Notes": "Catmints are free-flowering, easy-care perennials combining handsome foliage with an exuberant floral display. Their adaptability to average gardens as well as droughty conditions attests to their landscape versatility. Whether in a public parkway or garden border, their vivid blue flowers over many weeks in summertime are an incomparable sight. Native to the area of Turkey and Iran, it is called “the Persian Catmint”. Small spreading mounds with a cloud of lavender blue spikes covering the plant when in full bloom. The small oval leaves are a soft gray that look a bit wrinkled. Nepeta can be sprawling at times, but a quick haircut soon reshapes into a tighter outline and increases the vigor with new growth. Easily grown in average, dry to medium, well-drained soils in full sun to part shade. Thrives in dry soils and is very tolerant of drought. Somewhat intolerant of the heat and humidity of the deep South, however, and appreciates some light afternoon shade in hot summer climates such as the St. Louis area. Shear flower spikes after initial flowering to promote continued bloom. May aggressively self-seed in optimum growing conditions. The cultivar 'Walker's Low' is sterile and w",
        "Flower Color": "Blue, Lavender",
        "Root Type": "Rhizome, Short Rhizome",
        "Bloom Time": "Late Spring - Summer",
        "Fruit Time": "Summer - Fall",
        "Texture": "Fine",
        "Form": "Clump",
        "Growth Rate": "Fast",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "3 -- 10",
        "Soil Moisture": "Moderate",
        "Soil pH": "6.0 - 6.5",
        "Ecological Function": "Groundcover, Insectory, Wildlife Food",
        "Human Use/Crop\r": "Aromatics/Fragrance, Essential Oil, Food, Insect Repellent, Ornamental\"\r\n1833,Catmint,Nepeta faassenii,NEFA,Perennial,24,36,4,Summer,\"Aggressive, increasing plant. N. x faassenii is sterile therefore must be propagated by division. Cats go nuts with this plant. Easily grown in average, dry to medium, well-drained soils in full sun to part shade. Prefers cool, moist soils. Plants are not as drought tolerant as many of the other Nepetas. In northern areas, site plants in full sun. In the deep South, site plants in areas with some light afternoon shade. Plants may be cut back before first flowering to promote more compact size. Shear flower spikes after initial flowering to promote continued bloom.Propagation Propagate by division in spring or autumn. Propagate by softwood cuttings in early summer."
    },
    {
        "Id": 2568,
        "Name": "Earth Chestnut",
        "Scientific name": "Bunium bulbocastanum",
        "Binomial": "BUBU",
        "Plant Type": "Perennial",
        "Height": 24,
        "Spread": 12,
        "Root Depth": 0,
        "Seasonal Interest": "Summer",
        "Notes": "Perennial root crop with edible tubers and flowers.",
        "Flower Color": "White",
        "Root Type": "Tuber",
        "Bloom Time": "Early Summer - Summer",
        "Fruit Time": "",
        "Texture": "Fine",
        "Form": "Upright",
        "Growth Rate": "Fast",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "5 -- 9",
        "Soil Moisture": "Moderate",
        "Soil pH": "5.0 - 7.5",
        "Ecological Function": "Insectory",
        "Human Use/Crop\r": "Food\r"
    },
    {
        "Id": 7986,
        "Name": "Star Chickweed",
        "Scientific name": "Stellaria pubera",
        "Binomial": "STPU",
        "Plant Type": "Perennial",
        "Height": 12,
        "Spread": 24,
        "Root Depth": 3,
        "Seasonal Interest": "Spring",
        "Notes": "Star chickweed can be distinguished from its more invasive relatives by the much larger flowers, which are deeply notched and look like stars.",
        "Flower Color": "White",
        "Root Type": "Tap, Fibrous Shallow",
        "Bloom Time": "Spring - Late Spring",
        "Fruit Time": "Summer",
        "Texture": "Medium",
        "Form": "Clump",
        "Growth Rate": "Fast",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Partial_Shade",
        "Hardiness Zone": "4 -- 9",
        "Soil Moisture": "Wet, Moderate",
        "Soil pH": "5.5 - 6.5",
        "Ecological Function": "Domestic Animal Forage, Insectory",
        "Human Use/Crop\r": "Food, Medicine, Ornamental, Soap\"\r\n2181,Chicory,Cichorium intybus,CIIN,Perennial,48,24,8,Summer-Fall,Blooms summer to early fall; medium-blue flowers,\"Blue, Pink"
    },
    {
        "Id": 2818,
        "Name": "Marsh Cinquefoil",
        "Scientific name": "Potentilla palustris",
        "Binomial": "POPA",
        "Plant Type": "Perennial",
        "Height": 3,
        "Spread": 2,
        "Root Depth": 0,
        "Seasonal Interest": "Spring-Summer",
        "Notes": "Also called purple marsh locks, cowberry, purplewort, meadow nuts, or bog strawberry. Marsh cinquefoil is a low-growing, sprawling, emergent perennial with reddish trailing stems and reddish-purple flowers. The flowers produce a foul odor that attracts flies for pollination. Marsh cinquefoil grows in bogs, marshes, wet meadows, creek banks, and lake margins.",
        "Flower Color": "Purple, Red",
        "Root Type": "Stolon",
        "Bloom Time": "Late Spring - Late Summer",
        "Fruit Time": "",
        "Texture": "Medium",
        "Form": "Spreading",
        "Growth Rate": "Fast",
        "Insect Predation": "",
        "Disease": "",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "3 -- 9",
        "Soil Moisture": "Wet",
        "Soil pH": "0.0 - 0.0",
        "Ecological Function": "Wildlife Food",
        "Human Use/Crop\r": "Dye, Medicine\"\r\n1861,Alsike Clover,Trifolium hybridum,TRHY,Perennial,12,6,12,,\"T. hybridum is a short lived perennial which favours cool moist conditions. It is found on grasslands and mountainsides throughout the cool temperate regions of the world. Originating in mainland Europe and southwest Asia, this species has become naturalized throughout most of Europe, the Americas and Asia, mainly through its cultivation for hay, pasture and fodder Used primarily for hay and forage, and is not likely to persist beyond 2 years. The inoculant bacteria Rhizobium may be required to confer salt tolerance. Buy plants pre-inoculated with the bacteria or add it prior to planting. Does not perform well when regular mowing occurs. T. hybridum favours cool moist conditions and acidic soils, and its growth and spread are usually determined by these factors. It is able to survive cold temperatures and frosts, but is not tolerant of shade or drought. T. hybridum is able to grow in soils and environments which are unsuitable for some closely related species. It can be cultivated in soils of varying pH and favours acidic soils which gives it an advantage over other species. It prefers moist conditions, with plenty of rainfall and will grow in waterlogged or wet soil, even withs"
    },
    {
        "Id": 2631,
        "Name": "White Ladino Clover",
        "Scientific name": "Trifolium repens' Ladino'",
        "Binomial": "TRRE",
        "Plant Type": "Perennial",
        "Height": 18,
        "Spread": 18,
        "Root Depth": 14,
        "Seasonal Interest": "Spring-Fall",
        "Notes": "Best white clover adapted to rotational pasture grazing. Grows on poorly drained soils.",
        "Flower Color": "White",
        "Root Type": "Fibrous Shallow",
        "Bloom Time": "Late Spring - Late Summer",
        "Fruit Time": "",
        "Texture": "Medium",
        "Form": "Spreading",
        "Growth Rate": "Fast",
        "Insect Predation": "Minor",
        "Disease": "Medium",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "3 -- 10",
        "Soil Moisture": "Wet, Moderate",
        "Soil pH": "5.0 - 7.0",
        "Ecological Function": "Domestic Animal Forage, Erosion Control, Groundcover, Insecticide, Insectory, Mulch Maker, Nitrogen Fixer, Nurse, Wildlife Food",
        "Human Use/Crop\r": "\r"
    },
    {
        "Id": 2630,
        "Name": "White New Zealand Clover",
        "Scientific name": "Trifolium repens 'New Zealand'",
        "Binomial": "TRRE",
        "Plant Type": "Perennial",
        "Height": 12,
        "Spread": 18,
        "Root Depth": 14,
        "Seasonal Interest": "Spring-Fall",
        "Notes": "Planted in lawns, orchards and vineyards or pathways. More vigorous and heat tolerant than Dutch white.",
        "Flower Color": "White",
        "Root Type": "Fibrous Shallow",
        "Bloom Time": "Late Spring - Late Summer",
        "Fruit Time": "",
        "Texture": "Medium",
        "Form": "Spreading",
        "Growth Rate": "Fast",
        "Insect Predation": "Minor",
        "Disease": "Medium",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "3 -- 10",
        "Soil Moisture": "Wet, Moderate",
        "Soil pH": "5.0 - 7.0",
        "Ecological Function": "Domestic Animal Forage, Erosion Control, Groundcover, Insecticide, Insectory, Mulch Maker, Nitrogen Fixer, Nurse, Wildlife Food",
        "Human Use/Crop\r": "\r"
    },
    {
        "Id": 1678,
        "Name": "Wild Columbine",
        "Scientific name": "Aquilegia canadensis",
        "Binomial": "AQCA",
        "Plant Type": "Perennial",
        "Height": 30,
        "Spread": 24,
        "Root Depth": 12,
        "Seasonal Interest": "Spring",
        "Notes": "Vigorous grower, re-seeds freely. (Area doubles every 2-3 years) Blooms after first year. Deadheading will lengthen blooming period.",
        "Flower Color": "Red, Yellow",
        "Root Type": "Fibrous Deep",
        "Bloom Time": "Late Spring - Early Summer",
        "Fruit Time": "",
        "Texture": "Medium",
        "Form": "Upright",
        "Growth Rate": "Fast",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "3 -- 8",
        "Soil Moisture": "Moderate",
        "Soil pH": "6.0 - 7.0",
        "Ecological Function": "Dynamic Accumulator, Insectory",
        "Human Use/Crop\r": "Aromatics/Fragrance, Food\"\r\n1692,Green Headed Coneflower (Wild Goldenglow),Rudbeckia laciniata,RULA,Perennial,72,60,12,Fall,\"Green-Head Coneflower is a herbaceous perennial that grows 3 to 10 feet tall with a tall and lanky appearance, although it may only reach half that height when cultivated. The plant prefers moist soil, but grows well in average, medium, well-drained soil in full sun to part shade and is often found in woods, meadows, streambanks, and roadside ditches. R. laciniata is found mainly in bright, humid areas, such as wetlands, riparian areas, forest edges, at rail and roadsides and in disturbed areas in relatively cool regions in both on native and introduced ranges. The plant tolerates hot, humid summers, but can spread aggressively by underground rhizomes. To keep the plant under control, divide clumps and deadhead old flowers to encourage rebloom. Green-Head Coneflower displays 2 to 4 inch yellow flowers from late summer into the fall. Foliage is divided into 1 or 2 pairs of toothed lobes on the bottom leaves, while upper leaves may or may not be lobed."
    },
    {
        "Id": 5970,
        "Name": "Bigroot Cranesbill",
        "Scientific name": "Geranium macrorrhizum",
        "Binomial": "GEMA",
        "Plant Type": "Perennial",
        "Height": 18,
        "Spread": 24,
        "Root Depth": 5,
        "Seasonal Interest": "Spring-Summer",
        "Notes": "Also known by rock cranesbill and bigroot geranium. Leaves become reddish in autumn. There are numerous cultivars selected for different ornamental traits. Easily propagated by dividing rhizomes. Tolerates full sun in areas with cool summers and tolerates heat and humidity more than some other Geraniums. Requires well-drained soil. Tolerant of juglone.",
        "Flower Color": "Pink, Purple",
        "Root Type": "Rhizome",
        "Bloom Time": "Late Spring - Summer",
        "Fruit Time": "Summer - Fall",
        "Texture": "Medium",
        "Form": "Clump",
        "Growth Rate": "Fast",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade, Shade",
        "Hardiness Zone": "3 -- 8",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "5.5 - 7.8",
        "Ecological Function": "Groundcover, Insectory",
        "Human Use/Crop\r": "Aromatics/Fragrance, Container Garden, Essential Oil, Medicine, Ornamental\"\r\n6068,\"Crested Iris, Dwarf"
    },
    {
        "Id": 1684,
        "Name": "Shasta Daisy",
        "Scientific name": "Chrysanthemum x superbum 'Alaska'",
        "Binomial": "CHx",
        "Plant Type": "Perennial",
        "Height": 36,
        "Spread": 24,
        "Root Depth": 0,
        "Seasonal Interest": "Summer",
        "Notes": "Minor disease concern - wilt, rust in wet years. Minor insect concern - spider mites, aphids, leaf minors. Short life expectancy, but re-seeds itself. Longer life expectancy with regular care.",
        "Flower Color": "White",
        "Root Type": "Rhizome",
        "Bloom Time": "Early Summer - Early Fall",
        "Fruit Time": "",
        "Texture": "Medium",
        "Form": "Upright",
        "Growth Rate": "Fast",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun",
        "Hardiness Zone": "5 -- 10",
        "Soil Moisture": "Moderate",
        "Soil pH": "0 - 0",
        "Ecological Function": "Erosion Control, Nurse",
        "Human Use/Crop\r": "Cut Flower\r"
    },
    {
        "Id": 2007,
        "Name": "Dandelion",
        "Scientific name": "Taraxacum officinale",
        "Binomial": "TAOF",
        "Plant Type": "Perennial",
        "Height": 12,
        "Spread": 18,
        "Root Depth": 36,
        "Seasonal Interest": "Spring",
        "Notes": "Yellow flower. Common dandelion creates a long-lived seedbCommon dandelion occurs on soils that vary from thin layers above permafrost in the subarctic to deep loams in the western United States. Soil texture ranges from clays and clayey loams to sandy loams. Common dandelion does poorly on dense clay soils, saline soils, and acidic soils. The dandelion is so successful at colonising abandoned areas of the garden that no help is really needed to grow it. The plentiful one-seeded fruits are carried on the wind and can travel relatively long distances so neglecting a garden will usually ensure that this plant appears. Removing it is more difficult, as the long, thick taproots will delve down deeply into a border or lawn and even in cracks in paving, making them hard to remove completely. Chopping off the top of the plant is not enough to kill it as it will sprout again from the remaining roots. Rabbits love the leaves so if you have one as a pet it may appreciate a patch of dandelions being allowed to grow in a corner of the garden. The flowers and fruiting heads are attractive but this plant can soon take over and, because it is so strongly associated with a poorly kept garden, d",
        "Flower Color": "Yellow",
        "Root Type": "Tap",
        "Bloom Time": "Spring - Late Spring",
        "Fruit Time": "Spring - Fall",
        "Texture": "Medium",
        "Form": "Upright",
        "Growth Rate": "Fast",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "3 -- 10",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "4.8 - 7.5",
        "Ecological Function": "Domestic Animal Forage, Dynamic Accumulator, Herbicide, Insectory, Reclamator, Soil Builder, Wildlife Food",
        "Human Use/Crop\r": "Compost, Food, Food, Food, Medicine, Medicine\"\r\n6020,Coastal Day Lily,Hemerocallis littorea,HELI,Perennial,36,18,4,Spring-Summer,\"Individual flowers are short-lived, opening in the morning and withering in the evening. The plant, however, produces a succession of flowers over a period of about 6 weeks. Hybridizes freely with other members of this genus. Unlike the type species, this form does produce viable seed. Plants take a year or two to become established after being moved. They can then spread quite freely. Plants seem to be immune to the predations of rabbits. The plants are very susceptible to slug and snail damage, the young growth in spring is especially at risk. Dried hollow flower stalks make a useful substitute drinking straw."
    },
    {
        "Id": 1669,
        "Name": "Stella d Oro Daylily",
        "Scientific name": "Hemerocallis (Stella d Oro)",
        "Binomial": "HEST",
        "Plant Type": "Perennial",
        "Height": 24,
        "Spread": 30,
        "Root Depth": 16,
        "Seasonal Interest": "Summer",
        "Notes": "Minor insect concerns - Aphids. Competes well with tree roots. Heavy feeder, frequent dvision and deadheading for best flowering. Aggressive.",
        "Flower Color": "Orange, Yellow",
        "Root Type": "Fibrous Deep",
        "Bloom Time": "Late Spring - Fall",
        "Fruit Time": "",
        "Texture": "Medium",
        "Form": "Upright",
        "Growth Rate": "Fast",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "3 -- 9",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "4.8 - 8.0",
        "Ecological Function": "Erosion Control, Soil Builder",
        "Human Use/Crop\r": "Fiber, Food, Medicine\"\r\n1685,Spotted Deadnettle,Lamium maculatum,LAMA,Perennial,12,36,2,Summer,Attracts leaf litter in fall and winter. Tolerant of a wide range of cultural conditions and is easily grown in average well-drained soils. May scorch in too much sun. Not tolerant of foot traffic.,\"Pink, White"
    },
    {
        "Id": 5685,
        "Name": "Sour Fig ( Hottentot-Fig, Ice Plant)",
        "Scientific name": "Carpobrotus edulis",
        "Binomial": "CAED",
        "Plant Type": "Perennial",
        "Height": 6,
        "Spread": 35,
        "Root Depth": 6,
        "Seasonal Interest": "Spring",
        "Notes": "Carpobrotus edulis roots easily from cuttings. Take 200-300 mm long tip cuttings during the summer. No rooting hormone or mist unit is required, either plant them where they are intended to grow or directly into a container filled with well-drained potting soil. Seed can be sown in spring, early summer or autumn. Seedlings damp off easily and must be grown in pure sand for best results. High humidity will cause bacterial rot of the leaves. Plants in shady positions or poorly drained sites are often affected by fungal diseases ( Botrytis ). Snails cause leaf damage in damp gardens. Plants in old clumps may die back in the centre. Over-fertilizing will cause wilt and die-back.Mature fruits do not release the seeds for at least 3 years, dispersal depending on frugivorous mammals – see Movement and Dispersal. Numerous seeds are embedded in each fruit and may number over 1000 per m². When seeds are eventually released to the soil through rotting of the fruit they may remain viable in the soil for two years.",
        "Flower Color": "Yellow",
        "Root Type": "Stolon, Long Rhizome",
        "Bloom Time": "Early Spring - Late Spring",
        "Fruit Time": "Summer - Fall",
        "Texture": "Fine",
        "Form": "Creeping",
        "Growth Rate": "Fast",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun",
        "Hardiness Zone": "9 -- 12",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "6.5 - 8.0",
        "Ecological Function": "Erosion Control, Erosion Control, Groundcover, Insectory, Insectory, Reclamator, Wildlife Food, Wildlife Habitat",
        "Human Use/Crop\r": "Container Garden, Food, Medicine, Ornamental\"\r\n1705,Garden Flax,Linum perenne,LIPE,Perennial,24,18,0,Summer,\"Minor disease concern - rot. Short life expectancy, but will self sow. Sensitive to hot summers. Blossoms last only a day. Will bloom all summer if deadheaded before going to seed. Does not like roots disturbed by cultivation so it is best to mulch."
    },
    {
        "Id": 8321,
        "Name": "Haemanth Garlic",
        "Scientific name": "Allium haemanthoides",
        "Binomial": "ALHA",
        "Plant Type": "Perennial",
        "Height": 8,
        "Spread": 10,
        "Root Depth": 5,
        "Seasonal Interest": "Spring-Fall",
        "Notes": "Native to Iraq and Iran, Allium haemanthoides is a bulb-forming herbaceous, perennial with a densely packed umbel of white flowers with dark mideveins on the tepals. In the mountains of Hamadan, mountains west of Bandar Anzali, Kermanshah and Kordestan provinces it is a rather common species growing on dry and often stony or rocky slopes. The small bulb is formed on a short rhizome - as more bulbs are produced the plant develops into a moderate-sized clump. ELEVATION: Up to 72 feet and higher in mountainous areas of Iraq and Iran. Elevations on not too dry and often steep steppe slopes. POLLINATION: Bees, butterflies & Insects. PROPAGATION: Seed, bulbs, or by division.",
        "Flower Color": "Purple, Red, White",
        "Root Type": "Bulb, Fibrous Shallow",
        "Bloom Time": "Late Spring - Early Summer",
        "Fruit Time": "Summer",
        "Texture": "Coarse",
        "Form": "Upright",
        "Growth Rate": "Fast",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun",
        "Hardiness Zone": "3 -- 9",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "6.1 - 7.8",
        "Ecological Function": "Dynamic Accumulator, Insectory",
        "Human Use/Crop\r": "Container Garden, Cut Flower, Food, Medicine, Medicine, Medicine, Ornamental\"\r\n5419,Mouse Garlic,Allium angulosum,ALAN,Perennial,24,18,3,Spring-Summer,\"Allium angulosum is a herbaceous, perennial plant growing from an underground bulb. It is a semi-evergreen variety which forms clumps of long narrow leaves, topped in summer with drumsticks pastel flowers. The small bulb is formed on a short rhizome - as more bulbs are produced the plant develops into a moderate-sized clump. It is cultivated as a vegetable in Siberia. - RANGE: Europe - southern Russia to France, east to Ukraine and the Balkans; W. Asia - Kazakhstan, southern Siberia. - HABITAT: Damp meadows near rivers. Flood-plain meadows, birch groves. Chalk & sand. - POLLINATION: Bees, butterflies & Insects. PROPAGATION: Seed, bulbs, or by division. - This species is often sold in nurseries as Allium pyrenaicum. The flowers do not have the usual onion smell. Cup-shaped fragrant umbels. Tolerates temporary flooding. Angulosum suffers from the drainage of flood plains therefore regarded as a rare plant."
    },
    {
        "Id": 5972,
        "Name": "Cinquefoil Geranium",
        "Scientific name": "Geranium potentilloides",
        "Binomial": "GEPO",
        "Plant Type": "Perennial",
        "Height": 24,
        "Spread": 36,
        "Root Depth": 0,
        "Seasonal Interest": "Spring-Fall",
        "Notes": "Also known as Australian cranesbill, soft cranesbill, and native carrot. The flowers are hermaphrodite and pollinated by insects. Roots from nodes to spread and form clumps.",
        "Flower Color": "Pink",
        "Root Type": "Tap, Stolon",
        "Bloom Time": "Late Spring - Early Fall",
        "Fruit Time": "",
        "Texture": "Medium",
        "Form": "Prostrate",
        "Growth Rate": "Fast",
        "Insect Predation": "",
        "Disease": "",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "5 -- 9",
        "Soil Moisture": "Wet, Moderate",
        "Soil pH": "5.5 - 7.5",
        "Ecological Function": "Groundcover",
        "Human Use/Crop\r": "Food, Ornamental\"\r\n5976,Sticky Purple Geranium,Geranium viscosissimum,GEVI,Perennial,35,24,6,Spring-Summer,\"Often confused with G. richardsonii, which is also sometimes called sticky geranium. Habitats include foothills, canyons, open woodlands and montane environments. Prefers well-drained soil. Plants become woody with age. Seed requires scarification with sand paper and soaking in water for 24-48 h to help break dormancy."
    },
    {
        "Id": 1665,
        "Name": "Goutweed (Bishop's Weed, Dwarf Elder)",
        "Scientific name": "Aegopodium podagraria",
        "Binomial": "AEPO",
        "Plant Type": "Perennial",
        "Height": 10,
        "Spread": 36,
        "Root Depth": 8,
        "Seasonal Interest": "Summer",
        "Notes": "Also known as snow on the mountain. Not affected by walnut toxicity. Deer resistant. Best used as a persistent groundcover among shrubs in full sun. Can be very invasive. Foliage of the \"wild\" type is medium green in color; a commonly planted variegated form has bluish-green leaves with creamy white edges. Sometimes reversion back to solid green or a mixture of solid green and the lighter variegated pattern occurs within a patch. Ground Elder has a long history of medicinal use and was cultivated as a food crop and medicinal herb in the Middle Ages. To control its spread Small patches can be dug by hand. All underground parts must be removed to prevent plants from regenerating from rhizome fragments. Plant material should be bagged to prevent the dispersal of rhizome fragments. Large infestations can be controlled with herbicides, such as glyphosate. Frequent mowing to prevent seed set can contain populations. Mowing populations in the spring or early summer followed by covering them with black plastic sheeting can effectively control bishop’s goutweed. Controlled areas should be monitored for several years following treatment. No biological control agents are available in North A",
        "Flower Color": "White",
        "Root Type": "Long Rhizome",
        "Bloom Time": "Late Spring - Late Summer",
        "Fruit Time": "Summer",
        "Texture": "Medium",
        "Form": "Spreading",
        "Growth Rate": "Fast",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade, Shade",
        "Hardiness Zone": "2 -- 10",
        "Soil Moisture": "Wet, Moderate, Dry",
        "Soil pH": "5.0 - 8.0",
        "Ecological Function": "Erosion Control, Groundcover, Insectory, Reclamator",
        "Human Use/Crop\r": "Food, Medicine, Medicine, Ornamental\"\r\n2240,Quack Grass,Elymus repens,ELRE,Perennial,18,36,14,Spring-Fall,Noxious weed. Easily regenerates from very small broken rhizome fragments making mechanical control difficult.,Yellow,Long Rhizome,Early Summer - Early Fall,,Medium,Spreading,Fast,Minor,Minor,\"Full_Sun, Partial_Shade, Shade"
    },
    {
        "Id": 4288,
        "Name": "Florida Hedgenettle (Rattlesnake Weed)",
        "Scientific name": "Stachys floridana",
        "Binomial": "STFL",
        "Plant Type": "Perennial",
        "Height": 20,
        "Spread": 8,
        "Root Depth": 4,
        "Seasonal Interest": "Spring-Fall",
        "Notes": "Florida Betony is a perennial herb typically found in lawns, gardens, and landscapes. It is native to the United States, where its true native range is probably limited to Florida, but it is known throughout the southeast as a common weed. It has been called wild artichoke, but it is not related to the artichoke. It is a cool-season perennial that emerges primarily from tubers during the cool, moist months of fall. It grows vigorously in the fall and will stay green through the winter unless temperatures become very cold, in which case, it dies back temporarily. Vigorous growth resumes in early spring, and flowering occurs from late spring to early summer. At the onset of high summer temperatures, growth stops, and the plant becomes nearly dormant. The plant produces many seeds, but often reproduces by means of rhizomes and tubers. Small segments of rhizome can sprout into new plants or the tuber may be transported to a new area. It can be found in lawns and ornamentals, where it can be harder to control than in lawns. Weed control in ornamentals may require hand-pulling, with careful removal of all the tubers. The plants are characterized by hairy, erect stems reaching 19 inches",
        "Flower Color": "Pink, Purple, White",
        "Root Type": "Rhizome, Tuber",
        "Bloom Time": "Early Spring - Spring",
        "Fruit Time": "Summer - Fall",
        "Texture": "Medium",
        "Form": "Spreading",
        "Growth Rate": "Fast",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "8 -- 11",
        "Soil Moisture": "Wet, Moderate",
        "Soil pH": "5.5 - 8.0",
        "Ecological Function": "Groundcover, Insectory",
        "Human Use/Crop\r": "Food, Food\"\r\n1745,Hen and Chicks,Sempervivum tectorum,SETE,Perennial,6,18,6,Summer,\"Green or red foliage varieties available. Grown for its foliage. Very low toxicity if eaten, minor skin irritation. Plant will die after blooming, but rosettes multiply around the base so quickly, this is usually not noticed."
    },
    {
        "Id": 3048,
        "Name": "Cranberry Hibiscus",
        "Scientific name": "Hibiscus acetosella",
        "Binomial": "HIAC",
        "Plant Type": "Perennial",
        "Height": 6,
        "Spread": 6,
        "Root Depth": 0,
        "Seasonal Interest": "All Year",
        "Notes": "Likes fertile, well-drained soil. Generally nematode and insect resistant. Grown as a often self-sowing annual in colder climates.",
        "Flower Color": "Pink, Red",
        "Root Type": "Fibrous Shallow",
        "Bloom Time": "",
        "Fruit Time": "",
        "Texture": "Medium",
        "Form": "Upright",
        "Growth Rate": "Fast",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "8 -- 11",
        "Soil Moisture": "Moderate",
        "Soil pH": "6.1 - 6.5",
        "Ecological Function": "Insecticide",
        "Human Use/Crop\r": "Food, Ornamental\"\r\n1667,Hollyhock,Alcea rosea,ALRO,Perennial,72,36,8,Summer,\"May need to be staked or planted along a fence or wall for support. Biennial but self seeds readily. Half hardy biennial/perennial to zone 5. Subject to rust and defoliation in wet seasons. Found through much of the temperate zone, the original habitat is obscure, it is 'probably of hybrid origin. The plant is usually grown as a biennial due to its susceptibility to the fungal disease 'rust'. Seed - sow mid spring or late summer in pots or in situ. Easily grown from seed, which usually germinates in about 2 - 3 weeks at 20°c. When large enough to handle, prick the seedlings out into individual pots and plant them out in the spring. Division after flowering. Only use rust-free specimens. Root cuttings in early winter. Basal cuttings at almost any time of the year. Tolerates black walnut juglone."
    },
    {
        "Id": 1883,
        "Name": "Joe Pye Weed (Queen of the Meadow)",
        "Scientific name": "Eupatorium maculatum",
        "Binomial": "EUMA",
        "Plant Type": "Perennial",
        "Height": 78,
        "Spread": 48,
        "Root Depth": 14,
        "Seasonal Interest": "Summer-Fall",
        "Notes": "Habitats include wet black soil prairies, wet sand prairies, sedge meadows, marshes, fens, and swampy thickets with small trees or shrubs. Spotted Joe-Pye Weed is partial to sandy wetlands, but it is also found in non-sandy wetlands. It is usually found in high quality natural areas, rather than degraded habitats with a history of disturbance. The preference is full or partial sun, wet to moist conditions, and a mineral-rich soil containing silty or sandy loam. Spotted Joe-Pye Weed is more tolerant of water-logged conditions than most plants. The root system is fibrous and rhizomatous.",
        "Flower Color": "Pink",
        "Root Type": "Fibrous Deep, Rhizome",
        "Bloom Time": "Summer - Early Fall",
        "Fruit Time": "Fall",
        "Texture": "Medium",
        "Form": "Upright",
        "Growth Rate": "Fast",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade, Shade",
        "Hardiness Zone": "3 -- 6",
        "Soil Moisture": "Wet, Moderate",
        "Soil pH": "4.5 - 7.0",
        "Ecological Function": "Erosion Control, Insectory, Water Purifier, Wildlife Food",
        "Human Use/Crop\r": "Cut Flower, Fiber, Medicine, Medicine, Medicine, Medicine, Ornamental\"\r\n7476,Hollow Joe-Pye Weed (Trumpetweed),Eutrochium fistulosum (Eupatorium fistulosum),EUFI,Perennial,84,48,16,Summer-Fall,\"Sometimes referenced in the genuses Eupatoriadelphus and Eupatorium. Recommended for use in rain gardens. Best in moist humusy soils. Needs ample room for planting. Of special concern or threatened in parts of its native range. Propagate by divisions, seeds, or cuttings. May exceed 7ft (2m) in constant moisture."
    },
    {
        "Id": 7766,
        "Name": "Lamb's Ears (Grey Tea Stachys, Boesmantee)",
        "Scientific name": "Stachys rugosa",
        "Binomial": "STRU",
        "Plant Type": "Perennial",
        "Height": 47,
        "Spread": 0,
        "Root Depth": 6,
        "Seasonal Interest": "Spring-Fall",
        "Notes": "Common names: grey tea stachys (Eng.); vaaltee, bojanntee, boesmantee, dassiekruie (Afr.) - Spring - Summer flowering Stachys rugosa is a water- wise, ornamental, herbaceous perennial, with felted leaves that have a pungent aroma of pyrethrum or sheep dip, when crushed. Flowering season: Sporadic/All year. Square stems, typical of Lamiaceae and densely covered in hairs, giving them a grey appearance. The grey-green leaves are covered in fine hairs, sessile, arranged alternately opposite each other along the stem and lanceolate (lance-shaped), with a faintly toothed margin. Stachys rugosa is found in habitats of rocky mountain slopes or plateau, usually with a high clay content. The genus name is derived from the Greek stachys, meaning ‘spike’ and refers to the inflorescence. The species name rugosa, means ‘wrinkled’, referring to the appearance of the leaves. Cut back in late winter.",
        "Flower Color": "Pink, Purple, Yellow",
        "Root Type": "Tap, Fibrous Shallow",
        "Bloom Time": "Early Spring - Late Summer",
        "Fruit Time": "Summer - Fall",
        "Texture": "Medium",
        "Form": "Spreading",
        "Growth Rate": "Fast",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "5 -- 8",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "5.6 - 7.3",
        "Ecological Function": "Groundcover, Insectory",
        "Human Use/Crop\r": "Food, Ornamental\"\r\n6517,Lesser Celandine,Ranunculus ficaria,RAFI,Perennial,12,12,3,Spring,Also called fig buttercup or pilewort. Dies back and goes dormant after flowering. Easily propagates via bulblets that form on the stems and tubers. Thrives in mesic environments. Polymorphic species. Increased drought tolerance during dormancy.,Yellow,\"Tuber, Fibrous Shallow"
    },
    {
        "Id": 1707,
        "Name": "Pale Spiked Lobelia",
        "Scientific name": "Lobelia spicata",
        "Binomial": "LOSP",
        "Plant Type": "Perennial",
        "Height": 36,
        "Spread": 18,
        "Root Depth": 6,
        "Seasonal Interest": "Fall",
        "Notes": "The upside-down flowers vary from pale shades of blue and purple to white. Palespike lobelia tolerates a range of soil conditions (including moist soil on occasion) but prefers to be well drained.",
        "Flower Color": "Pink",
        "Root Type": "Fibrous Shallow",
        "Bloom Time": "Late Summer - Early Fall",
        "Fruit Time": "Summer",
        "Texture": "Fine",
        "Form": "Upright",
        "Growth Rate": "Fast",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "2 -- 8",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "6.0 - 8.0",
        "Ecological Function": "Insectory",
        "Human Use/Crop\r": "Medicine\r"
    },
    {
        "Id": 6200,
        "Name": "Purple Loosestrife",
        "Scientific name": "Lythrum salicaria",
        "Binomial": "LYSA",
        "Plant Type": "Perennial",
        "Height": 118,
        "Spread": 36,
        "Root Depth": 12,
        "Seasonal Interest": "Summer",
        "Notes": "Native to a variety of wetland habitats. Self-seeds in good conditions. Stem becomes woody with age. Very good at colonizing disturbed areas. Develops up to 50 stems from the base of the plant.",
        "Flower Color": "Pink, Purple",
        "Root Type": "Tap, Rhizome",
        "Bloom Time": "Summer - Fall",
        "Fruit Time": "Fall - Winter",
        "Texture": "Medium",
        "Form": "Upright",
        "Growth Rate": "Fast",
        "Insect Predation": "Minor",
        "Disease": "Medium",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "3 -- 10",
        "Soil Moisture": "Wet, Moderate",
        "Soil pH": "4.0 - 9.0",
        "Ecological Function": "Insectory, Toxin Absorber",
        "Human Use/Crop\r": "Container Garden, Cut Flower, Dye, Food, Medicine, Oil, Wax, Resin or Polish, Ornamental\"\r\n6199,Yellow Loosestrife,Lysimachia vulgaris,LYVU,Perennial,72,72,8,Summer,Also called garden or golden loosestrife. Best in well-drained soils. Spreads via rhizomes and seeds. Endomycorrhizal and non-mycorrhizal.,Yellow,\"Long Rhizome, Fibrous Shallow"
    },
    {
        "Id": 6545,
        "Name": "Madder",
        "Scientific name": "Rubia tinctorum",
        "Binomial": "RUTI",
        "Plant Type": "Perennial",
        "Height": 120,
        "Spread": 30,
        "Root Depth": 8,
        "Seasonal Interest": "Summer",
        "Notes": "Seed - best sown as soon as it is ripe in a cold frame. Stored seed can be very slow to germinate. Prick out the seedlings when they are large enough to handle and grow them on in light shade in the greenhouse for the first year. Plant them out into their permanent positions in early summer. Division in spring or at any time in the growing season if the divisions are kept well watered until established. Larger divisions can be planted out direct into their permanent positions. The plant produces many side roots that can travel just under the surface of the soil for some distance before sending up new shoots.",
        "Flower Color": "Green, White, Yellow",
        "Root Type": "Rhizome",
        "Bloom Time": "Early Summer - Summer",
        "Fruit Time": "Summer - Fall",
        "Texture": "Medium",
        "Form": "Creeping",
        "Growth Rate": "Fast",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Partial_Shade, Shade",
        "Hardiness Zone": "6 -- 10",
        "Soil Moisture": "Moderate",
        "Soil pH": "6.1 - 7.8",
        "Ecological Function": "Domestic Animal Forage",
        "Human Use/Crop\r": "Dye, Medicine, Medicine, Oil, Wax, Resin or Polish\"\r\n1763,Tall Meadow Rue (Purple Meadow Rue),Thalictrum dasycarpum,THDA,Perennial,60,48,,Spring,Has purplish stems. The flowers have no petals.,\"Green, White, Yellow"
    },
    {
        "Id": 2920,
        "Name": "Mexican Sunflower",
        "Scientific name": "Tithonia diversifolia",
        "Binomial": "TIDI",
        "Plant Type": "Perennial",
        "Height": 150,
        "Spread": 144,
        "Root Depth": 0,
        "Seasonal Interest": "All Year",
        "Notes": "Likes well-drained soil. Grows well in infertile soils. Becomes woody and shub-like when growing vigorously. Flowers and seeds throughout the year. Young plants eaten by gophers.",
        "Flower Color": "White",
        "Root Type": "Tap, Stolon",
        "Bloom Time": "",
        "Fruit Time": "",
        "Texture": "Coarse",
        "Form": "Upright",
        "Growth Rate": "Fast",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun",
        "Hardiness Zone": "9 -- 11",
        "Soil Moisture": "Wet, Moderate",
        "Soil pH": "6.1 - 7.8",
        "Ecological Function": "Domestic Animal Forage, Erosion Control, Hedge, Insecticide, Insectory, Soil Builder",
        "Human Use/Crop\r": "Biomass, Cut Flower, Ornamental\"\r\n5368,Musk Milfoil,Achillea erba-rotta moschata,ACER,Perennial,7,4,6,Spring-Summer,\"Achillea erba-rotta moschata is a herbaceous perennial plant forming a mat of low growth with unbranched flowering stems up to 7.1 inches tall. Range: Europe - central Alps. - Altitude ranging from 4600 - 9800 ft+. Habitat: Rocky slopes, alpine grassland and scree on calcareous soils in the Alps. - Although an alpine plant that is used to very cold winters, it can be grown successfully in the more humid & milder environment of maritime gardens. Succeeds in most soils but prefers a well-drained soil in a sunny position. Lives longer in a poor soil. Hybridizes freely with other members of this genus. Propagation: Seed - sow spring or early autumn in a cold frame. The seed usually germinates in 1-3 months. When large enough to handle, prick the seedlings into individual pots & plant them in the summer. Division in spring or autumn. Very easy, the divisions can be planted direct into their permanent positions. Basal cuttings of new shoots in spring. Very easy, collect the shoots when they are about 4 in. tall, pot them individually & keep them in a warm but lightly shaded position. They should root within 3 weeks. Plant in the summer. They tolerate temperatures down to -9.4°F."
    },
    {
        "Id": 8313,
        "Name": "Short Calyx Milkvetch",
        "Scientific name": "Astragalus bustillosii",
        "Binomial": "ASBU",
        "Plant Type": "Perennial",
        "Height": 24,
        "Spread": 18,
        "Root Depth": 10,
        "Seasonal Interest": "Spring-Summer",
        "Notes": "Astragalus species that produce tragacanth gum are generally low-growing, spiny shrubs found in windy, usually semi-arid regions, often in mountains but also near the coast. They will often experience cold winters with frost, rain and snow and hot, dry summers. Most species grow in subarid areas with an annual precipitation of not more than 500mm, with a pronounced dry period of around four months in summer and most of the precipitation in winter. It is possible to grow many of these species outside of these habitats, especially in more continental climates. In moister climates, although they are likely to tolerate the low temperatures, they are unlikely to succeed if both summer and winter are wet unless the soil is very well-drained. Placing the plant in a local rain-shadow, such as the side of a building, can help successful cultivation.",
        "Flower Color": "Cream, White",
        "Root Type": "Tap, Rhizome",
        "Bloom Time": "Late Spring - Summer",
        "Fruit Time": "Summer - Fall",
        "Texture": "Coarse",
        "Form": "Upright",
        "Growth Rate": "Fast",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun",
        "Hardiness Zone": "5 -- 9",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "5.5 - 7.5",
        "Ecological Function": "Insectory, Nitrogen Fixer",
        "Human Use/Crop\r": "Biomass, Dye, Food, Medicine, Oil, Wax, Resin or Polish, Soap\"\r\n7426,Narrowleaf Milkweed,Asclepias fascicularis,ASFA,Perennial,36,12,6,Spring-Fall,\"Does not overwinter well in pots (less cold tolerant). Dies back in winter. Usually forms small colonies. For propagating by seed: No treatment. Seeds need light to germinate so just gently press them into the soil on their sides without burying them. Keep soil moist. Some seeds germinate in as little as 2 weeks after planting, but others in the same bed may continue to germinate for 1-2 months after that."
    },
    {
        "Id": 1698,
        "Name": "Dotted Mint (Horse Mint)",
        "Scientific name": "Monarda punctata",
        "Binomial": "MOPU",
        "Plant Type": "Perennial",
        "Height": 18,
        "Spread": 24,
        "Root Depth": 0,
        "Seasonal Interest": "Fall",
        "Notes": "",
        "Flower Color": "Pink",
        "Root Type": "Fibrous Shallow",
        "Bloom Time": "Late Summer - Early Fall",
        "Fruit Time": "",
        "Texture": "Medium",
        "Form": "Upright",
        "Growth Rate": "Fast",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun",
        "Hardiness Zone": "2 -- 8",
        "Soil Moisture": "Moderate",
        "Soil pH": "6.0 - 8.0",
        "Ecological Function": "Erosion Control, Insectory, Nurse",
        "Human Use/Crop\r": "Cut Flower, Essential Oil, Food, Medicine\"\r\n1814,Downy Wood Mint (Ohio Horsemint),Blephilia ciliata,BLCI,Perennial,30,18,,Summer,\"Ohio Horsemint is a wildflower in the mint family native to the central and eastern part of the U.S.A. Occurs in dryish open woods and thickets, clearings, fields and roadsides. A clump-forming, mint family member that features mostly unbranched, square stems which rise to 30\" tall. Blue-purple, two-lipped flowers appear in late spring to mid-summer in several tiered, whorled, globular clusters in an interrupted terminal spike, with each cluster being subtended by (resting upon) a whorl of fringed bracts. Similar in appearance to the closely related monardas. Lanceolate stem leaves are sessile, lightly-toothed, whitish-downy below and mildly fragrant when crushed. Leaves are usually considered to be lacking in the pungency and quality needed for use as a culinary herb. Small basal leaves and shoots remain green throughout the winter. Susceptible to powdery mildew. Foliage is often nibbled on by insects and plants can become rather tattered and unkempt by late summer. The root system consists of a taproot, which forms offshoots occasionally by means of short rhizomes."
    },
    {
        "Id": 6215,
        "Name": "Water Mint",
        "Scientific name": "Mentha aquatica",
        "Binomial": "MEAQ",
        "Plant Type": "Perennial",
        "Height": 35,
        "Spread": 35,
        "Root Depth": 0,
        "Seasonal Interest": "Summer",
        "Notes": "Also called marsh mint and aquatic mint. Can grow well in heavy clay soils. Plants can survive in waters up to 15cm (6in) and also on relatively dry land. Best grown near still water. Can grow from detached rhizome fragments. Hybridizes freely with other members of the Mentha genus.",
        "Flower Color": "Pink, Purple",
        "Root Type": "Long Rhizome, Fibrous Shallow",
        "Bloom Time": "Summer - Early Fall",
        "Fruit Time": "Fall - ?",
        "Texture": "Medium",
        "Form": "Upright",
        "Growth Rate": "Fast",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "5 -- 9",
        "Soil Moisture": "Wet, Moderate",
        "Soil pH": "6.0 - 8.0",
        "Ecological Function": "Erosion Control, Insectory, Toxin Absorber",
        "Human Use/Crop\r": "Aromatics/Fragrance, Container Garden, Essential Oil, Food, Insect Repellent, Medicine, Ornamental\"\r\n6220,\"Wild Mint (Horse Mint, Biblical Mint, Silver Mint)"
    },
    {
        "Id": 2512,
        "Name": "Allegheny Monkey Flower",
        "Scientific name": "Mimulus ringens",
        "Binomial": "MIRI",
        "Plant Type": "Perennial",
        "Height": 48,
        "Spread": 12,
        "Root Depth": 18,
        "Seasonal Interest": "Summer",
        "Notes": "Each flower purportedly resembles the face of a smiling monkey. Short-lived perennial that will reseed.",
        "Flower Color": "Pink, Purple",
        "Root Type": "Rhizome",
        "Bloom Time": "Early Summer - Early Fall",
        "Fruit Time": "Summer - Fall",
        "Texture": "Medium",
        "Form": "Upright",
        "Growth Rate": "Fast",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "3 -- 8",
        "Soil Moisture": "Wet, Moderate",
        "Soil pH": "5.5 - 6.5",
        "Ecological Function": "",
        "Human Use/Crop\r": "Ornamental\r"
    },
    {
        "Id": 2276,
        "Name": "Musk Mallow",
        "Scientific name": "Malva moschata",
        "Binomial": "MAMO",
        "Plant Type": "Perennial",
        "Height": 32,
        "Spread": 18,
        "Root Depth": 15,
        "Seasonal Interest": "Summer",
        "Notes": "Plants are generally quite short-lived though they can self-sow freely when in a suitable position and usually more than maintain themselves.Seed - best sown in early spring in a cold frame. The seed germinates quickly and easily. Prick out the seedlings into individual pots when they are large enough to handle and plant them out in their permanent positions in the early summer. If you have sufficient seed then it can be sown outdoors in situ in the middle to late spring. Basal cuttings in late spring. Harvest the shoots with plenty of underground stem when they are about 8 - 10cm above the ground. Pot them up into individual pots and keep them in light shade in a cold frame or greenhouse until they are rooting well. Plant them out in the summer. Cuttings of side shoots, mid summer in a cold frame.",
        "Flower Color": "Pink, Rose",
        "Root Type": "Tap, Long Rhizome",
        "Bloom Time": "Summer - Late Summer",
        "Fruit Time": "Summer - Fall",
        "Texture": "Medium",
        "Form": "Upright",
        "Growth Rate": "Fast",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "3 -- 9",
        "Soil Moisture": "Moderate",
        "Soil pH": "5.0 - 7.5",
        "Ecological Function": "Domestic Animal Forage, Insectory, Insectory",
        "Human Use/Crop\r": "Dye, Fiber, Food, Medicine, Ornamental\"\r\n2229,Stinging Nettle,Urtica dioica,URDI,Perennial,48,12,12,Spring-Fall,\"Nettles are one of the most undervalued of economic plants. They have a wide range of uses, for food, medicines, fibres etc and are also a very important plant for wildlife.Stinging nettle is used by foresters as an indicator of high soil fertility. Pollen dispersal in U. dioica is by wind, but is aided by the rapid outflexing of the stamens at anthesis, which produces an explosive release of pollen. This is best observed in the first minutes of morning sun are on the leaves after dawn as the dew dries from the plant, the flowers open and release the pollen. Propagation: Seed - sow spring in a cold frame, only just covering the seed. Prick out the seedlings into individual pots when they are large enough to handle, and plant them out in the summer. Division succeeds at almost any time in the growing season. Very easy, plant them straight out into their permanent positions. A typical colony or stand of nettles usually consists of a single plant with clonal stems that extend for yards beneath the ground in every direction."
    },
    {
        "Id": 2196,
        "Name": "Black Nightshade",
        "Scientific name": "Solanum americanum",
        "Binomial": "SOAM",
        "Plant Type": "Perennial",
        "Height": 30,
        "Spread": 24,
        "Root Depth": 0,
        "Seasonal Interest": "Summer",
        "Notes": "Berries are ripe from August to October but many people consider them toxic.",
        "Flower Color": "White",
        "Root Type": "Tap",
        "Bloom Time": "Summer - Early Fall",
        "Fruit Time": "",
        "Texture": "Medium",
        "Form": "Upright",
        "Growth Rate": "Fast",
        "Insect Predation": "Medium",
        "Disease": "",
        "Light": "Full_Sun",
        "Hardiness Zone": "3 -- 7",
        "Soil Moisture": "Dry",
        "Soil pH": "6.0 - 8.0",
        "Ecological Function": "Insecticide, Nurse, Toxin Absorber",
        "Human Use/Crop\r": "Food, Medicine\"\r\n6350,Oca,Oxalis tuberosa,OXTU,Perennial,18,36,4,Spring-Summer,\"Oca is a tuber crop native to the Andes, where it was developed alongside the similar tuber crops potato, ulluco, and mashua. Oca tubers are usually long and narrow, reaching about four inches in length. This crop is easy to grow in most of the Pacific Northwest, but challenging in the rest of the country. Yields can reach about three pounds per plant in favorable climates, but are usually lower. The tubers are vividly colored, mostly in reds, yellows, and oranges, and often have contrasting eyes. Cooked tubers are somewhat softer than potatoes and have a variety of flavors, from mild to acidic and a bit sweet to starchy. Oca is roughly as tolerant to summer heat as potato; it does best where temperatures don’t exceed 80 degrees too often. Tubers are produced during the short days of fall and are not ready for harvest until mid-November. The crop is propagated by planting tubers. True seeds are produced only under favorable conditions and are used for breeding. Oca typically has less problems with disease than potatoes, although this is not true everywhere. Most oca varieties require short days of 12 hours or less for tuber formation. A few will form tubers at 12.5 or eve"
    },
    {
        "Id": 2186,
        "Name": "Welsh Onion",
        "Scientific name": "Allium fistulosum",
        "Binomial": "ALFI",
        "Plant Type": "Perennial",
        "Height": 18,
        "Spread": 12,
        "Root Depth": 5,
        "Seasonal Interest": "Summer-Fall",
        "Notes": "Originally domesticated in China, the wild form no longer exists. The name Welsh onion is derived from a German name Welsche onion meaning foreign onion. Needs well-drained soil. There are many cultivars that vary characteristically. Grown as an annual in cooler climates. Generally intolerant of much competition from other plants, may inhibit the growth of legumes. Seed - sow spring in a greenhouse. The seed germinates over a wide range of temperatures, it is faster at higher temperatures[206 ]. Prick out the seedlings into individual pots when they are large enough to handle. When well-grown, the plants should be ready to be planted out in the summer. If they are not large enough at this time, grow them on in the greenhouse for their first winter and plant them out in late spring. Division of the plants is very easy and can be done at almost any time of the year though the spring is probably best. The divisions can be planted out straight into their permanent positions if required.",
        "Flower Color": "White",
        "Root Type": "Bulb",
        "Bloom Time": "Spring - Summer",
        "Fruit Time": "Fall",
        "Texture": "Medium",
        "Form": "Upright",
        "Growth Rate": "Fast",
        "Insect Predation": "Minor",
        "Disease": "Medium",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "4 -- 9",
        "Soil Moisture": "Moderate",
        "Soil pH": "6.5 - 7.5",
        "Ecological Function": "Aromatic Pest Confuser, Insectory",
        "Human Use/Crop\r": "Essential Oil, Food, Insect Repellent, Medicine, Medicine, Medicine, Ornamental\"\r\n8248,\"African Spotted Orchid (Monk Orchid, Lawn Orchid)"
    },
    {
        "Id": 8304,
        "Name": "Anatolian Orchid",
        "Scientific name": "Orchis anatolica",
        "Binomial": "ORAN",
        "Plant Type": "Perennial",
        "Height": 20,
        "Spread": 6,
        "Root Depth": 6,
        "Seasonal Interest": "All Year",
        "Notes": "Orchis anatolica is a species of flowering plant native to Crete, Cyprus, the East Aegean Islands, Greece, Iran, Iraq, Lebanon, Palestine, Syria, & Turkey. There's some confusion surrounding the identification of the plants found in Crete which may be the result of hybridization between O. anatolica and O. quadripunctata. There are many visual similarities between populations of Orchis anatolica, Orchis quadripunctata & Orchis sitiaca, but the smaller flowers & flat lip are the main distinguishing features which separate O. anatolica from the other two. HABITAT: Forests or degraded forest land in Ajloun, Jarash, Salt and Amman. Open woodland & scrub on dry-to-moist.calcareous substrates. Bright mountain pinewoods. Seasonally wet sub-soils that must be highly alkaline; therefore, it is found mainly on limestone or substrates of dolomite. ELEVATION: Up to 7,874 feet. The genus name Orchis means 'testacles', a reference to the twin tubers of orchids in this genus. The specific epithet anatolica comes from Anatolia, the region of western Asia (much of it in Turkey nowadays) where this orchid was first recorded. Species of the Orchis genus form symbiotic relationships with fungi specif",
        "Flower Color": "Lavender, Pink, Purple, White",
        "Root Type": "Tuber, Tuber",
        "Bloom Time": "Late Winter - Spring",
        "Fruit Time": "Spring - Summer",
        "Texture": "Medium",
        "Form": "Upright",
        "Growth Rate": "Fast",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "6 -- 12",
        "Soil Moisture": "Wet, Moderate",
        "Soil pH": "8.5 - 9.0",
        "Ecological Function": "Insectory",
        "Human Use/Crop\r": "Food, Food, Food, Food, Medicine, Medicine, Medicine, Ornamental, Ornamental\"\r\n6312,Bug Orchis,Anacamptis coriophora,ANCO,Perennial,14,6,6,Spring-Summer,\"Orchis coriophora is a Bulb up to 0.98 feet tall. RANGE: C. Europe to W. Asia. HABITAT: Dry or damp pastures & marshes in hills & mountains. Usually found on acid soils. Anacamptis coriophora occurs in the Balkans and throughout much of central and southern Europe. This orchid can be found in the Algarve (Portugal), Bulgaria, Greece, Russia, Romania, Germany and several other central European countries including Slovenia, Some authorities recognize a subspecies Anacamptis coriophora subsp. fragrans, which is said to have a sweeter scent and to differ slightly in appearance. POLLINATORS: Flies & Bees. PROPAGATION: Seeds and Division. POLLINATION: The species is hermaphrodite (has both male and female organs) and is pollinated by Flies, beetles. It cannot grow in the shade. It prefers moist soil. The common name of this orchid apparently refers to the somewhat unpleasant smell of the flowers. Seed - surface sow, preferably as soon as it is ripe, in the greenhouse and do not allow the compost to dry out. The seed of this species is extremely simple, it has a minute embryo surrounded by a single layer of protective cells. It contains very little food reserves and depends upon a symbiot"
    },
    {
        "Id": 3191,
        "Name": "Periwinkle (Vinca)",
        "Scientific name": "Catharanthus roseus",
        "Binomial": "CARO",
        "Plant Type": "Perennial",
        "Height": 24,
        "Spread": 24,
        "Root Depth": 27,
        "Seasonal Interest": "Spring-Fall",
        "Notes": "Needs well-drained soils, tolerates low fertility. Thrives in heat and humidity. Able to self-pollinate. Flowers and fruits year round in warm enough climates. Sometimes has sprawling habit. Somewhat woody stems as a perennial.",
        "Flower Color": "Pink, Purple, White",
        "Root Type": "Tap",
        "Bloom Time": "Spring - Fall",
        "Fruit Time": "",
        "Texture": "Medium",
        "Form": "Upright",
        "Growth Rate": "Fast",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "8 -- 11",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "5.5 - 6.2",
        "Ecological Function": "Groundcover, Insectory",
        "Human Use/Crop\r": "Container Garden, Cut Flower, Hanging Basket, Medicine, Ornamental\"\r\n1731,Common Periwinkle,Vinca minor,VIMI,Perennial,6,30,8,Spring,Deer resistant. Vinca blight can be prevented by an early spring mowing and removal of all debris. Foliage is evergreen. Tolerates a wide range of soils. Not dependably hardy in zone 4 and up unless winter mulch is applied or if growing in ideal condi,Blue,Corm,Late Spring - Early Summer,,Fine,Prostrate,Fast,Minor,Minor,\"Partial_Shade, Shade"
    },
    {
        "Id": 7424,
        "Name": "California Phacelia (Rock Phacelia)",
        "Scientific name": "Phacelia californica",
        "Binomial": "PHCA",
        "Plant Type": "Perennial",
        "Height": 24,
        "Spread": 24,
        "Root Depth": 5,
        "Seasonal Interest": "Spring-Summer",
        "Notes": "Also called California scorpion weed. Prefers well-draining soils.",
        "Flower Color": "Lavender, White",
        "Root Type": "Fibrous Shallow",
        "Bloom Time": "Spring - Early Fall",
        "Fruit Time": "Summer - Fall",
        "Texture": "Medium",
        "Form": "Rosette",
        "Growth Rate": "Fast",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun",
        "Hardiness Zone": "8 -- 10",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "5.2 - 7.1",
        "Ecological Function": "Insectory",
        "Human Use/Crop\r": "Container Garden, Medicine, Ornamental\"\r\n2902,Xanadu Philodendron (Winterbourn Philodendron),Philodendron xanadu,PHXA,Perennial,48,72,12,All Year,\"Choose a well-drained area for this moderately drought-tolerant plant. Plant with a combination of top soil or organic peat moss mixed with composted cow manure added to the hole. You'll rarely have to trim a Xanadu - its clumping growth pattern forms an attractive cushion shape all by itself. Water regularly but be sure to allow the plant time to dry out between waterings. Too much water can kill any philodendron plant. Fertilize 3 times a year - spring, summer and fall - with a quality granular fertilizer. Susceptible to aphids, mealy bugs, scale, thrips, and spider mites. 'Winterbourn' is a hybrid philodendron selection that features a dark red spathe and a dense, compact, spreading to mounding habit. This cultivar was grown from seed collected from a specimen of Philodendron bipinnatifidum, but its exact parentage is not known. The glossy, deeply lobed leaves are held on long petioles and can reach up to 12\" long and 7\" wide. The foliage emerges from a stout, typically unbranched stem. The 4.5\" tall, arum-type inflorescence has a dark red spathe surrounding a creamy white spadix. Blooming is rare when plants are kept indoors and occurs seasonally if grown outdoors."
    },
    {
        "Id": 2927,
        "Name": "Pigeon Pea (Red Gram, Congo Pea, Arhar, Gunga Pea)",
        "Scientific name": "Cajanus cajan",
        "Binomial": "CACA",
        "Plant Type": "Perennial",
        "Height": 13,
        "Spread": 8,
        "Root Depth": 79,
        "Seasonal Interest": "Spring-Summer",
        "Notes": "Grown often as an annual or short-lived perennial. Time of flowering varies based on when they are planted. Cultivars vary in pest and disease resistance. Important intercropping species. Propagation: Seed - sow in situ during the wet season, placing the seed 2 - 3 cm deep in the soil. Two seeds are often planted per station, thinning to the best plant. The seeds germinate at temperatures of 19 - 43°c, but most rapidly at 20 - 30°c. Emergence is complete 2 - 3 weeks after sowing. Vegetative development starts slowly, but after 2 - 3 months growth accelerates.",
        "Flower Color": "Red, Yellow",
        "Root Type": "Tap",
        "Bloom Time": "Spring - Early Fall",
        "Fruit Time": "Summer - Fall",
        "Texture": "Coarse",
        "Form": "Upright",
        "Growth Rate": "Fast",
        "Insect Predation": "Major",
        "Disease": "Major",
        "Light": "Full_Sun",
        "Hardiness Zone": "9 -- 11",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "5.5 - 6.5",
        "Ecological Function": "Domestic Animal Forage, Dynamic Accumulator, Erosion Control, Hedge, Insectory, Nitrogen Fixer, Soil Builder, Soil Cultivator, Windbreak",
        "Human Use/Crop\r": "Biomass, Coppice, Essential Oil, Fiber, Fiber, Food, Food, Medicine, Medicine, Oil, Wax, Resin or Polish, Wood, Wood\"\r\n5686,Pigface (Ice Plant),Carpobrotus glaucescens,CAGL,Perennial,72,36,6,All Year,\"Carpobrotus glaucescens is a prostrate, creeping succulent that has long trailing stems to 2 m long, which root at nodes along the stems. From these nodes the plant produces upright leafy branches. It has thick, fleshy, smooth leaves 3.5-10 cm x 1-1.5 cm, which are triangular in cross section. Do not plant in areas where people will be walking as it will not survive."
    },
    {
        "Id": 8244,
        "Name": "Celandine Poppy (Wood Poppy)",
        "Scientific name": "Stylophorum diphyllum",
        "Binomial": "STDI",
        "Plant Type": "Perennial",
        "Height": 18,
        "Spread": 12,
        "Root Depth": 3,
        "Seasonal Interest": "Spring-Fall",
        "Notes": "The bright yellow flowers of Stylophorum diphyllum, commonly called celandine poppy or wood poppy, make a splash in spring and early summer. This herbaceous perennial in the poppy family (Papaveraceae) is native to moist woodlands of eastern North America, from zone 4 to 9. It is found in low-elevation deciduous forests from Ontario, Canada and Pennsylvania south to Kentucky, north Alabama and Georgia and west to Michigan and Missouri, typically in open woods at the base of bluffs, along streams, and in ravine bottoms with rich soils. It is one of the plants that is adversely affected by invasive garlic mustard (Alliaria petiolata) and habitat destruction, and is considered threatened or endangered in many areas. This showy, relatively long-lived wildflower adapts easily to the flower garden so it is often grown as an ornamental in beds as well as in naturalistic plantings. If plants are deadheaded they will bloom intermittently throughout the summer, especially if kept watered. Cut off the flower stems after the blooms fade to encourage the plants to send up more flowers. The plants need moist humus-rich soils in partial to full shade. They will go dormant in summer if allowed to.",
        "Flower Color": "Yellow",
        "Root Type": "Fibrous Shallow",
        "Bloom Time": "",
        "Fruit Time": "",
        "Texture": "Medium",
        "Form": "Spreading",
        "Growth Rate": "Fast",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Partial_Shade, Shade",
        "Hardiness Zone": "4 -- 10",
        "Soil Moisture": "Wet, Moderate",
        "Soil pH": "6.0 - 8.0",
        "Ecological Function": "Insectory, Insectory, Wildlife Food",
        "Human Use/Crop\r": "Dye, Ornamental\"\r\n1832,Iceland Poppy,Papaver nudicaule,PANU,Perennial,24,24,0,Summer,Drought will restrict flowering. Often fragrant. Toxic to livestock. Good edging plant. Will bloom much of the summer if deadheaded. Plant in a permanent location because of its poor transplantibility. Re-seeds itself.,\"Pink, Purple, Red, White, Yellow"
    },
    {
        "Id": 6310,
        "Name": "Plains Prickly Pear",
        "Scientific name": "Opuntia polyacantha",
        "Binomial": "OPPO",
        "Plant Type": "Perennial",
        "Height": 16,
        "Spread": 48,
        "Root Depth": 12,
        "Seasonal Interest": "All Year",
        "Notes": "Easily propagated with cuttings. Forms large colonies by spreading via sprouting segments. Roots can extend up to 6 ft (2m) laterally.",
        "Flower Color": "Pink, Yellow",
        "Root Type": "Fibrous Shallow, Short Rhizome",
        "Bloom Time": "Late Spring - Early Summer",
        "Fruit Time": "Summer - Fall",
        "Texture": "Coarse",
        "Form": "Prostrate",
        "Growth Rate": "Fast",
        "Insect Predation": "Medium",
        "Disease": "Minor",
        "Light": "Full_Sun",
        "Hardiness Zone": "4 -- 10",
        "Soil Moisture": "Dry",
        "Soil pH": "7.0 - 8.8",
        "Ecological Function": "Domestic Animal Forage, Insectory, Nurse, Soil Builder, Wildlife Food, Wildlife Habitat",
        "Human Use/Crop\r": "Dye, Fiber, Food, Food, Medicine, Ornamental\"\r\n6487,Common Primrose (English primrose),Primula vulgaris,PRVU,Perennial,6,9,6,Spring-Summer,\"Primula vulgaris, (Primula acaulis), is an evergreen or semi-evergreen, rosette-forming perennial with obovate, serrated to scalloped, prominently veined leaves with hairy undersides, to 10 inches long. Native to Europe & West Turkey. Western & southern Europe. HABITAT: Along streams or ponds & tolerate some wet soils. Dappled Sunlight. PROPAGATION: low maintenance, seed start, by division in spring after bloom. The genus name Primula means \"little earliest one\" and is the feminine diminutive of the Latin primus. Specific epithet means common. PROBLEMS: Slugs, snails, aphids and red spider mites. Primroses represent eternal love. In Irish folklore, primroses in the doorway protected the home from fairies. Primroses also appear as a charge in heraldry, for example the coat of arms of the Earl of Rosebery. Primroses were traditionally used to dress corpses and for throwing onto graves. Italy chose a fuchsia primrose as the symbol of its 2020 COVID-19 vaccination campaign. The primrose is on one side of Austria's 5 euro cent coin. The flowers are hermaphrodite but heterostylous; individual plants bear either pin flowers (longuistylous flower: with the capita of the style prominent) or"
    },
    {
        "Id": 3037,
        "Name": "Sissoo Spinach",
        "Scientific name": "Alternanthera sissoo",
        "Binomial": "ALSI",
        "Plant Type": "Perennial",
        "Height": 15,
        "Spread": 30,
        "Root Depth": 0,
        "Seasonal Interest": "All Year",
        "Notes": "Does not set viable seed. Prefers organically rich and well-drained soil. Can be grown as a houseplant/annual in cooler climates. Spreads with root nodes.",
        "Flower Color": "White",
        "Root Type": "",
        "Bloom Time": "",
        "Fruit Time": "",
        "Texture": "Coarse",
        "Form": "Matlike",
        "Growth Rate": "Fast",
        "Insect Predation": "Medium",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade, Shade",
        "Hardiness Zone": "10 -- 11",
        "Soil Moisture": "Wet, Moderate",
        "Soil pH": "4.5 - 8.0",
        "Ecological Function": "Groundcover, Hedge, Mulch Maker",
        "Human Use/Crop\r": "Food\r"
    },
    {
        "Id": 3786,
        "Name": "Rush Skeletonweed (Hogbite)",
        "Scientific name": "Chondrilla juncea",
        "Binomial": "CHJU",
        "Plant Type": "Perennial",
        "Height": 60,
        "Spread": 18,
        "Root Depth": 16,
        "Seasonal Interest": "Spring-Fall",
        "Notes": "Chondrilla juncea plants produce long tap roots that grow adventitious root buds after being damaged, and each one of these buds can form a new plant. Rush skeletonweed has a slender, simple taproot, that can reach over 6.5 feet (2 m) deep and branch at depth into C-horizon soil and fissures in bedrock. This root system provides rush skeletonweed with access to a large volume of soil and to potentially large reserves of soil-stored water. C. juncea can establish vegetatively by adventitious buds on both vertical and lateral roots and new shoots can also form from tiny fragments of root C. juncea favours disturbed land such as those weakened by drought, overgrazing, cultivation and wildfires. As such it is found on wasteland and in fallow and abandoned fields, along disturbed roadsides and eroded ground. It also grows well along riverbanks and dry river beds and sand dunes. C. juncea prefers coarse-textured, well-drained soils such as sand dunes and granite outcrops but can be found on a wide range of soil types except heavy clay soils. In its native range it grows on calcareous or mildly acid soils . It can also grow on croplands, semi-arid pastures and rangelands. Individual flo",
        "Flower Color": "Yellow",
        "Root Type": "Tap, Rhizome",
        "Bloom Time": "Early Summer - Fall",
        "Fruit Time": "Summer - Fall",
        "Texture": "Medium",
        "Form": "Rosette",
        "Growth Rate": "Fast",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun",
        "Hardiness Zone": "4 -- 12",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "4.5 - 8.0",
        "Ecological Function": "Domestic Animal Forage, Insectory, Insectory, Insectory, Wildlife Food",
        "Human Use/Crop\r": "Food, Oil, Wax, Resin or Polish\"\r\n6626,Virginian Skullcap,Scutellaria lateriflora,SCLA,Perennial,36,30,6,Spring-Fall,\"Common name of skullcap is in reference to the cap-like shape of the flowers and seed capsules which purportedly resemble the military helmets worn by men in the Middle Ages. At one time, there was a belief that Mad-Dog Skullcap could cure rabies, which is false. Propagation Seed - sow in situ outdoors in late spring. If there is only a small quantity of seed it is better to sow it in a pot in a cold frame in early spring. When they are large enough to handle, prick the seedlings out into individual pots and plant them out in the spring. Division in spring just before new growth begins. Very easy, larger divisions can be planted out direct into their permanent positions. We have found it best to pot up the smaller divisions and grow them on in a lightly shaded position in a cold frame, planting them out once they are well established in the summer. Basal cuttings in early summer in a frame. Very easy. Harvest the shoots with plenty of underground stem when they are about 8 - 10cm above the ground. Pot them up into individual pots and keep them in light shade in a cold frame or greenhouse until they are rooting well. Plant them out in the summer."
    },
    {
        "Id": 1817,
        "Name": "Snow In Summer",
        "Scientific name": "Cerastium tomentosum",
        "Binomial": "CETO",
        "Plant Type": "Perennial",
        "Height": 6,
        "Spread": 30,
        "Root Depth": 0,
        "Seasonal Interest": "Spring",
        "Notes": "Minor disease concern- root rot. Tolerates low fertility soils if well drained. Root prune to encourage new growth. Useful in rock gardens and banks. Gray foliage color is actually a silver color.",
        "Flower Color": "White",
        "Root Type": "Fibrous Shallow",
        "Bloom Time": "Late Spring - Early Summer",
        "Fruit Time": "",
        "Texture": "Fine",
        "Form": "Spreading",
        "Growth Rate": "Fast",
        "Insect Predation": "",
        "Disease": "Minor",
        "Light": "Full_Sun",
        "Hardiness Zone": "3 -- 7",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "5.6 - 8.5",
        "Ecological Function": "Erosion Control, Nurse, Soil Builder",
        "Human Use/Crop\r": "\r"
    },
    {
        "Id": 2026,
        "Name": "Spearmint",
        "Scientific name": "Mentha spicata",
        "Binomial": "MESP",
        "Plant Type": "Perennial",
        "Height": 18,
        "Spread": 48,
        "Root Depth": 4,
        "Seasonal Interest": "Summer",
        "Notes": "Hybridizes freely with other members of this genus.Seed - sow spring in a cold frame. Germination is usually fairly quick. Prick out the seedlings into individual pots when they are large enough to handle and plant them out in the summer. Mentha species are very prone to hybridisation and so the seed cannot be relied on to breed true. Even without hybridisation, seedlings will not be uniform and so the content of medicinal oils etc will vary. When growing plants with a particular aroma it is best to propagate them by division. Division can be easily carried out at almost any time of the year, though it is probably best done in the spring or autumn to allow the plant to establish more quickly. Virtually any part of the root is capable of growing into a new plant. Larger divisions can be planted out direct into their permanent positions. However, for maximum increase it is possible to divide the roots up into sections no more than 3cm long and pot these up in light shade in a cold frame. They will quickly become established and can be planted out in the summer. In aquatic sites, the plant does well in sand, clay and wet soil along edges of creeks, drains and swamps.",
        "Flower Color": "Purple, White",
        "Root Type": "Rhizome",
        "Bloom Time": "Late Spring - Early Fall",
        "Fruit Time": "Summer - Fall",
        "Texture": "Medium",
        "Form": "Spreading",
        "Growth Rate": "Fast",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "4 -- 9",
        "Soil Moisture": "Wet, Moderate",
        "Soil pH": "5.6 - 7.5",
        "Ecological Function": "Aromatic Pest Confuser, Aromatic Pest Confuser, Fungicide, Groundcover, Insecticide, Insectory, Insectory, Reclamator",
        "Human Use/Crop\r": "Container Garden, Essential Oil, Food, Food, Medicine, Medicine\"\r\n3233,Spider Plant,Chlorophytum comosum,CHCO,Perennial,36,36,4,All Year,Flowers throughout the year. Grow in well-drained soil. Plantlets are formed on flowering nodes and can be easily rooted for propagation. Grown as an annual in colder climates. Root hardy in zone 8 & 9.,White,\"Tuber, Rhizome"
    },
    {
        "Id": 8141,
        "Name": "Longevity Spinach (Sabuñgai)",
        "Scientific name": "Gynura procumbens",
        "Binomial": "GYPR",
        "Plant Type": "Perennial",
        "Height": 120,
        "Spread": 24,
        "Root Depth": 12,
        "Seasonal Interest": "Spring-Fall",
        "Notes": "Gynura procumbens is a vigorous, herbaceous, perennial plant producing stems that scramble over the ground or twine into other plants for support. This plant grows easily from stem cuttings. Seeds are not available. It is best grown in well-draining, fertile soil that is kept moist at all times. Semi-shade is preferred by this plant although it can be slowly adapted to grow in full sun, provided the plant does not dry out at the roots. Initial planting under direct sunshine will result in burnt leaves and stunting in growth. Can be grown as an annual.",
        "Flower Color": "Yellow",
        "Root Type": "Fibrous Shallow",
        "Bloom Time": "Spring",
        "Fruit Time": "Summer - Fall",
        "Texture": "Coarse",
        "Form": "Upright",
        "Growth Rate": "Fast",
        "Insect Predation": "Medium",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "9 -- 11",
        "Soil Moisture": "Wet",
        "Soil pH": "5.6 - 7.8,\"",
        "Ecological Function": " Aromatic Pest Confuser",
        "Human Use/Crop\r": " Insectory\""
    },
    {
        "Id": 1860,
        "Name": "Northern Starflower",
        "Scientific name": "Trientalis borealis",
        "Binomial": "TRBO",
        "Plant Type": "Perennial",
        "Height": 8,
        "Spread": 8,
        "Root Depth": 6,
        "Seasonal Interest": "Spring-Summer",
        "Notes": "Seed capsule looks like a spider. Their habitat preference is in moist, partially shaded woodland, but they tolerate dry acidic soils. Flowering period varies in different habitats. Forms colonies of identical clones from expanding rhizomatous roots and tubers. Individual plants may appear to have died but beneath the soil surface its all the same clone. Individual plants can be expected to live 3+ years. Dense patches will persist indefinitely and will expand as a self-sustaining colony.",
        "Flower Color": "White",
        "Root Type": "Tuber, Long Rhizome",
        "Bloom Time": "Late Spring - Early Summer",
        "Fruit Time": "Summer - Fall",
        "Texture": "Fine",
        "Form": "Upright",
        "Growth Rate": "Fast",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Partial_Shade, Shade",
        "Hardiness Zone": "3 -- 7",
        "Soil Moisture": "Wet, Moderate",
        "Soil pH": "5.0 - 6.0",
        "Ecological Function": "Insectory, Insectory, Wildlife Food",
        "Human Use/Crop\r": "Medicine\r"
    },
    {
        "Id": 2073,
        "Name": "Strawberry",
        "Scientific name": "Fragaria x ananassa",
        "Binomial": "FRx",
        "Plant Type": "Perennial",
        "Height": 12,
        "Spread": 18,
        "Root Depth": 12,
        "Seasonal Interest": "Spring-Summer",
        "Notes": "White or pink flower; red berry. Fragaria × ananassa is a hybrid species derived in cultivation from Fragaria chiloensis A.N. Duchesne (Beach Strawberry) × Fragaria virginiana. Two main types of cultivars are recognized based on environmental control of flowering: 1. Short-day or June bearing. These require photoperiods under 14 hr and/or temperatures under 60°F for floral initiation. As the name suggests, these plants generally bear fruit in the spring only, unless grown in areas with cool summer temperatures such as coastal California. 2. Everbearing strawberry plants. These cultivars fruit throughout the growing season provided temperatures are not too high. There are two types of everbearers: A. Long-day. Lengthening days promote more-or-less continuous flowering throughout the summer, provided temperature is not too high. B. Day-neutrals. Photoperiod has no effect on flowering. Also will flower several times per year, but would do so in short as well as long days.",
        "Flower Color": "Pink, White",
        "Root Type": "Stolon",
        "Bloom Time": "Late Spring",
        "Fruit Time": "Spring - Summer",
        "Texture": "Medium",
        "Form": "Spreading",
        "Growth Rate": "Fast",
        "Insect Predation": "Medium",
        "Disease": "Medium",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "4 -- 9",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "5.8 - 7.0",
        "Ecological Function": "Dynamic Accumulator, Groundcover, Insectory, Wildlife Food",
        "Human Use/Crop\r": "Container Garden, Food, Hanging Basket, Ornamental\"\r\n2263,Alpine Strawberry,Fragaria vesca ssp. vesca,FRVE,Perennial,12,12,8,,,White,Fibrous Shallow,Spring - Summer,,Medium,Mound,Fast,Minor,Minor,\"Full_Sun, Partial_Shade, Shade"
    },
    {
        "Id": 5941,
        "Name": "Virginia Strawberry (Common Strawberry)",
        "Scientific name": "Fragaria virginiana",
        "Binomial": "FRVI",
        "Plant Type": "Perennial",
        "Height": 7,
        "Spread": 6,
        "Root Depth": 3,
        "Seasonal Interest": "Spring-Summer",
        "Notes": "Also called wild strawberry and woodland strawberry. Dividing patches every 3-4 years can help improve vigor and increase fruiting. More resistant to foliar diseases than most cultivated strawberries. Prefers full sun; able to tolerate more shade later in the year. Prefers dry-mesic conditions.",
        "Flower Color": "White",
        "Root Type": "Fibrous Shallow, Stolon",
        "Bloom Time": "Spring - Early Summer",
        "Fruit Time": "Summer",
        "Texture": "Medium",
        "Form": "Spreading",
        "Growth Rate": "Fast",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "3 -- 8",
        "Soil Moisture": "Wet, Moderate, Dry",
        "Soil pH": "5.5 - 7.0",
        "Ecological Function": "Domestic Animal Forage, Groundcover, Insectory, Wildlife Food, Wildlife Habitat",
        "Human Use/Crop\r": "Container Garden, Food, Medicine, Ornamental, Soap\"\r\n2566,Sunchoke (Jerusalem Artichoke),Helianthus tuberosus,HETU,Perennial,120,36,12,Summer,\"Sunchoke is a native perennial sunflower. Improved varieties produce tremendous amounts of sweet, crisp tubers. H. tuberosus is widely distributed in central and eastern North America. Swanton et al. (1992) suggest it originated in the Great Lakes area (citing Simmonds, 1976) or in the Ohio and Mississippi River valleys, citing Cockerell (1918), cited in Wyse et al. (19860. Due to early human use dating back to pre-Columbian times, the original distribution can no longer be reconstructed with any accuracy. Today, it is cultivated and escaping, often invasive, in many temperate areas in Europe, Asia, Australia, New Zealand, and tropical South America.Normally, fruits (seeds) are rarely formed. Under reduced light intensity or cold conditions, no flower heads may appear."
    },
    {
        "Id": 1887,
        "Name": "Stiff Sunflower",
        "Scientific name": "Helianthus pauciflorus",
        "Binomial": "HEPA",
        "Plant Type": "Perennial",
        "Height": 48,
        "Spread": 18,
        "Root Depth": 60,
        "Seasonal Interest": "Summer",
        "Notes": "Used to be known as Helianthus lactiflorus.",
        "Flower Color": "Yellow",
        "Root Type": "Fibrous Shallow",
        "Bloom Time": "Summer - Late Summer",
        "Fruit Time": "",
        "Texture": "Medium",
        "Form": "Upright",
        "Growth Rate": "Fast",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun",
        "Hardiness Zone": "2 -- 8",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "6.0 - 8.0",
        "Ecological Function": "Insectory, Nurse, Wildlife Food, Wildlife Food",
        "Human Use/Crop\r": "Cut Flower\r"
    },
    {
        "Id": 2143,
        "Name": "American Sweet Flag",
        "Scientific name": "Acorus calamus var. americanus",
        "Binomial": "ACCA",
        "Plant Type": "Perennial",
        "Height": 36,
        "Spread": 36,
        "Root Depth": 10,
        "Seasonal Interest": "Spring",
        "Notes": "Foliage evergreen and variegated; may be invasive or noxious. The fresh root can be poisonous.",
        "Flower Color": "Green",
        "Root Type": "Rhizome, Short Rhizome",
        "Bloom Time": "Late Spring - Summer",
        "Fruit Time": "",
        "Texture": "Medium",
        "Form": "Upright",
        "Growth Rate": "Fast",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Shade",
        "Hardiness Zone": "4 -- 9",
        "Soil Moisture": "Wet, Moderate",
        "Soil pH": "5.5 - 7.5",
        "Ecological Function": "Insecticide, Nurse, Water Purifier, Wildlife Food, Wildlife Food, Wildlife Habitat",
        "Human Use/Crop\r": "Aromatics/Fragrance, Food, Insect Repellent, Medicine, Ornamental\"\r\n2921,Sweet Potato,Ipomoea batatas,IPBA,Perennial,12,120,8,All Year,\"Rarely flowers. Often grown as an annual. Best in medium well-drained soil. Derived in cultivation, probably from Ipomoea trifida, this species is not known in a truly wild situation. A short-day plant, it requires less than 11 hours of sunlight per day to initiate flowering. Propagation: Pre-soak the seed for 12 hours in warm water, or scarify the seed, and sow in individual pots in a greenhouse in early spring. The seed usually germinates in 1 - 3 weeks at 22°c. Plants are extremely resentful of root disturbance, even when they are quite small, and should be potted up almost as soon as they germinate. Grow them on in the greenhouse for at least their first winter then plant them out into their permanent positions in late spring or early summer, after the last expected frosts. Seedlings can be very variable and are likely to be less productive than vegetatively produced plants. Stem cuttings obtained from terminal shoots. Remove the lower leaves and insert the cuttings to half their depth in individual pots."
    },
    {
        "Id": 2574,
        "Name": "Prairie Turnip (Timpsila, Indian breadroot)",
        "Scientific name": "Psoralea esculenta",
        "Binomial": "PSES",
        "Plant Type": "Perennial",
        "Height": 12,
        "Spread": 8,
        "Root Depth": 4,
        "Seasonal Interest": "Summer",
        "Notes": "Plant is very intolerant of root disturbance. Timpsila produces a spindle-shaped tuber about four inches below the ground. This tuber, although nutritionally similar to a potato, differs in taste and texture due to different types of sugars and starches. The white edible portion is exposed by removing a coarse brown husk. If the thin portion of the root is left attached, the tubers can be woven together into an arm-length bundle for easy drying and transport. When air dried, the tubers can be stored indefinitely. Timpsila has been a source of food and commerce on the Great Plains for centuries. The tuber can be eaten raw, cut into chunks and boiled in stews, or ground into a fine flour. The flour can then be used to thicken soups, or made into a porridge flavored with wild berries. Mixed with berries, water and some tallow, the flour can be made into cakes, which when dried, make a durable and nutritious trail food. It flowers in May and June and ripens in June and July. It’s important to know when the plant ripens because, if collected too early, the roots are limp and depleted from initiating spring growth; look too late, and the above-ground plant will be gone because it breaks",
        "Flower Color": "Purple",
        "Root Type": "Tuber, Fibrous Shallow",
        "Bloom Time": "Late Spring - Summer",
        "Fruit Time": "Summer",
        "Texture": "Medium",
        "Form": "Mound",
        "Growth Rate": "Fast",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun",
        "Hardiness Zone": "3 -- 7",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "5.0 - 7.0",
        "Ecological Function": "Nitrogen Fixer, Wildlife Food",
        "Human Use/Crop\r": "Food, Medicine, Medicine\"\r\n7599,\"Turtle Back, Elephant's Foot, Hottentots' Bread"
    },
    {
        "Id": 2065,
        "Name": "Violet",
        "Scientific name": "Viola odorata",
        "Binomial": "VIOD",
        "Plant Type": "Perennial",
        "Height": 12,
        "Spread": 18,
        "Root Depth": 4,
        "Seasonal Interest": "Summer",
        "Notes": "The flowers are generally deep purple, giving their name to the colour that is called after them, but lilac, pale rose-coloured or white variations are also frequent, and all these tints may sometimes be discovered in different plants growing on the same plant. The flowers are full of honey and are constructed for bee visitors, but bloom before it is really bee time, so that it is rare that a Violet flower is found setting seed. There is indeed a remarkable botanical curiosity in the structure of the Violet: it produces flowers both in the spring and in autumn, but the flowers are different. In spring they are fully formed, as described, and sweet-scented, but they are mostly barren and produce no seed, while in autumn, they are very small and insignificant, hidden away amongst the leaves, with no petals and no scent, and produce abundance of seed. The Violet propagates itself, also, in another way by throwing out scions, or runners, from the main plant each summer after flowering, and these in turn send out roots and become new plants, a process that renders it independent of seed. The plant is conventionally propagated through the divisions of rhizomatous disc, but for large sca",
        "Flower Color": "Blue, Purple, White",
        "Root Type": "Long Rhizome",
        "Bloom Time": "Late Spring - Early Fall",
        "Fruit Time": "Spring - Summer",
        "Texture": "Medium",
        "Form": "Rosette",
        "Growth Rate": "Fast",
        "Insect Predation": "Minor",
        "Disease": "Medium",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "4 -- 9",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "6.6 - 7.5",
        "Ecological Function": "Groundcover, Insectory, Insectory",
        "Human Use/Crop\r": "Aromatics/Fragrance, Aromatics/Fragrance, Container Garden, Essential Oil, Essential Oil, Food, Insect Repellent, Medicine, Medicine, Medicine, Oil, Wax, Resin or Polish, Ornamental\"\r\n1732,Canada Violet (Canadian White Violet),Viola canadensis,VICA,Perennial,24,18,,Spring,This species spreads slowly and doesn't become weedy.,\"Blue, White"
    },
    {
        "Id": 1670,
        "Name": "White Water Lily",
        "Scientific name": "Nymphaea odorata",
        "Binomial": "NYOD",
        "Plant Type": "Perennial",
        "Height": 6,
        "Spread": 60,
        "Root Depth": 6,
        "Seasonal Interest": "Summer",
        "Notes": "An aquatic plant management (APM) permit from the DNR is required to physically remove from or transplant into public waters any aquatic plants. There are many hybrids that are sold and are not the true native species. It is now illegal to plant hybrids",
        "Flower Color": "White",
        "Root Type": "Fibrous Shallow",
        "Bloom Time": "Early Summer - Early Fall",
        "Fruit Time": "",
        "Texture": "",
        "Form": "Upright",
        "Growth Rate": "Fast",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun",
        "Hardiness Zone": "3 -- 9",
        "Soil Moisture": "Wet",
        "Soil pH": "6.0 - 7.0",
        "Ecological Function": "Erosion Control, Nurse, Soil Builder",
        "Human Use/Crop\r": "Aromatics/Fragrance, Food, Medicine\"\r\n1730,Yellow Water Lily,Nuphar lutea,NULU,Perennial,6,24,,Summer,An aquatic plant management (APM) permit from the DNR is required to physically remove from or transplant into public waters any aquatic plants. There are many hybrids that are sold and are not the true native species. It is now illegal to plant hybrids,Yellow,Fibrous Shallow,Early Summer - Early Fall,,,Spreading,Fast,Minor,Minor,\"Full_Sun, Partial_Shade"
    },
    {
        "Id": 8182,
        "Name": "Railway Weed (Tridax Daisy, Coat Buttons)",
        "Scientific name": "Tridax procumbens",
        "Binomial": "TRPR",
        "Plant Type": "Perennial",
        "Height": 6,
        "Spread": 6,
        "Root Depth": 24,
        "Seasonal Interest": "All Year",
        "Notes": "Tridax procumbens is a semi-prostrate perennial herb forming many lateral branches that ascend 30 to 50 cm high or trail along the ground and root at the nodes. Tridax procumbens is native to Puerto Rico and the U.S. Virgin Islands. It has become naturalized through southern and central Florida, in eight Texas counties; . It is also naturalized in the Midway Islands, the Northern Mariana Islands, Guam, and Wake Island. It is the most common dicotyledonous plant on Wake Island and is considered a weed in its native range in Puerto Rico. Tridax procumbens forms a short-lived seed bank, has developed resistance to glyphosate, and may break at the base during manual weeding, allowing plants to re-sprout. Glyphosate resistant weed. Habitat: disturbed areas, waste areas, roadsides, facultative upland, especially on limestone, adapts to many environments, pioneer species, coarse textured soils; ability to survive dry conditions, less competitive but adaptable to micro habitats (enhances survival in mixed plant community), tolerates mowing, tolerates some shade. Though there are many related weeds in the Compositae (Asteraceae) family, T. procumbens has a distinct appearance making it un",
        "Flower Color": "Brown, Yellow",
        "Root Type": "Tap, Rhizome",
        "Bloom Time": "Early Summer - Fall",
        "Fruit Time": "Fall - Winter",
        "Texture": "Medium",
        "Form": "Prostrate",
        "Growth Rate": "Fast",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "11 -- 13",
        "Soil Moisture": "Wet, Moderate, Dry",
        "Soil pH": "5.5 - 8.0",
        "Ecological Function": "Domestic Animal Forage, Insecticide, Insecticide, Insectory",
        "Human Use/Crop\r": ""
    },
    {
        "Id": 7600,
        "Name": "Ebutsini Wild Yam, Strydom's Wild Yam",
        "Scientific name": "Dioscorea sylvatica",
        "Binomial": "DISY",
        "Plant Type": "Perennial",
        "Height": 180,
        "Spread": 18,
        "Root Depth": 12,
        "Seasonal Interest": "All Year",
        "Notes": "aka Forest Elephant's Foot. This plant was nearly harvested to extinction for the commercial extraction of diosgenin, a compound used in the manufacture of cortisone.",
        "Flower Color": "Cream, White",
        "Root Type": "Tuber, Tuber",
        "Bloom Time": "Late Fall - Winter",
        "Fruit Time": "Spring - Summer",
        "Texture": "Medium",
        "Form": "Vine",
        "Growth Rate": "Fast",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Partial_Shade, Shade",
        "Hardiness Zone": "10 -- 12",
        "Soil Moisture": "Moderate",
        "Soil pH": "6.0 - 7.5",
        "Ecological Function": "",
        "Human Use/Crop\r": "Medicine, Ornamental\"\r\n3085,\"Winged Bean (Goa Bean, Dau Rong)"
    },
    {
        "Id": 1818,
        "Name": "Yarrow Hybrids",
        "Scientific name": "Achillea millefolium Hybrids",
        "Binomial": "ACMI",
        "Plant Type": "Perennial",
        "Height": 36,
        "Spread": 24,
        "Root Depth": 8,
        "Seasonal Interest": "Summer",
        "Notes": "Good dried flower. Powdery mildew can be a concern. Minor risk of toxicity - skin irritation lasting only a few minutes. Many cultivars exist, the following is a list of a few of the most popular. CULTIVARS: \"Cerise Queen\" (Red), \"Summer Pastels\" (w",
        "Flower Color": "Orange, Pink, Purple, Red, Rust, White, Yellow",
        "Root Type": "Fibrous Deep",
        "Bloom Time": "Early Summer - Late Summer",
        "Fruit Time": "",
        "Texture": "Fine",
        "Form": "Upright",
        "Growth Rate": "Fast",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun",
        "Hardiness Zone": "4 -- 8",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "6.0 - 8.0",
        "Ecological Function": "Erosion Control, Nurse, Soil Builder",
        "Human Use/Crop\r": "Essential Oil, Food, Medicine\"\r\n1724,\"Common Yarrow (Bloodwort, Western Yarrow)"
    },
    {
        "Id": 2444,
        "Name": "Agrimony",
        "Scientific name": "Agrimonia eupatoria",
        "Binomial": "AGEU",
        "Plant Type": "Perennial",
        "Height": 48,
        "Spread": 36,
        "Root Depth": 6,
        "Seasonal Interest": "Spring-Summer",
        "Notes": "Flowers June to August. Bears bright yellow petalled flowers.",
        "Flower Color": "",
        "Root Type": "",
        "Bloom Time": "Early Summer - Late Summer",
        "Fruit Time": "",
        "Texture": "Medium",
        "Form": "Single Stem",
        "Growth Rate": "Moderate",
        "Insect Predation": "",
        "Disease": "",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "5 -- 9",
        "Soil Moisture": "Moderate",
        "Soil pH": "4.5 - 7.0",
        "Ecological Function": "Wildlife Food",
        "Human Use/Crop\r": "Aromatics/Fragrance, Dried Flower, Dye, Medicine\"\r\n5919,Hemp Agrimony,Eupatorium cannabinum,EUCA,Perennial,60,60,0,Spring-Fall,\"E. cannabinum has numerous common names. The flowers are hermaphrodite and self-fertile. Prefers rich, moist soils and can grow well in marshy soils. Can spread quickly. The stems are woody at the base."
    },
    {
        "Id": 8242,
        "Name": "Heath Aster (Wreath Aster, White Prairie Aster)",
        "Scientific name": "Symphyotrichum ericoides",
        "Binomial": "SYER",
        "Plant Type": "Perennial",
        "Height": 36,
        "Spread": 18,
        "Root Depth": 4,
        "Seasonal Interest": "Spring-Fall",
        "Notes": "Formerly named Aster ericoides. Easily grown in average, dry to medium, well-drained soil in full sun. Does well in sandy or clay soils. Generally tolerates poor soils and drought. Symphyotrichum ericoides, commonly called heath aster, is a Missouri native plant that typically occurs in open rocky woods, prairies and along roads and railroads. A bushy, somewhat compact plant with many-branched stems which typically grows 1' to 3' tall. Small, daisy-like flowers (1/2\" across) are borne in profusion in spreading, often one-sided, dense sprays (racemes) in late summer to early fall. Ray flowers are usually white, but infrequently blue or pink and center disks are yellow. Distinctive leaves (to 3\" long) are narrow (1/4\" wide), rigid, linear and heath-like (hence the common name). The Heath Aster has a wide distribution, and there is some variability in regards to its size and appearance across different locations. Sometimes it will hybridize with other species of asters, such as Symphyotrichum novae-angliae. The Heath Aster differs from other asters with small white flowerheads primarily by its short, narrow leaves (never more than 3\" long and ¼\" across). Also, its flowerheads tend to",
        "Flower Color": "White, Yellow",
        "Root Type": "Rhizome",
        "Bloom Time": "Late Summer - Fall",
        "Fruit Time": "Fall",
        "Texture": "Medium",
        "Form": "Spreading",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "3 -- 11",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "6.0 - 8.0",
        "Ecological Function": "Domestic Animal Forage, Insectory, Wildlife Food",
        "Human Use/Crop\r": "Cut Flower\r"
    },
    {
        "Id": 1769,
        "Name": "Aster Hybrids",
        "Scientific name": "Aster.",
        "Binomial": "ASx",
        "Plant Type": "Perennial",
        "Height": 48,
        "Spread": 30,
        "Root Depth": 15,
        "Seasonal Interest": "Summer",
        "Notes": "CULTIVARS: \"Alpine\" ( 8-12\"height, zone 3, Pink, Blue, Lavender flwr.), \"Alma Potschke\" (3-4' height, zone 4, rose bloom), \"Proffessor Anton Kippenburg\" (9-18\" height, zone 4, lavender fall bloom), \"Snow Flurry\" (18\" height, Zone 4, White fall bloom),\"Al",
        "Flower Color": "Blue, Pink, Purple, Red, White",
        "Root Type": "Fibrous Shallow",
        "Bloom Time": "Late Summer - Fall",
        "Fruit Time": "",
        "Texture": "Fine",
        "Form": "Upright",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun",
        "Hardiness Zone": "3 -- 8",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "6.0 - 7.5",
        "Ecological Function": "Erosion Control, Soil Builder",
        "Human Use/Crop\r": "Cut Flower\r"
    },
    {
        "Id": 1849,
        "Name": "Large Leaved Aster (Big Leaf Aster)",
        "Scientific name": "Eurybia macrophylla",
        "Binomial": "EUMA",
        "Plant Type": "Perennial",
        "Height": 48,
        "Spread": 48,
        "Root Depth": 10,
        "Seasonal Interest": "Fall",
        "Notes": "Eurybia macrophylla, commonly called large-leaved aster or big-leaved aster, is noted for its large basal leaves (4-8” wide). It is sometimes planted in wooded areas more for its foliage effect than for its fall flowering which is sometimes sparse. This is a rhizomatous perennial that grows 2-4’ tall. It is native to woods and clearings from Nova Scotia to Minnesota south to Illinois, Ohio and North Carolina. Heart-shaped, rough, sharply-toothed, basal leaves are 4-8” wide. Ovate, stalkless upper leaves are much smaller. Stems are often purplish. Flat-topped clusters of flowers with violet to pale blue (rarely white) rays and yellow centers bloom on sticky, glandular flower stalks in August and September. Best grown in moist, well-drained, sandy loams in part shade. This is a woodland species that will grow in shade, but best flowering and growth is in part shade. Best grown in moist, well-drained, sandy loams in part shade. This is a woodland species that will grow in shade, but best flowering and growth is in part shade. Spreads by rhizomes and self-seeding to form colonies in optimum growing conditions. The root system is fibrous and long-rhizomatous; on older plants, a small ca",
        "Flower Color": "Blue, Pink, White, Yellow",
        "Root Type": "Fibrous Shallow, Long Rhizome",
        "Bloom Time": "Late Summer - Early Fall",
        "Fruit Time": "Fall",
        "Texture": "Coarse",
        "Form": "Upright",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Partial_Shade, Shade",
        "Hardiness Zone": "3 -- 7",
        "Soil Moisture": "Moderate",
        "Soil pH": "4.9 - 6.9",
        "Ecological Function": "Domestic Animal Forage, Erosion Control, Groundcover, Groundcover, Insectory, Insectory, Wildlife Food",
        "Human Use/Crop\r": "Fiber, Food, Medicine, Medicine, Ornamental\"\r\n1850,\"New England Aster (Starwort, First Flower)"
    },
    {
        "Id": 1844,
        "Name": "Upland White Aster",
        "Scientific name": "Solidago ptarmicoides",
        "Binomial": "SOPT",
        "Plant Type": "Perennial",
        "Height": 28,
        "Spread": 24,
        "Root Depth": 0,
        "Seasonal Interest": "Summer-Fall",
        "Notes": "Formerly called Aster ptarmicoides Also known as Sneezewart Aster.",
        "Flower Color": "White",
        "Root Type": "Fibrous Shallow",
        "Bloom Time": "Late Summer - Early Fall",
        "Fruit Time": "",
        "Texture": "Medium",
        "Form": "Upright",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun",
        "Hardiness Zone": "3 -- 8",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "6.0 - 8.0",
        "Ecological Function": "Erosion Control",
        "Human Use/Crop\r": "\r"
    },
    {
        "Id": 5979,
        "Name": "Water Avens (Purple Avens)",
        "Scientific name": "Geum rivale",
        "Binomial": "GERI",
        "Plant Type": "Perennial",
        "Height": 24,
        "Spread": 12,
        "Root Depth": 12,
        "Seasonal Interest": "Spring-Summer",
        "Notes": "Best in fertile soils. Native habitat includes swamps, wet meadows and bogs. Can be non-mycorrhizal. Hybridizes with other members of the genus, particularly G. urbanum. Dividing every 3-4 years helps maintain plant vigor. Rare or threatened in some parts of the U.S. Reproduces via seeds and rhizome. Grow in moist to wet soils in full sun to part shade. Prefers moist, fertile soils in cool climates. Needs afternoon shade in hot, humid climates. Tends to struggle with both summer heat and humidity south of Zone 7 where it is not recommended for planting. Likes boggy and swampy conditions. Not always reliably winter hardy in areas north of Zone 5. Plants may be propagated by seed or division. Deadheading spent flowers will encourage additional bloom.",
        "Flower Color": "Purple",
        "Root Type": "Rhizome, Fibrous Shallow",
        "Bloom Time": "Late Spring - Summer",
        "Fruit Time": "Summer - Fall",
        "Texture": "Medium",
        "Form": "Mound",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "3 -- 7",
        "Soil Moisture": "Wet, Moderate",
        "Soil pH": "4.8 - 7.0",
        "Ecological Function": "Groundcover, Insectory, Wildlife Habitat",
        "Human Use/Crop\r": "Aromatics/Fragrance, Food, Food, Insect Repellent, Medicine, Medicine, Medicine\"\r\n5978,White Avens,Geum canadense,GECA,Perennial,30,18,4,Spring-Fall,Spreads vegetatively and self-seeds. Tolerant of juglone. Prefers soils that are rich in organic matter. Hybridizes with easily with other members of the genus. Dividing every 3-4 years helps maintain plant vigor. Seed hooks cling to clothing and animal hair.,White,\"Rhizome, Tap"
    },
    {
        "Id": 1819,
        "Name": "Red Baneberry (Red Cohosh, Necklaceweed)",
        "Scientific name": "Actaea rubra",
        "Binomial": "ACRU",
        "Plant Type": "Perennial",
        "Height": 30,
        "Spread": 36,
        "Root Depth": 3,
        "Seasonal Interest": "Spring",
        "Notes": "Red baneberry is a circumboreal species that inhabits rich, moist forests. Habitats include moist to mesic woodlands, shady stream banks, and shaded areas where some seepage of ground water occurs. The root system consists of a vertical rootstock with fibrous secondary rootlets below. The preference is light to moderate shade, moist to mesic conditions, and a somewhat acidic soil consisting of sandy loam, loam, or clay-loam with decaying organic matter. The soil should contain abundant nitrogen, calcium, and other nutrients. The seeds are slow to germinate, typically taking 2 years or more under natural conditions. This plant prefers cool moist weather and it is winter hardy to at least Zone 4.",
        "Flower Color": "Red, White",
        "Root Type": "Stolon, Fibrous Shallow",
        "Bloom Time": "Late Spring - Summer",
        "Fruit Time": "Summer",
        "Texture": "Medium",
        "Form": "Upright",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Partial_Shade, Shade",
        "Hardiness Zone": "3 -- 7",
        "Soil Moisture": "Moderate",
        "Soil pH": "6.0 - 7.0",
        "Ecological Function": "Erosion Control, Insectory, Reclamator, Wildlife Food, Wildlife Habitat",
        "Human Use/Crop\r": "Aromatics/Fragrance, Medicine, Medicine, Medicine, Medicine, Medicine, Medicine, Medicine, Medicine, Ornamental, Ornamental\"\r\n3036,Holy Basil,Ocimum tenuiflorum,OCTE,Perennial,3,3,8,All Year,\"There are 2 variants of O tenuiflorum. Amrita aka Kapoor, has green leaves with puple highlights and is primarily used for a tea. Rama is purple stemmed with green leaves, sometimes tinted in purple, open form to 4 feet, flowers reddish purple. Highly aromatic plant, testing high in both eugenol and rosmarinic acid. Grown as an annual is cooler climates. Can naturalize in waste places. Prefers nutrient rich soil. Blooms all year. It is an erect, many-branched sub-shrub, 30-60 cm (12-24 in) tall with hairy stems and simple phyllotaxic green or purple leaves that are strongly scented. Leaves have petioles and are ovate, up to 5 cm (2.0 in) long, usually slightly toothed. The flowers are purplish in elongate racemes in close whorls. Despite being distinct species with Ocimum tenuiflorum having six times less DNA than Ocimum gratissimum, they are traditionally used in the same way to treat similar ailments. From Richo Cech at Strictly Medicinals \"Rama Tulsi (Ocimum tenuiflorum = O. sanctum) is a tropical perennial that may be grown as an annual in temperate gardens. The color of the leaves is primarily green, while the color of the stems is primarily purple. This is the most commo"
    },
    {
        "Id": 1735,
        "Name": "Northern Bedstraw",
        "Scientific name": "Galium boreale",
        "Binomial": "GABO",
        "Plant Type": "Perennial",
        "Height": 30,
        "Spread": 18,
        "Root Depth": 6,
        "Seasonal Interest": "Spring",
        "Notes": "White flowers",
        "Flower Color": "White",
        "Root Type": "Bulb",
        "Bloom Time": "Late Spring - Early Summer",
        "Fruit Time": "",
        "Texture": "Fine",
        "Form": "Upright",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "2 -- 8",
        "Soil Moisture": "Moderate",
        "Soil pH": "5.0 - 7.1",
        "Ecological Function": "Erosion Control",
        "Human Use/Crop\r": "Medicine\r"
    },
    {
        "Id": 8741,
        "Name": "Eastern beebalm (Bradbury's beebalm)",
        "Scientific name": "Monarda bradburiana",
        "Binomial": "MOBR",
        "Plant Type": "Perennial",
        "Height": 24,
        "Spread": 36,
        "Root Depth": 8,
        "Seasonal Interest": "Spring-Summer",
        "Notes": "Monarda bradburiana, is a herbaceous perennial plant native to much of the southeastern United States. HABITAT: This species is indigenous to savannas, rocky upland forests, thickets, limestone or sandstone glades, woodland meadows, bluffs, roadsides and abandoned fields. Needs good air circulation & naturalizes well by self-seeding. RANGE: Native to central & southeastern United States in the states of Alabama, Arizona, Iowa, Illinois, Indiana, Kansas, Kentucky, Louisiana, Missouri, Oklahoma, Tennessee, & Texas. PROPAGATION: The seed is a nutlet that can be dispersed by the wind. Vegetative growth from. rhizomes. Hybrids occur in the wild, & they are common in cultivation. Long summer bloom period. Powdery mildew can be a significant problem with the monardas, particularly in crowded gardens with poor air circulation. This species has mildew resistance, however. Rust can also be a problem. They are hermaphroditic, with male and female structures in each flower. There are two stamens. Monarda bradburiana thrives in sun or part shade with well drained soil. Plants tolerate drought and shallow rocky infertile soils.",
        "Flower Color": "Pink, White",
        "Root Type": "Rhizome, Fibrous Shallow",
        "Bloom Time": "Early Spring - Summer",
        "Fruit Time": "Summer - Fall",
        "Texture": "Fine",
        "Form": "Clump",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "5 -- 9",
        "Soil Moisture": "Moderate",
        "Soil pH": "5.1 - 8.0",
        "Ecological Function": "Wildlife Food, Wildlife Habitat, Wildlife Habitat",
        "Human Use/Crop\r": "Cut Flower, Essential Oil, Food, Food, Medicine, Medicine, Ornamental\"\r\n2816,Marsh Bellflower,Campanula aparinoides,CAAP,Perennial,36,12,8,Spring-Summer,\"Marsh bellflower has weak stems and is usually found being supported by, or tangled up in, nearby plants."
    },
    {
        "Id": 1868,
        "Name": "Large Flowered Bellwort (Merry Bells)",
        "Scientific name": "Uvularia grandiflora",
        "Binomial": "UVGR",
        "Plant Type": "Perennial",
        "Height": 24,
        "Spread": 18,
        "Root Depth": 6,
        "Seasonal Interest": "Spring",
        "Notes": "It is a clump-forming, erect plant that grows to 2' tall and features 1.5\" long, pendulous, somewhat bell-shaped, yellow flowers with six, partially twisted tepals (petal and sepal look-alikes) and lance-shaped, perfoliate (leaf base encircles the stem), partially twisted, bright green leaves. Plant has overall droopy appearance. Occurs in the wild typically in rich woodlands, on wooded slopes and in alluvial valleys. Easily grown in average, medium, well-drained soil in part shade to full shade. Prefers a moist, humusy soil and part shade. The root system is rhizomatous, from which offsets are often produced and can occasionally form colonies. Works well in woodland gardens, shady borders or allowed to naturalize. A great companion to ferns, Hostas and other woodland plants.",
        "Flower Color": "Yellow",
        "Root Type": "Long Rhizome",
        "Bloom Time": "Late Spring",
        "Fruit Time": "Summer",
        "Texture": "Medium",
        "Form": "Upright",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Partial_Shade, Shade",
        "Hardiness Zone": "4 -- 9",
        "Soil Moisture": "Moderate",
        "Soil pH": "5.0 - 7.0",
        "Ecological Function": "Insectory, Wildlife Food",
        "Human Use/Crop\r": "Aromatics/Fragrance, Cut Flower, Medicine, Medicine, Ornamental, Ornamental\"\r\n6258,Bergamot,Monarda didyma,MODI,Perennial,48,36,4,Summer,\"Powdery mildew can be a serious problem, particularly in crowded gardens with poor air circulation. In addition, if the soil is allowed to dry out, the stressed plants become increasingly susceptible to disease. Rust can also be a problem. Deer and rabbits tend to avoid this plant."
    },
    {
        "Id": 6652,
        "Name": "Blue-Eyed Grass, Narrowleaf",
        "Scientific name": "Sisyrinchium angustifolium",
        "Binomial": "SIAN",
        "Plant Type": "Perennial",
        "Height": 18,
        "Spread": 12,
        "Root Depth": 4,
        "Seasonal Interest": "Spring-Summer",
        "Notes": "Division every other year is recommended. Prefers soils high in organic matter. Fewer flowers appear in shade. Non-mycorrhizal.",
        "Flower Color": "Blue, Purple",
        "Root Type": "Fibrous Shallow",
        "Bloom Time": "Early Spring - Summer",
        "Fruit Time": "Summer - ?",
        "Texture": "Fine",
        "Form": "Clump",
        "Growth Rate": "Moderate",
        "Insect Predation": "",
        "Disease": "",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "3 -- 9",
        "Soil Moisture": "Wet, Moderate",
        "Soil pH": "5.0 - 7.0",
        "Ecological Function": "Groundcover, Insectory, Wildlife Food",
        "Human Use/Crop\r": "Container Garden, Cut Flower, Food, Medicine\"\r\n1837,Virginia Bluebells,Mertensia virginica,MEVI,Perennial,24,36,4,Summer,Foliage may die off in summer. Best grown in shaded areas where soil is cool and an ample amount of organic matter is present.,\"Blue, Pink, Red"
    },
    {
        "Id": 1729,
        "Name": "Longleaf Bluet (Longleaf Summer Bluet)",
        "Scientific name": "Houstonia longifolia",
        "Binomial": "HOLO",
        "Plant Type": "Perennial",
        "Height": 12,
        "Spread": 18,
        "Root Depth": 4,
        "Seasonal Interest": "Summer",
        "Notes": "Native range: Eastern US and Canada. This herbaceous perennial wildflower is 4-10\" tall and more or less erect. A small rosette of basal leaves may be produced, but it withers away before the flowers bloom. The margins of these basal leaves, when present, are hairless. Multiple flowering stems are produced that often branch. These stems are light to medium green, 4-angled, and either hairless or slightly hairy along their angled margins. Pairs of opposite leaves occur at intervals along each stem. These leaves are about ½–1\" long and less than ¼\" across; they are medium green, lanceolate-oblong or linear-lanceolate, smooth or ciliate along their margins, and single-veined. Secondary leafy stems often develop from the axils of the opposite leaves along the primary stem. The upper stems terminate in small flat-headed clusters of flowers. The root system consists of a small crown with long fibrous roots underneath. This wildflower spreads into new areas by reseeding itself. The preference is full or partial sun, mesic to dry conditions, and a rather sterile soil that is rocky or gravelly. This species will adapt to rock gardens and it is not difficult to cultivate, however it doesn't",
        "Flower Color": "Pink, Purple, White",
        "Root Type": "Fibrous Shallow, Short Rhizome",
        "Bloom Time": "Early Summer - Late Summer",
        "Fruit Time": "Fall",
        "Texture": "Fine",
        "Form": "Upright",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun",
        "Hardiness Zone": "2 -- 8",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "6.0 - 8.0",
        "Ecological Function": "Insectory, Reclamator, Wildlife Food",
        "Human Use/Crop\r": "Ornamental\r"
    },
    {
        "Id": 2895,
        "Name": "Blushing Bromeliad",
        "Scientific name": "Neoregelia carolinae",
        "Binomial": "NECA",
        "Plant Type": "Perennial",
        "Height": 18,
        "Spread": 18,
        "Root Depth": 0,
        "Seasonal Interest": "All Year",
        "Notes": "Center of the plant turns a deep pink/red color prior to blooming. No specific flowering time.",
        "Flower Color": "Purple",
        "Root Type": "Corm, Tuber",
        "Bloom Time": "",
        "Fruit Time": "",
        "Texture": "Coarse",
        "Form": "Rosette",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Partial_Shade",
        "Hardiness Zone": "10 -- 13",
        "Soil Moisture": "Moderate",
        "Soil pH": "6.1 - 7.5",
        "Ecological Function": "Air Cleaner",
        "Human Use/Crop\r": "Ornamental\r"
    },
    {
        "Id": 2522,
        "Name": "Bog Buckbean",
        "Scientific name": "Menyanthes trifoliata",
        "Binomial": "METR",
        "Plant Type": "Perennial",
        "Height": 8,
        "Spread": 10,
        "Root Depth": 10,
        "Seasonal Interest": "Spring",
        "Notes": "",
        "Flower Color": "Green",
        "Root Type": "Rhizome",
        "Bloom Time": "Spring - Late Spring",
        "Fruit Time": "",
        "Texture": "Medium",
        "Form": "Upright",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade, Shade",
        "Hardiness Zone": "3 -- 9",
        "Soil Moisture": "Wet",
        "Soil pH": "4.8 - 6.5",
        "Ecological Function": "",
        "Human Use/Crop\r": "Food, Medicine\"\r\n6785,Brooklime,Veronica beccabunga,VEBE,Perennial,24,16,0,All Year,\"Grows best in moderately fertile soil, with water up to 15 cm (6in). Prefers cool summers. Evergreen where the climate is mild enough Spreads by rooting from nodes. Can be propagated by division. Non-mycorrhizal."
    },
    {
        "Id": 1877,
        "Name": "White Prairie Clover",
        "Scientific name": "Dalea candida",
        "Binomial": "DACA",
        "Plant Type": "Perennial",
        "Height": 30,
        "Spread": 12,
        "Root Depth": 24,
        "Seasonal Interest": "Summer",
        "Notes": "",
        "Flower Color": "White",
        "Root Type": "Tuber",
        "Bloom Time": "Early Summer - Late Summer",
        "Fruit Time": "",
        "Texture": "Fine",
        "Form": "Upright",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "2 -- 8",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "6.0 - 8.0",
        "Ecological Function": "Dynamic Accumulator, Insectory, Insectory, Reclamator, Wildlife Food",
        "Human Use/Crop\r": "Medicine\r"
    },
    {
        "Id": 1878,
        "Name": "Purple Prairie Clover (Violet Prairie Clover)",
        "Scientific name": "Dalea purpurea",
        "Binomial": "DAPU",
        "Plant Type": "Perennial",
        "Height": 30,
        "Spread": 18,
        "Root Depth": 24,
        "Seasonal Interest": "Summer",
        "Notes": "Purple prairie clover is a perennial wildflower native to the central US and Canada and grows 1-3 feet tall. Despite its name, it is not a true clover, but a legume with a long taproot. It is adapted to areas with periodic wildfires as this removes larger competing plants. The individual flowers are tiny and born on a cone-shaped flower spike early to mid-summer. The leaves a small and narrow and the fruit is a legume. It is adaptable to various soil types except for wet ones and needs full to partial sun for best growth. Use this plant in a naturalized and drought-tolerant setting. Dense cone-shaped spikes are 1-2 inches long and sport tiny purple flowers in early to mid-summer. Begins opening from the bottom of the spike and ascends upward throughout the season. Individual flowers are ¼\" across, with 5 purple petals and 5 protruding goldish-orange anthers. The mature purple prairie clover has a coarse, nonfibrous root system with a strong woody taproot that is 5.5 to 6.5 feet (1.7-2.0 m) deep. The taproot gives rise to several minutely branched lateral roots. Purple prairie clover is an important component of Great Plains grassland communities. It is considered \"common\" in most",
        "Flower Color": "Purple",
        "Root Type": "Tap, Short Rhizome",
        "Bloom Time": "Summer - Late Summer",
        "Fruit Time": "Summer - Fall",
        "Texture": "Fine",
        "Form": "Upright",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun",
        "Hardiness Zone": "3 -- 9",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "6.0 - 8.0",
        "Ecological Function": "Domestic Animal Forage, Erosion Control, Fungicide, Insectory, Nitrogen Fixer, Reclamator, Wildlife Food",
        "Human Use/Crop\r": "Fiber, Food, Food, Food, Medicine, Medicine, Medicine, Medicine, Medicine, Ornamental\"\r\n2634,Strawberry O'Conner Clover,Trifolium fragiferum 'O'Conner',TRFR,Perennial,14,0,12,Summer,\"N-fixing, protein-rich species particularly adapted to waterlogged and/or saline soils and to heavy irrigation."
    },
    {
        "Id": 3078,
        "Name": "Coin-Leaf Desmodium (Guang Jing Qian Cao)",
        "Scientific name": "Desmodium styracifolium",
        "Binomial": "DEST",
        "Plant Type": "Perennial",
        "Height": 40,
        "Spread": 40,
        "Root Depth": 12,
        "Seasonal Interest": "Spring-Fall",
        "Notes": "The range of Desmodium styracifolium extends from southeastern China (hardiness zone 8 in Anhui and Hubei) to the tropical regions of southeast Asia. Plants from the north of its range experience light to occasionally moderate frosts and can be expected to succeed outdoors in the warmer regions of the temperate zone. Prerfers a well-drained soil and a sunny sheltered position. Succeeds in full sunlight as well as in shade. Because of the abundant small uncinate hairs on most species, the seedpods cling most tenaciously to clothing, to any part of the human body, and also to the feathers and hair of various animals, thus ensuring a wide dispersal of the plants.",
        "Flower Color": "Blue, Lavender, Purple",
        "Root Type": "Tap, Rhizome",
        "Bloom Time": "Late Spring - Summer",
        "Fruit Time": "Summer - Fall",
        "Texture": "Medium",
        "Form": "Prostrate",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade, Shade",
        "Hardiness Zone": "10 -- 12",
        "Soil Moisture": "Wet, Moderate",
        "Soil pH": "5.5 - 7.5",
        "Ecological Function": "Erosion Control, Nitrogen Fixer, Soil Builder, Soil Builder",
        "Human Use/Crop\r": "Medicine, Medicine, Medicine, Medicine\"\r\n8014,Tree Collards,\"Brassica oleracea var. acephala cv \"Tree Collards\""
    },
    {
        "Id": 1747,
        "Name": "Columnar Coneflower",
        "Scientific name": "Ratibida columnifera",
        "Binomial": "RACO",
        "Plant Type": "Perennial",
        "Height": 36,
        "Spread": 36,
        "Root Depth": 15,
        "Seasonal Interest": "Summer",
        "Notes": "Grows on gentle slopes. Attracts Dakotas skipper butterflies. Seed should be planted into a firm, weed-free seedbed, preferably with a drill that will ensure uniform seed placement depth of ¼ to ½ inch (6 to 12 mm). The processed seed of prairie coneflower has approximately 600,000 seeds/lb (1,320,000 seeds/kg). The full seeding rate is 2 lb/acre (2.2 kg/ha) pure-live-seed (PLS), but it would seldom be seeded in a pure stand. It is recommended that prairie coneflower be included as a component of a native seed mixture at a rate of ¼ to ½ lb/acre (0.3 to 0.6 kg/ha). When used in a mix adjust the seeding rate to the desired percentage of mix. Spring seeding is preferred over a dormant, fall planting date. Periodic mowing during the establishment year is one option for weed suppression.",
        "Flower Color": "Yellow",
        "Root Type": "Tap, Short Rhizome",
        "Bloom Time": "Early Summer - Summer",
        "Fruit Time": "Summer",
        "Texture": "Medium",
        "Form": "Upright",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun",
        "Hardiness Zone": "3 -- 9",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "5.9 - 7.0",
        "Ecological Function": "Domestic Animal Forage, Erosion Control, Insectory, Reclamator, Reclamator, Wildlife Food",
        "Human Use/Crop\r": "Dye, Food, Medicine, Medicine\"\r\n1748,Gray Headed Coneflower (Pinnate Prairie Coneflower,Ratibida pinnata,RAPI,Perennial,72,36,14,Summer,\"Yellow Coneflower is a rhizomatous perennial herb native to central and eastern USA in the aster family. It is found growing in fields, prairies and dry open woods. It will grow up to 5 feet tall and the large yellow flowers attract many pollinators. Blooms most of the summer. Yellow Coneflower prefers clay loam to loam soils in full sun but is adaptable to dry to moist conditions and various soils. It is very easy to grow in full sun to partial shade. It is drought and poor soil tolerant so don't overwater or over-fertilize. Use this plant in the native or pollinator garden in the back border, in naturalized areas, meadows or open woodland."
    },
    {
        "Id": 1793,
        "Name": "Early Sunrise Coreopsis",
        "Scientific name": "Coreopsis grandiflora 'Early Sunrise'",
        "Binomial": "COGR",
        "Plant Type": "Perennial",
        "Height": 24,
        "Spread": 24,
        "Root Depth": 0,
        "Seasonal Interest": "Summer",
        "Notes": "Overly rich soil will cause flopping. Species will thrive in fields and sunny banks and multiply indefinately. Self seeds to taller form. Will bloom same year seeded. Short lived Coreopsis, but freely seeds. Coreopsis verticillata (Zagreb) is the har",
        "Flower Color": "Orange, Yellow",
        "Root Type": "Corm",
        "Bloom Time": "Early Summer - Early Fall",
        "Fruit Time": "",
        "Texture": "Fine",
        "Form": "Upright",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "4 -- 9",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "6.0 - 8.0",
        "Ecological Function": "Dynamic Accumulator",
        "Human Use/Crop\r": "Cut Flower\r"
    },
    {
        "Id": 2564,
        "Name": "Sand Coreopsis",
        "Scientific name": "Coreopsis lanceolata",
        "Binomial": "COLA",
        "Plant Type": "Perennial",
        "Height": 24,
        "Spread": 24,
        "Root Depth": 6,
        "Seasonal Interest": "Summer",
        "Notes": "",
        "Flower Color": "Yellow",
        "Root Type": "Rhizome, Fibrous Shallow",
        "Bloom Time": "Spring - Early Summer",
        "Fruit Time": "",
        "Texture": "Medium",
        "Form": "Clump",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade, Shade",
        "Hardiness Zone": "4 -- 9",
        "Soil Moisture": "Moderate",
        "Soil pH": "5.1 - 7.8",
        "Ecological Function": "Insectory, Wildlife Food, Wildlife Food",
        "Human Use/Crop\r": "Cut Flower\r"
    },
    {
        "Id": 1794,
        "Name": "Stiff Tickseed",
        "Scientific name": "Coreopsis palmata",
        "Binomial": "COPA",
        "Plant Type": "Perennial",
        "Height": 30,
        "Spread": 36,
        "Root Depth": 0,
        "Seasonal Interest": "Summer",
        "Notes": "Likes sandy, gravelly or rocky soil. Attracts birds and butterflies.",
        "Flower Color": "Orange, Yellow",
        "Root Type": "Fibrous Shallow",
        "Bloom Time": "Summer - Late Summer",
        "Fruit Time": "",
        "Texture": "Medium",
        "Form": "Spreading",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "3 -- 7",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "4.0 - 7.0",
        "Ecological Function": "Insectory, Wildlife Food",
        "Human Use/Crop\r": "\r"
    },
    {
        "Id": 2546,
        "Name": "Tall Coreopsis",
        "Scientific name": "Coreopsis tripteris",
        "Binomial": "COTR",
        "Plant Type": "Perennial",
        "Height": 96,
        "Spread": 96,
        "Root Depth": 8,
        "Seasonal Interest": "Summer-Fall",
        "Notes": "Easily grown in dry to medium moisture, well-drained soil in full sun. Thrives in poor, sandy or rocky soils with good drainage. Plants grown in dry soils tend to be shorter, open and somewhat spindly. Plants grown in medium moisture soils with consistent moisture tend to be taller and fuller. Tolerant of heat, humidity and drought. Prompt deadheading of spent flowers may encourage additional bloom and prevents any unwanted self-seeding. Freely self-seeds, and in optimum growing conditions will naturalize to form large colonies. If grown in borders, division may be needed every 2-3 years to maintain robustness.",
        "Flower Color": "Brown, Yellow",
        "Root Type": "Fibrous Shallow",
        "Bloom Time": "Summer - Early Fall",
        "Fruit Time": "Summer - Fall",
        "Texture": "Medium",
        "Form": "Upright",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun",
        "Hardiness Zone": "3 -- 8",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "6.0 - 7.5",
        "Ecological Function": "Insectory, Wildlife Food",
        "Human Use/Crop\r": "Aromatics/Fragrance, Cut Flower, Medicine\"\r\n7076,Tickseed (Pink coreopsis),Coreopsis rosea,CORO,Perennial,24,28,0,Summer-Fall,\"Spreads via rhizome and seeds, can be aggressive. Seeds resemble ticks, hence the name tickseed. Fruit is a cypsela."
    },
    {
        "Id": 7046,
        "Name": "Dusky Cranesbill",
        "Scientific name": "Geranium phaeum",
        "Binomial": "GEPH",
        "Plant Type": "Perennial",
        "Height": 30,
        "Spread": 18,
        "Root Depth": 4,
        "Seasonal Interest": "Spring-Summer",
        "Notes": "Also known as mourning widow, black widow, and hardy geranium. Best in well-drained humusy soils. Preferes part-shade or shade and is intolerant of high heat and humidity (foliage may decline under these conditions). Self-seeds in optimal conditions. There are a number of ornamental cultivars.",
        "Flower Color": "Purple",
        "Root Type": "Rhizome",
        "Bloom Time": "Late Spring - Late Summer",
        "Fruit Time": "Summer - Fall",
        "Texture": "Medium",
        "Form": "Clump",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade, Shade",
        "Hardiness Zone": "3 -- 7",
        "Soil Moisture": "Wet, Moderate",
        "Soil pH": "5.5 - 7.5",
        "Ecological Function": "Groundcover, Insectory",
        "Human Use/Crop\r": "Container Garden, Cut Flower, Ornamental\"\r\n5975,Wood Cranesbill,Geranium sylvaticum,GESY,Perennial,36,24,0,Summer,\"Also known as woodland geranium. This species features a wide range of phenotypic variation. Primary habitat includes woodlands, meadows, and streambanks. Pollinated by bees, flies, and lepidoptera. Spreads via seeds and rhizomes."
    },
    {
        "Id": 1758,
        "Name": "Crocus",
        "Scientific name": "Crocus sativus",
        "Binomial": "CRSA",
        "Plant Type": "Perennial",
        "Height": 6,
        "Spread": 12,
        "Root Depth": 3,
        "Seasonal Interest": "",
        "Notes": "Crocus are dwarf, deciduous perennials growing from a corm, with linear leaves usually with a silvery central stripe, and goblet-shaped, sometimes fragrant flowers in autumn or early spring. Tolerant of summer drought but requires moist growing conditions in the spring. Mow only after foliage has yellowed.Plants are sterile and do not produce viable seed.",
        "Flower Color": "Blue, Orange, Purple, White, Yellow",
        "Root Type": "Bulb",
        "Bloom Time": "Early Spring - Late Spring",
        "Fruit Time": "",
        "Texture": "Fine",
        "Form": "Upright",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "6 -- 8",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "5.5 - 7.0",
        "Ecological Function": "Fungicide, Insectory, Wildlife Food",
        "Human Use/Crop\r": "Aromatics/Fragrance, Dye, Food, Food, Medicine, Medicine, Medicine, Ornamental\"\r\n3240,\"Cyclamen, Florist's"
    },
    {
        "Id": 2620,
        "Name": "Dropwort, (Meadow Sweet, Queen of the Meadow)",
        "Scientific name": "Filipendula vulgaris",
        "Binomial": "FIVU",
        "Plant Type": "Perennial",
        "Height": 120,
        "Spread": 48,
        "Root Depth": 8,
        "Seasonal Interest": "Spring-Summer",
        "Notes": "Tolerates drought low-fertility but prefers rich, moist, well-drained soil. Often occurs on chalky, basic soils. Self seeds freely. Flowering stalks can be cut back after flowering. There are a number of ornamental cultivars. Requirements and care: Full sunlight or partial shade; some species will only grow in the shade. Alkaline soil, moist soil. Mix in manure or compost. Soil must be kept moist so supply a spring and autumn mulch of organic material. Provide support with twigs. Cut back to the ground in autumn. Propagate: by dividing at the start of spring in cold areas or autumn in warmer areas. Takes two years for seed grown plants to bloom.",
        "Flower Color": "Pink, White",
        "Root Type": "Rhizome, Tuber",
        "Bloom Time": "Late Spring - Late Summer",
        "Fruit Time": "Summer - Fall",
        "Texture": "Medium",
        "Form": "Rosette",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "3 -- 9",
        "Soil Moisture": "Wet, Moderate, Dry",
        "Soil pH": "6.5 - 8.0",
        "Ecological Function": "Domestic Animal Forage, Groundcover, Insectory",
        "Human Use/Crop\r": "Aromatics/Fragrance, Container Garden, Cut Flower, Food, Medicine, Ornamental\"\r\n6287,Water Dropwort,Oenanthe aquatica,OEAQ,Perennial,60,60,8,Spring-Fall,\"Easily grown in wet soil or slow-moving shallow water. A tuberous perennial herb of still or slow-moving water, usually occurring on deep, silty, often eutrophic, substrates in shallow ponds and ditches, often where water fluctuates in depth. It also grows in open vegetation by sheltered lakes, reservoirs, canals, streams and rivers, and in marshes and seasonally flooded depressions. Lowland. Tolerates a variety of soils. Best in full sun. Oenanthe aquatica, commonly called fine-leaved water dropwort, is a fibrous-rooted, stoloniferous, herbaceous perennial that is native to marshes, shallow ponds, ditches, stream/river edges, and seasonally flooded lowlands in Europe, Asia and northern Africa. It has escaped cultivation and naturalized in Ohio and Maryland. Plants typically grow to 3-5' tall. Small leaves appear in fan-shaped segments. Small 5-petaled white flowers bloom in compound umbels from June to September. Mericarp fruit spreads by water or animals. Individual plants are biennial, dying after flowering. The plant perrenates, however, by means of offsets"
    },
    {
        "Id": 2536,
        "Name": "Dutchman's Breeches",
        "Scientific name": "Dicentra cucullaria",
        "Binomial": "DICU",
        "Plant Type": "Perennial",
        "Height": 8,
        "Spread": 8,
        "Root Depth": 6,
        "Seasonal Interest": "Spring",
        "Notes": "Grows in rich, moist woods.",
        "Flower Color": "White",
        "Root Type": "Bulb",
        "Bloom Time": "Spring - Late Spring",
        "Fruit Time": "",
        "Texture": "Fine",
        "Form": "Clump",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade, Shade",
        "Hardiness Zone": "3 -- 7",
        "Soil Moisture": "Moderate",
        "Soil pH": "6.1 - 7.2",
        "Ecological Function": "Insectory",
        "Human Use/Crop\r": "Food\r"
    },
    {
        "Id": 6066,
        "Name": "Elecampane (Horse Heal, Elf Dock)",
        "Scientific name": "Inula helenium",
        "Binomial": "INHE",
        "Plant Type": "Perennial",
        "Height": 84,
        "Spread": 36,
        "Root Depth": 12,
        "Seasonal Interest": "Summer",
        "Notes": "Easily grown in moist, well-drained soils in full sun to part shade. Plant about 3' apart. Tolerates wide variety of soils from sandy to clay. Best in cool summer climates. Taller plants may need support, particularly in areas exposed to wind. Plants depreciate rapidly after flowering. Propagate by seed or division.",
        "Flower Color": "Yellow",
        "Root Type": "Rhizome",
        "Bloom Time": "Early Summer - Late Summer",
        "Fruit Time": "",
        "Texture": "Coarse",
        "Form": "Upright",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "3 -- 7",
        "Soil Moisture": "Moderate",
        "Soil pH": "6.0 - 7.5",
        "Ecological Function": "Aromatic Pest Confuser, Hedge, Insecticide, Insectory, Toxin Absorber",
        "Human Use/Crop\r": "Dye, Dye, Essential Oil, Food, Food, Medicine\"\r\n2010,English Lavender,Lavandula angustifolia,LAAN,Perennial,18,24,0,Summer-Fall,\"Evergreen, silvery foliage; aromatic plant; purple, violet and white flower"
    },
    {
        "Id": 2011,
        "Name": "Fennel",
        "Scientific name": "Foeniculum vulgare",
        "Binomial": "FOVU",
        "Plant Type": "Perennial",
        "Height": 48,
        "Spread": 24,
        "Root Depth": 12,
        "Seasonal Interest": "Summer",
        "Notes": "Yellow flower",
        "Flower Color": "Yellow",
        "Root Type": "Tap",
        "Bloom Time": "Summer - Late Summer",
        "Fruit Time": "",
        "Texture": "Medium",
        "Form": "Clump",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun",
        "Hardiness Zone": "4 -- 9",
        "Soil Moisture": "Moderate",
        "Soil pH": "6.6 - 8.5",
        "Ecological Function": "Dynamic Accumulator, Insecticide, Insectory",
        "Human Use/Crop\r": "Dye, Essential Oil, Food, Insect Repellent, Medicine\"\r\n2904,Korean Rock Fern,Polystichum luctuosum,POLU,Perennial,36,36,6,All Year,\"Easy to grow in most cool, fertile, moist, humus-rich, shaded soils. Protect crowns from excessive winter wet. Poor drainage may lead to crown rot, especially in the winter. In habitat this fern is found on forest floors and rocky slopes thus making it a perfect fern for growing in the rocky fern garden or at the front of a shaded border."
    },
    {
        "Id": 2033,
        "Name": "Garlic",
        "Scientific name": "Allium sativum",
        "Binomial": "ALSA",
        "Plant Type": "Perennial",
        "Height": 24,
        "Spread": 9,
        "Root Depth": 6,
        "Seasonal Interest": "Summer",
        "Notes": "Not known in a truly wild situation. Garlic comes in two varieties: hardneck (designated as Allium sativum var. ophioscorodon) and softneck (designated as Allium sativum var. sativum). Hardneck varieties typically produce a flower stalk, with flowers giving way to a seed cap. Each bulb typically contains 4-10 cloves (bulb is smaller but cloves are larger than those of softneck). Hardneck varieties come in three different types: Rocambole, Poreclain and Purple Stripe. By contrast, softneck garlic plants typically do not produce a flower stalk. They produce bulbs with smaller but more numerous cloves than hardneck garlic plants. Summer harvest of bulbs; inconspicuous flowers that are edible. They produce bulbs with smaller but more numerous cloves than hardneck garlic plants. Each bulb typically contains 12-20 cloves. Softneck plants are also braidable (bulbs can be braided together into attractive chains by weaving the soft grass-like tops together). Softneck garlic varieties are the ones most often commonly sold in supermarkets because they typically have a much longer shelf life than hardnecks. Softneck varieties come in two different types: Silverskin and Artichoke. Propagation:",
        "Flower Color": "White",
        "Root Type": "Bulb, Fibrous Shallow",
        "Bloom Time": "Early Summer",
        "Fruit Time": "Summer - Fall",
        "Texture": "Medium",
        "Form": "Upright",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun",
        "Hardiness Zone": "3 -- 8",
        "Soil Moisture": "Wet, Moderate, Dry",
        "Soil pH": "5.5 - 8.5",
        "Ecological Function": "Aromatic Pest Confuser, Aromatic Pest Confuser, Dynamic Accumulator, Fungicide, Insecticide, Insectory",
        "Human Use/Crop\r": "Cut Flower, Food, Food, Insect Repellent, Medicine, Medicine, Oil, Wax, Resin or Polish\"\r\n8290,\"Erdel's Garlic (Shum Erdel, Thum Shaffaf )"
    },
    {
        "Id": 5424,
        "Name": "Canadian Garlic (Meadow Garlic)",
        "Scientific name": "Allium canadense",
        "Binomial": "ALCA",
        "Plant Type": "Perennial",
        "Height": 23,
        "Spread": 8,
        "Root Depth": 6,
        "Seasonal Interest": "Spring",
        "Notes": "Habitats and Possible Locations: Bog Garden, Woodland, Cultivated Beds, Sunny Edge, Dappled Shade.",
        "Flower Color": "Pink, White",
        "Root Type": "Bulb, Fibrous Shallow",
        "Bloom Time": "Late Spring - Early Summer",
        "Fruit Time": "Fall",
        "Texture": "Fine",
        "Form": "Upright",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "4 -- 7",
        "Soil Moisture": "Wet, Moderate",
        "Soil pH": "6.0 - 7.5",
        "Ecological Function": "Chemical Barrier, Insectory, Wildlife Food",
        "Human Use/Crop\r": "Food, Insect Repellent, Medicine\"\r\n7041,\"White Gaura (Pink Gaura, Indian Feather)"
    },
    {
        "Id": 1839,
        "Name": "Bottle Gentian (Andrew's Gentian)",
        "Scientific name": "Gentiana andrewsii",
        "Binomial": "GEAN",
        "Plant Type": "Perennial",
        "Height": 24,
        "Spread": 18,
        "Root Depth": 6,
        "Seasonal Interest": "Summer",
        "Notes": "Habitat: full to partial sun; moderate moisture to wet; prairies, meadows, woods; in sandy, loamy soil. Flowers in some forms can be pink to white. Also known as Closed Gentian.",
        "Flower Color": "Blue, Purple",
        "Root Type": "Tap",
        "Bloom Time": "Late Summer - Early Fall",
        "Fruit Time": "",
        "Texture": "Medium",
        "Form": "Upright",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade, Shade",
        "Hardiness Zone": "2 -- 8",
        "Soil Moisture": "Wet, Moderate",
        "Soil pH": "5.8 - 7.1",
        "Ecological Function": "Insectory, Wildlife Food",
        "Human Use/Crop\r": "Medicine, Ornamental\"\r\n1750,Cream Gentian (White Prairie Gentian),Gentiana alba,GEAL,Perennial,36,24,12,Summer,\"Gentiana alba is usually a prairie species, but it also grows in a variety of other habitats including open woodlands, savannahs, glades and even roadsides. It can tolerate a fairly wide range of moisture regimes, but seems to prefer drier sites with an abundance of light. The preference is full to partial sun, and moist to average soil conditions. The soil can contain significant amounts of loam, clay, gravel, or sand. Starting plants from seed can be tricky, while transplants are much easier to manage. A yellowish appearance of the leaves is a common reaction to strong sunlight or dry weather, and does not necessarily signify disease or poor health. The growth form tends to be somewhat sprawling, with the plants often leaning on adjacent vegetation. Tolerates a variety of site conditions. One of the easiest Gentians to find seed of in the trade."
    },
    {
        "Id": 1734,
        "Name": "Golden Alexander",
        "Scientific name": "Zizia aurea",
        "Binomial": "ZIAU",
        "Plant Type": "Perennial",
        "Height": 36,
        "Spread": 24,
        "Root Depth": 8,
        "Seasonal Interest": "Spring",
        "Notes": "Tall grass prairies, wet thickets, and along stream banks. Golden Alexanders should not be confused with Pastinaca sativa (Wild Parsnip), which is a weedy Eurasian biennial. The latter is taller, blooms later, and has more leaflets in each compound leaf. It can be particularly difficult to distinguish Golden Alexanders from Thaspium trifoliatum aureum (Yellow Meadow Parsnip), which is another native perennial plant. For the latter plant, the central flower of each umbellet has a short pedicel, the achenes are winged, and its basal leaves are simple, rather than trifoliate. Otherwise, these two species share nearly the same characteristics. Golden Alexanders is an excellent addition to a wildflower garden because it provides accessible nectar to many beneficial insects with short mouthparts during the spring and early summer when such flowers are relatively uncommon. No serious insect or disease problems. Foliage tends to depreciate as the summer progresses. In ideal conditions can reseed heavily.",
        "Flower Color": "Yellow",
        "Root Type": "Fibrous Shallow",
        "Bloom Time": "Spring - Late Spring",
        "Fruit Time": "Summer - Fall",
        "Texture": "Medium",
        "Form": "Upright",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade, Shade",
        "Hardiness Zone": "3 -- 9",
        "Soil Moisture": "Wet, Moderate",
        "Soil pH": "5.0 - 7.0",
        "Ecological Function": "Insectory, Wildlife Food",
        "Human Use/Crop\r": "Food, Medicine, Ornamental\"\r\n2560,Heart-Leaved Golden Alexander (Meadow Zizia),Zizia aptera,ZIAP,Perennial,36,20,36,Spring-Summer,\"This native perennial plant is 1-2½' tall, branching sparingly in the upper half of the plant.In the heart of its range, the plant inhabits prairies, mid-successional fields, river shores, and glades with moist to dry soils that are principally derived from calcareous bedrock. Zizia aptera can occur in large patches (hundreds of plants). Plants may persist in a sterile condition for a number of years. This species is probably best planted in the spring or early fall from containerize stock to ensure success. Unstratified seed may also be fall planted, although germination the following spring may not be as predictable"
    },
    {
        "Id": 2517,
        "Name": "Bog Goldenrod",
        "Scientific name": "Solidago uliginosa",
        "Binomial": "SOUL",
        "Plant Type": "Perennial",
        "Height": 48,
        "Spread": 18,
        "Root Depth": 6,
        "Seasonal Interest": "Summer-Fall",
        "Notes": "Grows in wet areas (bogs, swamps, marshes). Flowers in a tight tall clump at top of stem.",
        "Flower Color": "Yellow",
        "Root Type": "Rhizome",
        "Bloom Time": "Summer - Early Fall",
        "Fruit Time": "",
        "Texture": "Medium",
        "Form": "Upright",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "4 -- 9",
        "Soil Moisture": "Moderate",
        "Soil pH": "4.5 - 5.7",
        "Ecological Function": "Insectory",
        "Human Use/Crop\r": "Medicine, Ornamental\"\r\n2480,Giant Goldenrod,Solidago gigantea,SOGI,Perennial,84,36,16,Spring-Fall,,Yellow,Long Rhizome,Early Summer - Fall,,Medium,Upright,Moderate,Minor,Minor,\"Full_Sun, Partial_Shade"
    },
    {
        "Id": 1845,
        "Name": "Stiff Goldenrod",
        "Scientific name": "Solidago rigida",
        "Binomial": "SORI",
        "Plant Type": "Perennial",
        "Height": 60,
        "Spread": 36,
        "Root Depth": 0,
        "Seasonal Interest": "Summer-Fall",
        "Notes": "Wide pH range Attracts bees, butterflies Grows on lower slopes",
        "Flower Color": "Yellow",
        "Root Type": "Fibrous Shallow",
        "Bloom Time": "Late Summer - Early Fall",
        "Fruit Time": "",
        "Texture": "Medium",
        "Form": "Upright",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "2 -- 8",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "6.0 - 8.0",
        "Ecological Function": "Erosion Control, Soil Builder",
        "Human Use/Crop\r": "Dye, Medicine, Oil, Wax, Resin or Polish\"\r\n6672,Sweet Goldenrod (Licorice Goldenrod),Solidago odora,SOOD,Perennial,48,24,8,Summer-Fall,\"Easily grown in average, dry to medium, well-drained soils in full sun to part shade. Tolerates poor, dry soils and light shade, but performs best in full sun. May be grown from seed and may self-seed in the garden. This species is primarily clump-forming and does not spread aggressively as do some of the other goldenrod species and hybrids. Goldenrods have been wrongfully accused of causing hay fever which is actually an allergic reaction to wind-borne pollen from other plants such as ragweed."
    },
    {
        "Id": 6413,
        "Name": "Clammy Ground Cherry (Rowell's Groundcherry)",
        "Scientific name": "Physalis heterophylla",
        "Binomial": "PHHE",
        "Plant Type": "Perennial",
        "Height": 32,
        "Spread": 48,
        "Root Depth": 12,
        "Seasonal Interest": "Summer-Fall",
        "Notes": "Clammy Goundcherry is an herbaceous perennial plant native to North America in the Solanaceae (nightshade) family. The main identifying characteristic of this plant is the glandularly pubescence of the stem and leaves and the thick rhizomes run horizontally from the stem. There are 4 varieties and the differences are in the venation and margin of the leaves. This plant is found in slightly moist to dry areas in loam, sand or rocky soils or disturbed areas in full to partial sun. Most herbivores will not eat the plant due to the high content of solanum in the leaves and unripe fruit but it has caused poisoning of cattle.",
        "Flower Color": "Purple, Yellow",
        "Root Type": "Tap, Long Rhizome",
        "Bloom Time": "Early Summer - Fall",
        "Fruit Time": "Summer - Fall",
        "Texture": "Coarse",
        "Form": "Irregular",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "4 -- 9",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "5.6 - 8.5",
        "Ecological Function": "Insectory, Wildlife Food",
        "Human Use/Crop\r": "Food, Medicine\"\r\n7473,Balsam Groundsel (Balsam Ragwort),Packera paupercula,PAPA,Perennial,36,24,0,Spring-Summer,Previously Senecio pauperculus. Colonies can be formed from rhizomes. Flowering occurs May–late Jun (south) or late Jun–early Aug (north). Phenotype is highly variable.,Yellow,\"Fibrous Shallow, Rhizome"
    },
    {
        "Id": 2219,
        "Name": "Hyssop",
        "Scientific name": "Hyssopus officinalis",
        "Binomial": "HYOF",
        "Plant Type": "Perennial",
        "Height": 24,
        "Spread": 24,
        "Root Depth": 12,
        "Seasonal Interest": "Spring-Fall",
        "Notes": "Hyssop is a fragrant ornamental, good for clipping into a knot or edging or leaving unclipped for cut flowers.",
        "Flower Color": "Blue, Pink, Purple, White",
        "Root Type": "Fibrous Deep, Rhizome",
        "Bloom Time": "Late Spring - Early Fall",
        "Fruit Time": "",
        "Texture": "Medium",
        "Form": "Clump",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "3 -- 9",
        "Soil Moisture": "Moderate",
        "Soil pH": "6.6 - 8.5",
        "Ecological Function": "Aromatic Pest Confuser, Erosion Control, Insectory, Insectory",
        "Human Use/Crop\r": "Aromatics/Fragrance, Essential Oil, Food, Medicine\"\r\n1799,Anise Hyssop (Fragrant Giant Hyssop),Agastache foeniculum,AGFO,Perennial,48,24,5,Summer-Fall,\"Blue-purple flowers. No serious insect or disease problems. Crown/root rot may develop in poorly drained soils. Watch for rust, powdery mildew and leaf spots. Easily grown in average, dry to medium moisture, well-drained soils in full sun to part shade. Best in full sun. Performs well in moist soils, but good soil drainage is essential. Plants tolerate dry soils, particularly once established. Deadhead spent flowers to promote additional bloom. he upper stems terminate in spikes of flowers that can come in many colors about 3-6\" long. The small flowers are arranged in dense whorls that are crowded along the spike and the flowers are replaced by smooth, oval-shaped nutlets. Flowering starts, even in unfavorable summers, in late July and continues until late autumn. The plants will self-seed in the garden and usually overwinter well if the soil is well-drained. Plants will spread by rhizomes and will easily self seed in optimum growing conditions."
    },
    {
        "Id": 1715,
        "Name": "Bearded Iris",
        "Scientific name": "Iris hybrida",
        "Binomial": "IRHY",
        "Plant Type": "Perennial",
        "Height": 36,
        "Spread": 30,
        "Root Depth": 5,
        "Seasonal Interest": "Spring",
        "Notes": "Can grow in very light shade and needs well-drained soil. Handling roots can cause dermatitis. Flowering will be marginal first year after planting. Tolerant of proximity to black walnut trees. Divide rhizome in late summer.",
        "Flower Color": "Blue, Lavender, Pink, Purple, Red, Rose, White, Yellow",
        "Root Type": "Bulb, Rhizome",
        "Bloom Time": "Late Spring - Summer",
        "Fruit Time": "Summer - ?",
        "Texture": "Medium",
        "Form": "Upright",
        "Growth Rate": "Moderate",
        "Insect Predation": "Major",
        "Disease": "Minor",
        "Light": "Full_Sun",
        "Hardiness Zone": "3 -- 10",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "6.0 - 7.5",
        "Ecological Function": "Erosion Control",
        "Human Use/Crop\r": "Cut Flower, Ornamental\"\r\n6071,Common Iris (Common German Flag),Iris x germanica,IRx,Perennial,36,24,2,Spring,\"Iris germanica, commonly called common flag or German iris, is the presumed father of most modern bearded iris cultivars. Origin is uncertain, but species plants are probably native to southern Europe and the Mediterranean area. This iris has become established over time throughout the world, with naturalization having occurred in many parts of Europe and the U.S. It is difficult to specifically describe German iris as a species because it appears in so many different forms. Best grown in humusy, medium moisture, well-drained soils in full sun. Best flowering and disease resistance occur in full sun. Plants will tolerate light shade. Good soil drainage is essential to combat potential soft rot problems. Avoid use of mulch for the same reason. Heavy clay soils must be amended prior to planting (e.g., add gypsum, coarse sand, organic matter) or raised plantings should be considered. Plant rhizomes shallowly (cover with 1/2” soil) and 12-24” apart in mid to late summer (July to early September). Fertilize lightly in early spring. Avoid overhead watering. Deadhead individual spent flowers and remove flowering stems to the ground after bloom. Divide plants immediately after flowering wh"
    },
    {
        "Id": 3073,
        "Name": "Kidney Vetch ) Lady's Fingers)",
        "Scientific name": "Anthyllis vulneraria",
        "Binomial": "ANVU",
        "Plant Type": "Perennial",
        "Height": 24,
        "Spread": 36,
        "Root Depth": 6,
        "Seasonal Interest": "Summer-Fall",
        "Notes": "Common kidney-vetch is native to Europe and introduced in North America. It is used in traditional medicine, externally to promote wound healing and internally as a laxative and for kidney disorders. There are a number of subspecies present in Europe, several of which have been introduced abroad. Kidney Vetch copes well with dry conditions and is commonly seen on the edges of sandy coastal footpaths as well as in sand-dune systems. Dry grassland and calcareous rocky areas, including roadside verges where lime chippings have been spread, are also favoured by this drought-tolerant plant.",
        "Flower Color": "Yellow",
        "Root Type": "Tap, Rhizome",
        "Bloom Time": "Early Summer - Late Summer",
        "Fruit Time": "Summer - Fall",
        "Texture": "Medium",
        "Form": "Creeping",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun",
        "Hardiness Zone": "6 -- 9",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "5.0 - 8.0",
        "Ecological Function": "Groundcover, Insectory, Nitrogen Fixer, Toxin Absorber",
        "Human Use/Crop\r": "Container Garden, Dye, Food, Medicine, Medicine, Ornamental\"\r\n8171,Mountain Knotgrass (Polpala),Aerva lanata,AELA,Perennial,7,7,12,All Year,\"Widespread in the tropics and subtropics of Africa through Asia to the Philippines and New Guinea on open forest on mountain slopes, on waste and disturbed ground, deserted cultivation and coastal scrub from sea-level to 1,490 meters. The stems can be erect to prostrate, sometimes scrambling or climbing into other plants for support; they can be stiff or weak and straggling, growing from 30 - 200cm long. The root has a camphor-like aroma. These plants are self-pollinated and bisexual."
    },
    {
        "Id": 1759,
        "Name": "Prairie Larkspur (Carolina Larkspur)",
        "Scientific name": "Delphinium carolinianum subsp. virescens",
        "Binomial": "DECA",
        "Plant Type": "Perennial",
        "Height": 36,
        "Spread": 36,
        "Root Depth": 6,
        "Seasonal Interest": "Spring",
        "Notes": "The preference is full sun, rather dry conditions, and soil that is rocky or sandy. This wildflower dislikes competition and prefers barren ground where the ground vegetation is sparse. If necessary, it can tolerate a little shade. The basal leaves usually wither away before the flowers bloom, but this is normal. New growth is toxic to cattle and humans if ingested. May be fatal if eaten. Goes dormant relatively early in the season. CULTIVARS: \"Black Knight\" (Dark violet flowers), \"Blue Springs\" (Lavender & blue flowers), \"Summer Skies\" (Light blue flowers).\" The root system is coarsely fibrous.",
        "Flower Color": "Blue, White",
        "Root Type": "Fibrous Shallow",
        "Bloom Time": "Late Spring - Early Summer",
        "Fruit Time": "",
        "Texture": "Fine",
        "Form": "Upright",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun",
        "Hardiness Zone": "3 -- 7",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "0 - 0",
        "Ecological Function": "Insecticide, Insectory, Reclamator",
        "Human Use/Crop\r": "Medicine, Ornamental, Ornamental\"\r\n2288,\"Wild Leek (Ramps, Wild Wood Leek)"
    },
    {
        "Id": 1810,
        "Name": "Swamp Lousewort",
        "Scientific name": "Pedicularis lanceolata",
        "Binomial": "PELA",
        "Plant Type": "Perennial",
        "Height": 18,
        "Spread": 18,
        "Root Depth": 0,
        "Seasonal Interest": "Summer",
        "Notes": "May use host plants to obtain nutrients. Considered hemiparasitic.",
        "Flower Color": "Yellow",
        "Root Type": "Tap",
        "Bloom Time": "Late Summer - Early Fall",
        "Fruit Time": "",
        "Texture": "Medium",
        "Form": "Upright",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "",
        "Hardiness Zone": "3 -- 8",
        "Soil Moisture": "Wet, Moderate",
        "Soil pH": "6.2 - 7.0",
        "Ecological Function": "Dynamic Accumulator",
        "Human Use/Crop\r": "\r"
    },
    {
        "Id": 2237,
        "Name": "Lovage (Love-parsley)",
        "Scientific name": "Levisticum officinale",
        "Binomial": "LEOF",
        "Plant Type": "Perennial",
        "Height": 72,
        "Spread": 48,
        "Root Depth": 12,
        "Seasonal Interest": "Summer",
        "Notes": "Lovage is a multi-purpose plant. All its parts are edible. It is a 3-6 ft. shrub with lobed, deep glossy green, leaves. Seed - sow spring or early autumn in a cold frame. The seed can be slow to germinate so it is probably best sown as soon as it is ripe. Prick out the seedlings into individual pots when they are large enough to handle and plant them out into their permanent positions in the summer. Division in spring or autumn. This can be quite hard work due to the size of the roots but the plant grows away very well afterwards. Larger clumps can be replanted direct into their permanent positions, though it is best to pot up smaller clumps and grow them on in a cold frame until they are rooting well. Plant them out in the spring.",
        "Flower Color": "Green, Yellow",
        "Root Type": "Tap, Rhizome",
        "Bloom Time": "Late Spring - Summer",
        "Fruit Time": "Summer - Fall",
        "Texture": "Medium",
        "Form": "Upright",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "4 -- 8",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "5.0 - 7.8",
        "Ecological Function": "Chemical Barrier, Insectory, Insectory, Insectory, Wildlife Habitat",
        "Human Use/Crop\r": "Aromatics/Fragrance, Essential Oil, Essential Oil, Food, Food, Food, Medicine, Ornamental\"\r\n2051,White Lupin,Lupinus albus,LUAL,Perennial,48,36,10,Summer,White flowers,White,Fibrous Shallow,Late Summer - Early Fall,,Medium,Upright,Moderate,Minor,Minor,\"Full_Sun, Partial_Shade"
    },
    {
        "Id": 2580,
        "Name": "Great Masterwort",
        "Scientific name": "Astrantia major",
        "Binomial": "ASMA",
        "Plant Type": "Perennial",
        "Height": 30,
        "Spread": 18,
        "Root Depth": 0,
        "Seasonal Interest": "Summer",
        "Notes": "Red pincushion flowers.",
        "Flower Color": "Red",
        "Root Type": "Rhizome",
        "Bloom Time": "Late Spring - Summer",
        "Fruit Time": "",
        "Texture": "Medium",
        "Form": "Clump",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "4 -- 9",
        "Soil Moisture": "Moderate",
        "Soil pH": "6.5 - 7.5",
        "Ecological Function": "",
        "Human Use/Crop\r": "Dried Flower\r"
    },
    {
        "Id": 6161,
        "Name": "Longleaf Mat-Rush",
        "Scientific name": "Lomandra longifolia",
        "Binomial": "LOLO",
        "Plant Type": "Perennial",
        "Height": 36,
        "Spread": 48,
        "Root Depth": 6,
        "Seasonal Interest": "Spring-Fall",
        "Notes": "",
        "Flower Color": "Red, White",
        "Root Type": "Rhizome",
        "Bloom Time": "Spring - Late Spring",
        "Fruit Time": "Summer - Fall",
        "Texture": "Fine",
        "Form": "Spreading",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "8 -- 10",
        "Soil Moisture": "Wet, Moderate",
        "Soil pH": "4.5 - 9.1",
        "Ecological Function": "Erosion Control, Insectory",
        "Human Use/Crop\r": "Container Garden, Fiber, Food\"\r\n2538,Mayapple,Podophyllum peltatum,POPE,Perennial,18,12,0,Summer,,White,Rhizome,Late Spring - Early Summer,,Medium,Upright,Moderate,Minor,Minor,\"Full_Sun, Partial_Shade, Shade"
    },
    {
        "Id": 8146,
        "Name": "Montbretia (Portuguese Lily)",
        "Scientific name": "Crocosmia × crocosmiiflora",
        "Binomial": "CRCR",
        "Plant Type": "Perennial",
        "Height": 40,
        "Spread": 60,
        "Root Depth": 6,
        "Seasonal Interest": "Spring-Fall",
        "Notes": "The species Crocosmia × crocosmiiflora is a hybrid of horticultural origin derived from the species Crocosmia aurea and Crocosmia pottsii.. Both of these species are native to South Africa and the horticultural hybrid was developed in France by Victor Lemoine in 1880. More than seven cultivars of Crocosmia × crocosmiiflora (with flowers varying from yellow to orange and red colours) have been developed and are widely commercialized in tropical and subtropical regions of the world Crocosmia × crocosmiiflora is a perennial herb. In tropical areas this species grows continuously along the year, but in subtropical areas it dies back annually ﻿Crocosmia are summer blooming bulbs with exotic, brightly-colored flowers on wiry, arching stems. The buds open one-by-one from the bottom up and are magnets for hummingbirds. Crocosmia are native to eastern Africa. They are related to gladiolas and have similar sword-like foliage. Crocosmia bulbs should be planted outdoors in spring. They dislike cold soil and may not sprout until the soil is relatively warm. Once the flower clusters are completely spent, cut the stems back to where they meet the foliage and allow the leaves to continue growing",
        "Flower Color": "Orange, Red",
        "Root Type": "Corm, Stolon",
        "Bloom Time": "Summer - Late Summer",
        "Fruit Time": "Fall",
        "Texture": "Medium",
        "Form": "Clump",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "6 -- 10",
        "Soil Moisture": "Moderate",
        "Soil pH": "6.1 - 7.8",
        "Ecological Function": "Insectory, Wildlife Food",
        "Human Use/Crop\r": "Aromatics/Fragrance, Aromatics/Fragrance, Cut Flower, Dried Flower, Dye, Medicine, Ornamental\"\r\n8024,Mug Wort,Artemisia indica,ARIN,Perennial,7,6,8,Spring-Fall,\"Plants are longer lived, more hardy and more aromatic when they are grown in a poor dry soil. Propagation: Seed - surface sow in a tray and do not allow the compost to dry out. When large enough to handle, prick the seedlings out into individual pots and plant them out when large enough. The seed can also be sown in situ."
    },
    {
        "Id": 2233,
        "Name": "Enchanter's Nightshade",
        "Scientific name": "Circaea lutetiana",
        "Binomial": "CILU",
        "Plant Type": "Perennial",
        "Height": 24,
        "Spread": 18,
        "Root Depth": 10,
        "Seasonal Interest": "Summer",
        "Notes": "Grows best in rich soils. Sometimes considered a garden weed.",
        "Flower Color": "Pink, White",
        "Root Type": "Rhizome, Tap",
        "Bloom Time": "Early Summer - Late Summer",
        "Fruit Time": "Fall - ?",
        "Texture": "Medium",
        "Form": "Upright",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Partial_Shade",
        "Hardiness Zone": "3 -- 9",
        "Soil Moisture": "Wet, Moderate",
        "Soil pH": "5.0 - 6.6",
        "Ecological Function": "",
        "Human Use/Crop\r": "Medicine\r"
    },
    {
        "Id": 2627,
        "Name": "Mountain Bluet",
        "Scientific name": "Centaurea montana",
        "Binomial": "CEMO",
        "Plant Type": "Perennial",
        "Height": 24,
        "Spread": 18,
        "Root Depth": 8,
        "Seasonal Interest": "Summer",
        "Notes": "Airy 2 1/2\" blooms with purple centers. Easy to grow in dry, well-drained, sunny location. Easily grown in average, dry to medium moisture, well-drained soils in full sun. Drought tolerant. Tolerant of poor soils. Can spread somewhat rapidly by stolons to form colonies in optimum growing conditions, particularly in rich fertile soils which should be avoided and in cool northern climates where it is more robust. Remove spent flower stalks after bloom. Sparse rebloom in late summer-early fall may occur. Plants need to be divided every 2-3 years.",
        "Flower Color": "Blue",
        "Root Type": "Rhizome, Short Rhizome",
        "Bloom Time": "Late Spring - Summer",
        "Fruit Time": "",
        "Texture": "Medium",
        "Form": "Clump",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "3 -- 8",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "5.0 - 8.3",
        "Ecological Function": "Insectory",
        "Human Use/Crop\r": "Medicine\r"
    },
    {
        "Id": 2146,
        "Name": "Obedient Plant",
        "Scientific name": "Physostegia virginiana",
        "Binomial": "PHVI",
        "Plant Type": "Perennial",
        "Height": 36,
        "Spread": 24,
        "Root Depth": 12,
        "Seasonal Interest": "Summer-Fall",
        "Notes": "Late season bloom; dark green, toothed foliage",
        "Flower Color": "Lavender, Pink, White",
        "Root Type": "Short Rhizome, Short Rhizome",
        "Bloom Time": "Summer - Late Summer",
        "Fruit Time": "",
        "Texture": "Medium",
        "Form": "Upright",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun",
        "Hardiness Zone": "3 -- 10",
        "Soil Moisture": "Moderate",
        "Soil pH": "6.0 - 7.5",
        "Ecological Function": "Insectory",
        "Human Use/Crop\r": "Cut Flower\r"
    },
    {
        "Id": 2076,
        "Name": "Onion",
        "Scientific name": "Allium cepa",
        "Binomial": "ALCE",
        "Plant Type": "Perennial",
        "Height": 24,
        "Spread": 9,
        "Root Depth": 4,
        "Seasonal Interest": "Summer",
        "Notes": "Pale pink, pale yellow or white flower; blue-green foliage; aromatic. Allium cepa is a herbaceous, perennial plant (usually grown as an annual or biennial in cultivation) producing 4 - 10 leaves about 30cm long and a flowering scape that can be up to 100cm tall from an underground bulb. The plant divides, forming in time a cluster of plants (Flora of China). This is one of the most cultivated plants in the world, widely grown especially for its edible bulb, but also for its leaves. Propagation: Seed. Early sowings can be made in late winter in a greenhouse to be planted out in late spring. The main sowing is made in early spring or mid spring in an outdoor seedbed, this bed must be very well prepared. A sowing can also be made in an outdoor seedbed in August of winter hardy varieties (the Japanese onions are very popular for this). These overwinter and provide an early crop of onion bulbs in early summer of the following year. Onion sets can be planted in early to mid spring. Sets are produced by sowing seed rather thickly in an outdoor seedbed in late spring or early summer. The soil should not be too rich and the seedlings will not grow very large in their first year. The plant",
        "Flower Color": "Pink, White, Yellow",
        "Root Type": "Bulb, Fibrous Shallow",
        "Bloom Time": "Summer",
        "Fruit Time": "Summer - Fall",
        "Texture": "Medium",
        "Form": "Upright",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "2 -- 9",
        "Soil Moisture": "Moderate",
        "Soil pH": "4.5 - 8.3",
        "Ecological Function": "Aromatic Pest Confuser, Aromatic Pest Confuser, Insecticide",
        "Human Use/Crop\r": "Cleanser/Scourer, Dye, Food, Food, Insect Repellent, Medicine, Medicine, Medicine, Oil, Wax, Resin or Polish\"\r\n1700,Ornamental Onion,Allium giganteum,ALGI,Perennial,48,24,,Summer,\"Other common name- \"Giant Allium\". Tolerates summer drought, but requires moist growing conditions in spring. Low toxicity if eaten. Flower is an umbel. Many other Allium species with different bloom times and colors."
    },
    {
        "Id": 3242,
        "Name": "Orchid, Moth",
        "Scientific name": "Phalenopsis spp.",
        "Binomial": "PHSP",
        "Plant Type": "Perennial",
        "Height": 36,
        "Spread": 12,
        "Root Depth": 5,
        "Seasonal Interest": "All Year",
        "Notes": "Epiphytic and monopodial, produces aerial roots. Capable of blooming year-round. Best in bright indirect light and medium-high humidity. Makes connections with orchid mycorrhizal fungi.",
        "Flower Color": "Cream, Green, Lavender, Orange, Pink, Purple, Rose, White, Yellow",
        "Root Type": "",
        "Bloom Time": "",
        "Fruit Time": "",
        "Texture": "Coarse",
        "Form": "Upright",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Partial_Shade",
        "Hardiness Zone": "10 -- 12",
        "Soil Moisture": "Moderate",
        "Soil pH": "6.5 - 7.5",
        "Ecological Function": "Air Cleaner",
        "Human Use/Crop\r": "Container Garden, Ornamental\"\r\n7815,Western Prairie Fringed Orchid,Platanthera praeclara,PLPR,Perennial,36,12,5,Spring-Summer,Platanthera praeclara is considered globally imperiled and is listed as federally threatened and is rare or presumed extirpated throughout most of its range,White,\"Tuber, Short Rhizome"
    },
    {
        "Id": 2093,
        "Name": "Perennial Pea (Sweet Pea)",
        "Scientific name": "Lathyrus latifolius",
        "Binomial": "LALA",
        "Plant Type": "Perennial",
        "Height": 24,
        "Spread": 6,
        "Root Depth": 12,
        "Seasonal Interest": "Spring-Summer",
        "Notes": "Purple flower; green foliage",
        "Flower Color": "",
        "Root Type": "Fibrous Deep, Rhizome",
        "Bloom Time": "Late Spring - Early Summer",
        "Fruit Time": "Summer",
        "Texture": "Medium",
        "Form": "Upright",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun",
        "Hardiness Zone": "3 -- 9",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "5.8 - 7.5",
        "Ecological Function": "Erosion Control, Nitrogen Fixer, Soil Builder",
        "Human Use/Crop\r": "\r"
    },
    {
        "Id": 3208,
        "Name": "Peace Lily",
        "Scientific name": "Spathiphyllum",
        "Binomial": "SPx",
        "Plant Type": "Perennial",
        "Height": 72,
        "Spread": 60,
        "Root Depth": 4,
        "Seasonal Interest": "All Year",
        "Notes": "Flowers sporadically. Has been extensively hybridized; species categorization not very clear. Best in soils with lots of organic matter. More likely to bloom in partial sunlight. Best in a humid environment.",
        "Flower Color": "White",
        "Root Type": "Short Rhizome",
        "Bloom Time": "",
        "Fruit Time": "",
        "Texture": "Coarse",
        "Form": "Upright",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Partial_Shade, Shade",
        "Hardiness Zone": "10 -- 12",
        "Soil Moisture": "Wet, Moderate",
        "Soil pH": "5.8 - 6.5",
        "Ecological Function": "Air Cleaner",
        "Human Use/Crop\r": "Container Garden, Cut Flower, Ornamental\"\r\n3239,Peacock Plant,Calathea makoyana,CAMA,Perennial,24,24,0,All Year,Dislikes variation in temperature and humidity. Needs high humidity and well-draining soils high in organic matter. Flowers periodically throughout the year. Color may pale in too much shade.,\"Purple, White"
    },
    {
        "Id": 1895,
        "Name": "Slender Penstemon",
        "Scientific name": "Penstemon gracilis",
        "Binomial": "PEGR",
        "Plant Type": "Perennial",
        "Height": 24,
        "Spread": 18,
        "Root Depth": 6,
        "Seasonal Interest": "Spring-Summer",
        "Notes": "Found in native prairies from Ontario to Nebraska.",
        "Flower Color": "Pink",
        "Root Type": "Tap, Fibrous Shallow",
        "Bloom Time": "Late Spring - Summer",
        "Fruit Time": "",
        "Texture": "Fine",
        "Form": "Upright",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "3 -- 8",
        "Soil Moisture": "Dry",
        "Soil pH": "6.0 - 7.0",
        "Ecological Function": "Dynamic Accumulator, Insectory",
        "Human Use/Crop\r": "Cut Flower\r"
    },
    {
        "Id": 6356,
        "Name": "Chinese Peony",
        "Scientific name": "Paeonia lactiflora",
        "Binomial": "PALA",
        "Plant Type": "Perennial",
        "Height": 36,
        "Spread": 36,
        "Root Depth": 18,
        "Seasonal Interest": "Spring-Fall",
        "Notes": "Best in rich, fertile, well-drained soil. It is recommended to cut the foliage back in fall after frost. Plants is sandier soil tend to have more foliage and in clay soil more flowers, though plants in clay soil develop more slowly. Many cultivars exist, including some with increased flowering duration and hardiness.",
        "Flower Color": "Pink, Red, Rose",
        "Root Type": "Tuber",
        "Bloom Time": "Spring - Summer",
        "Fruit Time": "Fall - ?",
        "Texture": "Medium",
        "Form": "Upright",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "3 -- 8",
        "Soil Moisture": "Moderate",
        "Soil pH": "6.0 - 7.5",
        "Ecological Function": "Hedge",
        "Human Use/Crop\r": "Aromatics/Fragrance, Cut Flower, Dried Flower, Food, Medicine, Ornamental\"\r\n3174,Pepper,Capsicum annuum,CAAN,Perennial,48,24,8,Summer-Fall,\"Cultivated as an annual. Prefers organically rich, well-drained soils. Huge range in cultivars, divided into five different botanical groups, that vary in their characteristics. Sweet peppers are more adapted to temperate conditions than hot."
    },
    {
        "Id": 3225,
        "Name": "Philodendron, Spade Leaf",
        "Scientific name": "Philodendron domesticum",
        "Binomial": "PHDO",
        "Plant Type": "Perennial",
        "Height": 36,
        "Spread": 36,
        "Root Depth": 0,
        "Seasonal Interest": "All Year",
        "Notes": "Also known by P. tuxla and P. hastatum. Does best in humid environments. Propagated easily by stem cuttings. Best in well-draining soils high in organic matter.",
        "Flower Color": "Cream",
        "Root Type": "",
        "Bloom Time": "",
        "Fruit Time": "",
        "Texture": "Coarse",
        "Form": "Vine",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Partial_Shade, Shade",
        "Hardiness Zone": "10 -- 11",
        "Soil Moisture": "Moderate",
        "Soil pH": "6.1 - 7.5",
        "Ecological Function": "Air Cleaner",
        "Human Use/Crop\r": "Container Garden, Ornamental\"\r\n1812,Arctic Phlox,Phlox borealis,PHBO,Perennial,8,36,,Spring,\"A creeping, mat-forming species with evergreen, conifer-like foliage. Bears masses of lavender flowers in spring."
    },
    {
        "Id": 1827,
        "Name": "Moss Phlox",
        "Scientific name": "Phlox subulata",
        "Binomial": "PHSU",
        "Plant Type": "Perennial",
        "Height": 6,
        "Spread": 24,
        "Root Depth": 14,
        "Seasonal Interest": "Spring",
        "Notes": "Mow after flowering to promote new growth. Big spring color impact. Poor soil tolerant. Used in borders, edgings, foundations and walls. Semi evergreen.",
        "Flower Color": "Blue, Pink, Purple, Red, White",
        "Root Type": "Fibrous Deep",
        "Bloom Time": "Spring - Late Spring",
        "Fruit Time": "Summer",
        "Texture": "Fine",
        "Form": "Prostrate",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "3 -- 9",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "5.0 - 8.0",
        "Ecological Function": "Erosion Control, Soil Builder",
        "Human Use/Crop\r": "\r"
    },
    {
        "Id": 2553,
        "Name": "Prairie Phlox",
        "Scientific name": "Phlox pilosa",
        "Binomial": "PHPI",
        "Plant Type": "Perennial",
        "Height": 24,
        "Spread": 12,
        "Root Depth": 0,
        "Seasonal Interest": "Spring-Summer",
        "Notes": "Prairie Phlox is found in a variety of dry soils including dry woods, pine barrens, and prairies.",
        "Flower Color": "Pink, Purple",
        "Root Type": "Fibrous Shallow",
        "Bloom Time": "Late Spring - Summer",
        "Fruit Time": "",
        "Texture": "Medium",
        "Form": "Clump",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade, Shade",
        "Hardiness Zone": "4 -- 9",
        "Soil Moisture": "Moderate",
        "Soil pH": "6.5 - 7.0",
        "Ecological Function": "Insectory, Wildlife Food",
        "Human Use/Crop\r": "\r"
    },
    {
        "Id": 2140,
        "Name": "Smooth Phlox",
        "Scientific name": "Phlox glaberrima",
        "Binomial": "PHGL",
        "Plant Type": "Perennial",
        "Height": 48,
        "Spread": 36,
        "Root Depth": 8,
        "Seasonal Interest": "Summer-Fall",
        "Notes": "Red-magenta flower",
        "Flower Color": "Rose",
        "Root Type": "Fibrous Shallow",
        "Bloom Time": "Late Spring - Early Summer",
        "Fruit Time": "Summer - Fall",
        "Texture": "Medium",
        "Form": "Upright",
        "Growth Rate": "Moderate",
        "Insect Predation": "",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "4 -- 8",
        "Soil Moisture": "Wet, Moderate",
        "Soil pH": "5.8 - 7.0",
        "Ecological Function": "Insectory, Wildlife Food",
        "Human Use/Crop\r": "\r"
    },
    {
        "Id": 1825,
        "Name": "Woodland Phlox",
        "Scientific name": "Phlox divaricata",
        "Binomial": "PHDI",
        "Plant Type": "Perennial",
        "Height": 18,
        "Spread": 18,
        "Root Depth": 14,
        "Seasonal Interest": "Spring",
        "Notes": "Self sows. Ssp. Laphamii native to Minnesota.",
        "Flower Color": "Blue, Pink, Purple, White",
        "Root Type": "Fibrous Deep",
        "Bloom Time": "Spring - Early Summer",
        "Fruit Time": "",
        "Texture": "Fine",
        "Form": "Upright",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Partial_Shade, Shade",
        "Hardiness Zone": "3 -- 8",
        "Soil Moisture": "Moderate",
        "Soil pH": "5.5 - 7.1",
        "Ecological Function": "Erosion Control, Soil Builder",
        "Human Use/Crop\r": "\r"
    },
    {
        "Id": 5759,
        "Name": "Pignut (Earthnut, Arnut)",
        "Scientific name": "Conopodium majus",
        "Binomial": "COMA",
        "Plant Type": "Perennial",
        "Height": 39,
        "Spread": 24,
        "Root Depth": 6,
        "Seasonal Interest": "Spring-Summer",
        "Notes": "The pignut is common in many parts of Europe and its range extends to North Africa. Pignuts grow in open woods and in well-established (and ungrazed) grassland. In the woods they like to grow in areas that receive a reasonable amount of sunlight. Carrot like foliage.Common in open woodland, hedgerows and dry grassland, pignut is a small umbellifer (member of the carrot family) with fine leaves and delicate stems. Small umbels (umbrella-like clusters) of white flowers appear between May and June, and are attractive to a range of insects, such as soldier beetles and hoverflies. A perennial herb, found in damp or shaded meadows and pastures, hedgerows, roadside verges, copses and woodlands; especially characteristic of some types of northern hay meadow. It grows on a wide range of acidic and base-rich soils. Propagation: Seed - sow spring in a cold frame. Germination is usually quick and good. Prick out the seedlings into individual pots as soon as they are large enough to handle and plant them out when in early summer. It is also possible to sow in situ, though this requires a lot more seed to produce the same amount of plants from a protected sowing. Division in late summer as the p",
        "Flower Color": "White",
        "Root Type": "Tuber",
        "Bloom Time": "Late Spring - Early Summer",
        "Fruit Time": "Summer - Fall",
        "Texture": "Fine",
        "Form": "",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "6 -- 10",
        "Soil Moisture": "Moderate",
        "Soil pH": "5.5 - 7.0",
        "Ecological Function": "Domestic Animal Forage, Insectory",
        "Human Use/Crop\r": "Food, Food, Medicine\"\r\n1854,Butterfly Blue Pincushion Flower,Scabiosa columbaria 'Butterfly Blue',SCCO,Perennial,30,30,8,Summer-Fall,\"Lacy lavender-blue, two-inch flowers bloom on slender 12- to 15-inch stems from late spring through early fall."
    },
    {
        "Id": 8306,
        "Name": "Wild Pink",
        "Scientific name": "Dianthus strictus",
        "Binomial": "DIST",
        "Plant Type": "Perennial",
        "Height": 3,
        "Spread": 18,
        "Root Depth": 4,
        "Seasonal Interest": "All Year",
        "Notes": "It is endemic to Syria, Lebanon, the Palestine region, Egypt, Iraq, Cyprus, Turkey, Greece in Batha, Phrygana, Shrub-steppes Distribution: Mediterranean woodlands and shrublands, semi-steppe shrublands, shrub-steppes, deserts and extreme deserts. A a low maintenance plant with beautiful rewards. The plants require at least 6 hours of directly sunlight per day, and soil that drains well. Other than that, the plants only require to be watered once per week once established. Very hardy, it prefers a sunny well drained site.",
        "Flower Color": "Pink",
        "Root Type": "Fibrous Shallow, Rhizome",
        "Bloom Time": "Spring - Early Winter",
        "Fruit Time": "Spring - Winter",
        "Texture": "Medium",
        "Form": "Mound",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun",
        "Hardiness Zone": "5 -- 10",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "4.5 - 6.5",
        "Ecological Function": "Groundcover, Insectory",
        "Human Use/Crop\r": "Container Garden, Food, Ornamental\"\r\n1674,Cup Plant (Cup Rosinweed),Silphium perfoliatum,SIPE,Perennial,96,48,16,Summer,\"Native to tall grass prairie of the midwest U.S. Habitat preference is moist woods, prairies and low ground. Blooms late summer. A coarse perennial, 3-6 ft. tall with numerous large, yellow composite flowers. Each flower head has 20-30 yellow rays and darker yellow disks. Stout leaves are joined at stem to form a small cup that holds water and attracts birds. This species has square stems and leaves that are mostly opposite, egg-shaped, toothed, with cuplike bases that hold water. The flower heads are rich, golden yellow, 2.5 centimeters in diameter, and closely grouped at the tips of the stems. The small, tubular disk flowers are in the middle of the flower and is sterile and does not produce fruits. Their roots mainly consist of a central taproot. They also have abundant shallow rhizomes to permit vegetative spreading and to form large colonies. The upper portion of the root consists of a woody crown that has to be split with a mattock in order to divide for transplanting."
    },
    {
        "Id": 2292,
        "Name": "Prairie Fleabane",
        "Scientific name": "Erigeron strigosus",
        "Binomial": "ERST",
        "Plant Type": "Perennial",
        "Height": 36,
        "Spread": 15,
        "Root Depth": 10,
        "Seasonal Interest": "Spring-Summer",
        "Notes": "Praire fleabane is an attractive, native daisy-type flower that grows in a wide variety of soil types.",
        "Flower Color": "White",
        "Root Type": "",
        "Bloom Time": "Late Spring - Early Summer",
        "Fruit Time": "",
        "Texture": "Medium",
        "Form": "Upright",
        "Growth Rate": "Moderate",
        "Insect Predation": "",
        "Disease": "",
        "Light": "Full_Sun",
        "Hardiness Zone": "2 -- 10",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "4.8 - 7.1",
        "Ecological Function": "Insectory",
        "Human Use/Crop\r": "\r"
    },
    {
        "Id": 2296,
        "Name": "Prairie Loosestrife",
        "Scientific name": "Lysimachia quadriflora",
        "Binomial": "LYQU",
        "Plant Type": "Perennial",
        "Height": 24,
        "Spread": 6,
        "Root Depth": 0,
        "Seasonal Interest": "Summer",
        "Notes": "Yellow flowered plant growing along stream banks, swampy meadows and wet thickets.",
        "Flower Color": "Yellow",
        "Root Type": "Long Rhizome",
        "Bloom Time": "Early Summer - Late Summer",
        "Fruit Time": "",
        "Texture": "Medium",
        "Form": "Upright",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "2 -- 8",
        "Soil Moisture": "Wet, Moderate",
        "Soil pH": "0 - 0",
        "Ecological Function": "",
        "Human Use/Crop\r": "Medicine\r"
    },
    {
        "Id": 1761,
        "Name": "Prairie Smoke (Three Flowered Avens)",
        "Scientific name": "Geum triflorum",
        "Binomial": "GETR",
        "Plant Type": "Perennial",
        "Height": 18,
        "Spread": 12,
        "Root Depth": 6,
        "Seasonal Interest": "Spring",
        "Notes": "Geum triflorum is a native North American perennial commonly called Prairie Smoke, for the appearance of the wispy seedheads. Other common names include Old Man’s Whiskers, Purple (or Red) Avens, Long-Plumed Avens, and Three-Flowered Avens. It is widely distributed across southern Canada and the central and northern U.S. in temperate and sub-arctic grasslands, and is hardy in zones 3-7. This prairie and open woodland wildflower in the rose family (Rosaceae) can be locally abundant on upland prairie sites. It is commonly found on shallow and gravelly sites as well as in silty and loamy soils. Unfortunately, it has become rather rare over much of its range, out-competed by naturalized invaders and eliminated by development. The plants form a mound of foliage 6-10” tall, very gradually spreading by rhizomes. The leaves are pinnately compound with 9-19 rather crowded, narrow, toothed leaflets. The deeply cut, almost ferny leaves are semi-evergreen, with the foliage often turning red, purple and orange from late fall through winter. The leaves often look poor during the heat of the summer but resume growth in late summer and fall to become a deep grey-green as other perennials are senes",
        "Flower Color": "Pink, Purple, Red",
        "Root Type": "Rhizome, Fibrous Shallow",
        "Bloom Time": "Late Spring - Early Summer",
        "Fruit Time": "Summer",
        "Texture": "Medium",
        "Form": "Upright",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "3 -- 8",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "6.0 - 7.5",
        "Ecological Function": "Groundcover, Insectory",
        "Human Use/Crop\r": "Aromatics/Fragrance, Dried Flower, Medicine, Medicine, Medicine, Medicine, Medicine, Ornamental\"\r\n1708,Primrose,Primula,PRx,Perennial,18,30,,Spring,\"Major insect concerns - slugs, spider mites. Will go dormant in hot, dry conditions. Needs to be divided every 1-2 years. Leaf and stem may cause dermatitus. Possibly fatal to livestock in the spring. Best results in cool, moist weather. Won't flowe"
    },
    {
        "Id": 2437,
        "Name": "Narrowleaf Puccoon",
        "Scientific name": "Lithospermum incisum",
        "Binomial": "LIIN",
        "Plant Type": "Perennial",
        "Height": 36,
        "Spread": 10,
        "Root Depth": 0,
        "Seasonal Interest": "Summer",
        "Notes": "Yellow flowers in slightly coilied clusters at ends of stems.",
        "Flower Color": "Yellow",
        "Root Type": "Tap",
        "Bloom Time": "Spring - Early Summer",
        "Fruit Time": "",
        "Texture": "Medium",
        "Form": "Single Stem",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun",
        "Hardiness Zone": "3 -- 9",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "6.0 - 8.0",
        "Ecological Function": "",
        "Human Use/Crop\r": "Aromatics/Fragrance, Dye, Food, Medicine\"\r\n3127,Purple Locoweed (Lambert Crazyweed),Oxytropis lambertii,OXLA,Perennial,20,12,10,Spring,\"Soak seed 6-8 hours in water and sow in spring. Lambert crazyweed is a perennial legume that often forms colonies by short rhizomes, with larger plants forming mounds. Moisture and temperature greatly influence the abundance of vegetative growth, and the plants sometimes die completely back to thick root crowns. Leaves arise directly from the root crown and are up to 8 inches long, with nine to 19 leaflets."
    },
    {
        "Id": 6446,
        "Name": "Abcess Root (Jacob's Ladder)",
        "Scientific name": "Polemonium reptans",
        "Binomial": "PORE",
        "Plant Type": "Perennial",
        "Height": 36,
        "Spread": 36,
        "Root Depth": 6,
        "Seasonal Interest": "Spring-Summer",
        "Notes": "Its native habitat includes moist, deciduous woods and stream banks. It has a low drought tolerance and will go dormant in drought conditions. This self-seeding herbaceous perennial, will also spread by rhizomes. It can be propagated by rootstock division or seed. Divide clumps in early spring or late summer. Seeds can be sown as they ripen or in the early spring. The plants have a smell that attracts cats. The cats roll in the plants with evident pleasure and can cause considerable damage to young plants and ones that have recently been moved.",
        "Flower Color": "Blue, White",
        "Root Type": "Rhizome, Fibrous Shallow",
        "Bloom Time": "Spring - Summer",
        "Fruit Time": "Summer - Fall",
        "Texture": "Medium",
        "Form": "Creeping",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "3 -- 8",
        "Soil Moisture": "Moderate",
        "Soil pH": "6.6 - 7.5",
        "Ecological Function": "Groundcover, Insectory, Insectory",
        "Human Use/Crop\r": "Medicine, Medicine, Medicine, Ornamental, Soap\"\r\n7059,\"Greater Wood Rush (Shadowgrass, Storfrytle)"
    },
    {
        "Id": 2613,
        "Name": "Sea Holly",
        "Scientific name": "Eryngium planum",
        "Binomial": "ERPL",
        "Plant Type": "Perennial",
        "Height": 36,
        "Spread": 24,
        "Root Depth": 12,
        "Seasonal Interest": "Summer",
        "Notes": "Masses of 1\" steel-blue flowers on blue stems excellent for cutting. Easily grown in dry, sandy, well-drained soils in full sun. Tolerates poor soils. Tall plants may sprawl, particularly if grown in overly fertile soils or in anything less than full sun. Avoid overwatering. This is a taprooted plant that transplants poorly and is best left undisturbed once established. Plants will slowly spread in the garden over time.",
        "Flower Color": "Blue",
        "Root Type": "Tap, Short Rhizome",
        "Bloom Time": "Summer - Early Fall",
        "Fruit Time": "Summer - Fall",
        "Texture": "Medium",
        "Form": "Clump",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun",
        "Hardiness Zone": "5 -- 9",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "0.0 - 0.0",
        "Ecological Function": "Insectory, Insectory",
        "Human Use/Crop\r": "Cut Flower, Dried Flower, Medicine, Medicine\"\r\n7043,Cypress Sedge,Carex pseudocyperus,CAPS,Perennial,60,40,0,Spring-Fall,\"Deciduous. Very similar to C. comosa. Found in swamps, wet meadows/woodland, ponds, lakeshores, and other places where shallow water occurs. Spreads slowly."
    },
    {
        "Id": 7044,
        "Name": "European Woodland Sedge",
        "Scientific name": "Carex sylvatica",
        "Binomial": "CASY",
        "Plant Type": "Perennial",
        "Height": 24,
        "Spread": 24,
        "Root Depth": 0,
        "Seasonal Interest": "All Year",
        "Notes": "There are a few distinct subspecies. Can be evergreen or deciduous. Non-mycorrhizal.",
        "Flower Color": "Brown, Green",
        "Root Type": "Short Rhizome",
        "Bloom Time": "Late Spring - Early Summer",
        "Fruit Time": "Summer - ?",
        "Texture": "Fine",
        "Form": "Clump",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "3 -- 8",
        "Soil Moisture": "Wet, Moderate",
        "Soil pH": "5.8 - 7.0",
        "Ecological Function": "Groundcover, Wildlife Habitat",
        "Human Use/Crop\r": "Fiber, Ornamental\"\r\n3249,Greater Tussock Sedge,Carex paniculata,CAPA,Perennial,60,36,8,Spring-Fall,Grows less vigorously in shade. Monoecious. Grow on wet soils or shallowly inundated areas. non-mycorrhizal.,Green,Rhizome,Late Spring - Early Summer,Summer - ?,Fine,Clump,Moderate,Medium,Minor,\"Full_Sun, Partial_Shade"
    },
    {
        "Id": 2440,
        "Name": "Seneca Snakeroot ( Milkwort. Mountain Flax. Rattle",
        "Scientific name": "Polygala senega",
        "Binomial": "POSE",
        "Plant Type": "Perennial",
        "Height": 20,
        "Spread": 12,
        "Root Depth": 0,
        "Seasonal Interest": "Spring-Summer",
        "Notes": "Flowers in cylindrical groups at ends fo stems, white, less than 4 mm ling. Fruits slighly hairy capsules, each one containing 2 black seeds.Propagation Methods: From seed; direct sow outdoors in fall From seed; winter sow in vented containers, coldframe or unheated greenhouse From seed; stratify if sowing indoors.",
        "Flower Color": "White",
        "Root Type": "Tap, Fibrous Shallow",
        "Bloom Time": "Late Spring - Summer",
        "Fruit Time": "Summer - Fall",
        "Texture": "Medium",
        "Form": "Single Stem",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "4 -- 8",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "6.0 - 7.5",
        "Ecological Function": "Insectory, Wildlife Food",
        "Human Use/Crop\r": "Medicine, Medicine\"\r\n7036,Sensitive Plant,Mimosa pudica,MIPU,Perennial,3,3,0,All Year,\"Other common names include touch-me-not plant, humble plant, and shameful plant. Takes the form of a semi-prostrate herb/sub-shrub. Cultivated as an annual in temperate climates. Flowering occurs 3 months after germination, and can occur throughout the year in some climates."
    },
    {
        "Id": 6240,
        "Name": "Cutleaf Silverpuffs (Cut Leaved Scorzonella)",
        "Scientific name": "Microseris procera",
        "Binomial": "MIPR",
        "Plant Type": "Perennial",
        "Height": 8,
        "Spread": 12,
        "Root Depth": 10,
        "Seasonal Interest": "Spring-Summer",
        "Notes": "Fairly moist meadows, occasionally on drier slopes. Clay, loam, or gravelly soils; open sites, in marshes, meadows, pastures, hillsides, shrublands, and open woods at elevations of 10 - 1900m.",
        "Flower Color": "Yellow",
        "Root Type": "Tap",
        "Bloom Time": "",
        "Fruit Time": "",
        "Texture": "Medium",
        "Form": "Rosette",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun",
        "Hardiness Zone": "5 -- 8",
        "Soil Moisture": "",
        "Soil pH": "6.5 - 8.5",
        "Ecological Function": "Insectory",
        "Human Use/Crop\r": "Food\r"
    },
    {
        "Id": 6473,
        "Name": "Silverweed (Goosegrass, Silverweed Cinquefoil)",
        "Scientific name": "Potentilla anserina",
        "Binomial": "POAN",
        "Plant Type": "Perennial",
        "Height": 12,
        "Spread": 36,
        "Root Depth": 4,
        "Seasonal Interest": "Spring-Summer",
        "Notes": "Easily grown in average, moist but well-drained soils in full sun. Tolerates light shade, but will not grow in full shade. Best performance typically occurs in cool northern summer climates. Plants often perform poorly in hot and humid summers south of USDA Zone 7. Established plants have respectable drought tolerance, however. Will reseed in the garden in optimum growing conditions. Because the outer seed coat is somewhat corky from enclosed air pores, the seeds are able to float on water; they can also be blown about by the wind. The primary root system consists of a taproot that often branches. This plant forms clonal colonies by means of its stolons. Spreads by runners.",
        "Flower Color": "Yellow",
        "Root Type": "Stolon",
        "Bloom Time": "Spring - Summer",
        "Fruit Time": "Summer - Fall",
        "Texture": "Medium",
        "Form": "Spreading",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "4 -- 7",
        "Soil Moisture": "Wet, Moderate",
        "Soil pH": "5.5 - 7.5",
        "Ecological Function": "Insectory, Reclamator, Wildlife Food",
        "Human Use/Crop\r": "Food, Medicine\"\r\n1820,Common Snowdrop,Galanthus nivalis,GANI,Perennial,8,6,,Spring,\"Large quantities of bulbs must be ingested to produce toxic results. Best transplanted after flowering, poor survival if moved in dormant state. Mowing tolerant only after foliage has yellowed. Plant in autumn about 3-4\" deep. One of the first plants"
    },
    {
        "Id": 1702,
        "Name": "Solomon's Seal",
        "Scientific name": "Polygonatum biflorum",
        "Binomial": "POBI",
        "Plant Type": "Perennial",
        "Height": 36,
        "Spread": 24,
        "Root Depth": 6,
        "Seasonal Interest": "Spring",
        "Notes": "Difficult from seed and slow to establish. Sometimes divided into P. comnuetatum and P. canaliculatum, the former is larger and more adaptable. Tolerates a wide variety of soils. Recommended for use in rain gardens. Slowly forms colonies via rhizomes under good conditions.",
        "Flower Color": "Green, White, Yellow",
        "Root Type": "Rhizome",
        "Bloom Time": "Late Spring - Early Summer",
        "Fruit Time": "Fall - ?",
        "Texture": "Medium",
        "Form": "Upright",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Partial_Shade, Shade",
        "Hardiness Zone": "3 -- 8",
        "Soil Moisture": "Wet, Moderate",
        "Soil pH": "6.0 - 7.0",
        "Ecological Function": "Erosion Control, Groundcover, Insectory, Wildlife Food",
        "Human Use/Crop\r": "Aromatics/Fragrance, Cut Flower, Food, Medicine, Ornamental\"\r\n2534,False Solomon's Seal (False Spikenard),Maianthemum racemosum subspecies racemosum,MARA,Perennial,30,24,6,Spring,\"Previously known as Smilacina racemosa. Slowly forms colonies via rhizomes. Best in rich, humusy, acidic soil and prefers shade/part-shade."
    },
    {
        "Id": 1786,
        "Name": "Great St. Johnswort (Giant St. John's Wort)",
        "Scientific name": "Hypericum ascyron subsp. pyramidatum",
        "Binomial": "HYAS",
        "Plant Type": "Perennial",
        "Height": 60,
        "Spread": 36,
        "Root Depth": 14,
        "Seasonal Interest": "Summer",
        "Notes": "Hypericum pyramidatum, commonly called great St. John’s wort, is an upright perennial that typically grows 2-5’ tall and features a showy display of yellow flowers (2” across) that bloom in pyramidal cymes in July-August. Each flower has 5 yellow petals, 5 styles (most hypericums have 3 styles) and a center boss of bushy yellow stamens. Stem-clasping, elliptic leaves to 5” long. Hypericum pyramidatum (considered by many to be synonymous with Hypericum ascyron) is native to streambanks and moist wooded slopes from Maine to Manitoba south to Maryland, Indiana and Kansas. In Missouri it is found in wooded slopes and thickets in several counties in the far northern and northwestern part of the state. This plant is also native to central and eastern Asia. Easily grown in any reasonably good well-drained but moisture retentive soil. Succeeds in sun or semi-shade but flowers better in a sunny position.",
        "Flower Color": "Yellow",
        "Root Type": "Stolon, Fibrous Shallow",
        "Bloom Time": "Summer - Late Summer",
        "Fruit Time": "Summer - Fall",
        "Texture": "Medium",
        "Form": "Upright",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun",
        "Hardiness Zone": "4 -- 8",
        "Soil Moisture": "Moderate",
        "Soil pH": "6.0 - 8.0",
        "Ecological Function": "Insectory",
        "Human Use/Crop\r": "Medicine, Medicine, Ornamental\"\r\n2027,Statice,Limonium latifolium,LILA,Perennial,36,24,,Summer,Papery flowers,Blue,Tap,Summer - Early Fall,,Medium,Rosette,Moderate,Minor,Minor,Full_Sun,3 -- 9,\"Moderate, Dry"
    },
    {
        "Id": 1743,
        "Name": "Stonecrop Sedum (Short)",
        "Scientific name": "Sedum (Short)",
        "Binomial": "SESH",
        "Plant Type": "Perennial",
        "Height": 6,
        "Spread": 12,
        "Root Depth": 8,
        "Seasonal Interest": "Summer-Fall",
        "Notes": "\"Golden Carpet\" sedum (Yellow flowers in early summer), \"Yellow Stonecrop\" (Orange-yellow flowers in July-October, scalloped foliage), \"Dragon's Blood\" (Red flowers in June-August), Need to control the spread of many small sedums. Low toxicity if eaten.",
        "Flower Color": "Orange, Red, Rust, Yellow",
        "Root Type": "Tap",
        "Bloom Time": "Early Summer - Fall",
        "Fruit Time": "",
        "Texture": "Medium",
        "Form": "Prostrate",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "3 -- 8",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "0 - 0",
        "Ecological Function": "Erosion Control, Insectory",
        "Human Use/Crop\r": "\r"
    },
    {
        "Id": 1744,
        "Name": "Stonecrop Sedum (Tall)",
        "Scientific name": "Sedum (Tall)",
        "Binomial": "SETA",
        "Plant Type": "Perennial",
        "Height": 20,
        "Spread": 20,
        "Root Depth": 8,
        "Seasonal Interest": "Summer-Fall",
        "Notes": "CULTIVARS: \"Autumn Joy \" ( Pink flowers, Grey-green foliage), \"Stardust\" (Cream flowers), \"Variegated\" (Pink flowers, variegated foliage). Others - \"Maximum\", \"Spectable\", \"Surpureum\". Only low toxicity if eaten.",
        "Flower Color": "Brown, Pink, Red, White",
        "Root Type": "Tap",
        "Bloom Time": "Summer - Fall",
        "Fruit Time": "",
        "Texture": "Medium",
        "Form": "Upright",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "3 -- 8",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "0 - 0",
        "Ecological Function": "Erosion Control, Insectory",
        "Human Use/Crop\r": "\r"
    },
    {
        "Id": 7035,
        "Name": "Jenny's stonecrop (Blue stonecrop, stone orpine)",
        "Scientific name": "Sedum rupestre",
        "Binomial": "SERU",
        "Plant Type": "Perennial",
        "Height": 4,
        "Spread": 12,
        "Root Depth": 3,
        "Seasonal Interest": "All Year",
        "Notes": "Perennial succulent. Very easy to propagate--break pieces off in spring and plant in the ground. Useful for green roofs. Non mycorrhizal.",
        "Flower Color": "Yellow",
        "Root Type": "Fibrous Shallow",
        "Bloom Time": "Summer - Early Fall",
        "Fruit Time": "Summer - Fall",
        "Texture": "",
        "Form": "Prostrate",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "4 -- 9",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "5.7 - 6.4",
        "Ecological Function": "Groundcover, Insectory, Wildlife Habitat",
        "Human Use/Crop\r": "Container Garden, Food, Ornamental, Ornamental\"\r\n2632,Strawberry Palestine Clover,Trifolium fragiferum 'Palestine',TRFR,Perennial,10,0,12,Summer,\"Palestine is a large-leaved and salt-tolerant cultivar developed in Australia. N-fixing, protein-rich species particularly adapted to waterlogged and/or saline soils and to heavy irrigation."
    },
    {
        "Id": 2133,
        "Name": "Wild Strawberry (Beach)",
        "Scientific name": "Fragaria chiloensis",
        "Binomial": "FRCH",
        "Plant Type": "Perennial",
        "Height": 10,
        "Spread": 12,
        "Root Depth": 10,
        "Seasonal Interest": "Spring-Summer",
        "Notes": "White flower; red fruit; green foliage turning red in fall. Beach strawberry, or coastal strawberry, is one of the parent plants of our garden strawberry and is native to the Pacific coast area. The cultivated strawberry of South America, the octoploid Fragaria chiloensis, has a long and interesting history. Although the origin of the species in Chile has not been completely determined, itmay have been introduced from North America by birds",
        "Flower Color": "White",
        "Root Type": "Stolon, Fibrous Shallow",
        "Bloom Time": "",
        "Fruit Time": "Summer",
        "Texture": "Medium",
        "Form": "Creeping",
        "Growth Rate": "Moderate",
        "Insect Predation": "Medium",
        "Disease": "Medium",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "7 -- 10",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "5.8 - 7.8",
        "Ecological Function": "Groundcover, Mulch Maker, Wildlife Food",
        "Human Use/Crop\r": "Food\r"
    },
    {
        "Id": 8564,
        "Name": "Pentapleura subulifera",
        "Scientific name": "Pentapleura subulifera",
        "Binomial": "PESU",
        "Plant Type": "Perennial",
        "Height": 24,
        "Spread": 24,
        "Root Depth": 12,
        "Seasonal Interest": "Spring-Summer",
        "Notes": "Pentapleura is a genus of flowering plant in the family Lamiaceae, first described in 1913. It contains only one known species, Pentapleura subulifera, native to southeastern Turkey and northern Iraq. Small, fastigiate shrub, aromatic; leaves simple entire, subsessile; inflorescence of 2-8-flowered axiliary cymes. HABITAT: Dry limestone slopes. ELEVATION: 1,312-3,281 feet in N Iraq & SE Turkey. Aromatic with ethereal oils. (I have spent hours on this, but mostly taxonomy and sketched images. Some book information and abstract research papers. The articles are entered as images. Non-searchable and Non-copy/paste.)",
        "Flower Color": "Green, Yellow",
        "Root Type": "Fibrous Deep, Rhizome",
        "Bloom Time": "Late Spring - Early Fall",
        "Fruit Time": "Summer - Fall",
        "Texture": "Medium",
        "Form": "Clump",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun",
        "Hardiness Zone": "0 -- 0",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "5.1 - 7.3",
        "Ecological Function": "Insectory",
        "Human Use/Crop\r": "Aromatics/Fragrance, Essential Oil\"\r\n2541,Hairy Sunflower,Helianthus hirsutus,HEHI,Perennial,60,24,108,Summer-Fall,\"Spreads to form colonies via rhizomes. Best in dry mesic soils in full sun. Management Recommendations: This species would likely benefit from oak barrens management, including the use of prescribed fire to maintain openings and ecotonal areas. Control of exotic species and excessive woody brush is also likely important. When found in or near wetlands, maintenance of the hyrdrologic regime, would also be beneficial."
    },
    {
        "Id": 5383,
        "Name": "Sweet Flag (Calamus, Cinnamon Sedge, Flag Root )",
        "Scientific name": "Acorus calamus",
        "Binomial": "ACCA",
        "Plant Type": "Perennial",
        "Height": 32,
        "Spread": 32,
        "Root Depth": 3,
        "Seasonal Interest": "Spring-Fall",
        "Notes": "Scorched leaf tips will occur if soils are allowed to dry out. Appreciates some relief from hot summer sun (e.g., afternoon shade or filtered sun) when grown in hot summer climates. Propagation: seed - best sown in a cold frame as soon as it is ripe. Stand the pot in about 3cm of water. Pot up young seedlings as soon as they are large enough to handle, keep them wet by standing the pots in shallow water and overwinter for the first year in a greenhouse or cold frame. Seed is rarely produced in cool temperate areas. Division in spring just before growth starts. Very easy, it can be carried out successfully at any time in the growing season and can be planted direct into its permanent positions.",
        "Flower Color": "Green, White",
        "Root Type": "Rhizome",
        "Bloom Time": "Late Spring - Early Summer",
        "Fruit Time": "Summer - Fall",
        "Texture": "Medium",
        "Form": "Upright",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "4 -- 10",
        "Soil Moisture": "Wet",
        "Soil pH": "5.5 - 6.5",
        "Ecological Function": "Insecticide, Insectory, Reclamator, Toxin Absorber, Water Purifier, Wildlife Food",
        "Human Use/Crop\r": "Aromatics/Fragrance, Essential Oil, Fiber, Fiber, Food, Insect Repellent, Medicine, Medicine, Medicine\"\r\n1880,Sweet William,Dianthus barbatus 'Double Dwarf',DIBA,Perennial,24,30,10,Summer,Minor disease concen - rust. Biennial that re-seeds itself.,\"Pink, Red, White"
    },
    {
        "Id": 8267,
        "Name": "Trichanthera (Cajeto, Madre de Agua)",
        "Scientific name": "Trichanthera gigantea",
        "Binomial": "TRGI",
        "Plant Type": "Perennial",
        "Height": 45,
        "Spread": 18,
        "Root Depth": 12,
        "Seasonal Interest": "All Year",
        "Notes": "Native to the rainforests of Colombia. It is found near rivers and water sources, in swampy areas, humid forests and estuaries between 100 and 2,150 meters of altitude. Like all plants of the Acanthaceae family, Trichanthera gigantea forms cystoliths, which are small mineral concretions that appear as minute short lines on the upper surface of the leaves, the upper portions of the stems, on the branches of the inflorescences and on the calyx. Trichanthera gigantea is native to the Andean foothills of Colombia. It is found in humid areas and wet forests of Central America and northern countries of South America: from Costa Rica and Panama, east through Colombia and western Venezuela, and south through Ecuador and Peru. It has been successfully introduced to Vietnam, Cambodia and the Philippines. Nacedero can be grown in association with forage trees such as Leucaena or Gliricidia, and in multi-strata agroforestry systems. It is successfully grown in banana plantations in Vietnam and in coffee plantations in Colombia. richanthera gigantea is generally propagated from cuttings selected at the basal part of young stems. These cuttings can either be planted directly or put in plastic ba",
        "Flower Color": "Red, Yellow",
        "Root Type": "Fibrous Deep, Rhizome",
        "Bloom Time": "Early Spring - Late Winter",
        "Fruit Time": "Spring - Winter",
        "Texture": "Coarse",
        "Form": "Upright",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Partial_Shade, Shade",
        "Hardiness Zone": "12 -- 13",
        "Soil Moisture": "Moderate",
        "Soil pH": "4.5 - 7.5",
        "Ecological Function": "Domestic Animal Forage, Erosion Control, Hedge, Insectory, Nitrogen Fixer, Wildlife Food",
        "Human Use/Crop\r": "Food, Medicine\"\r\n1862,Nodding Trillium (Whippoorwill Flower),Trillium cernuum,TRCE,Perennial,14,12,4,Spring,\"Also called Nodding Wakerobin or Whip-poor-will flower. This plant is fairly rare. The species occurs in wet, swampy woodlands, alder thickets in riparian habitats in deciduous woodlands in the southern part of its range and in upland, mixed conifer-deciduous woodlands. Fruit, seeds and rhizomes generally considered poisonous. Nodding Trillium is a perennial herb found from Canada south to northern Virginia and is the most northern of all the Trilliums. It has 1 or more unbranched stems that grow from underground rhizomes with a whorl of 3 bracts below the white to rarely pink 3 petaled flower. The flower is on a curving stem that often hangs below the bracts. It is a long-lived woodland plant needing humus-rich moist soils and part to full shade. The species occurs in wet, swampy woodlands, alder thickets in riparian habitats in deciduous woodlands in the southern part of its range and in upland, mixed conifer-deciduous woodlands. This trillium is not a good choice for the southeastern USA. Trillium cernuum is distributed from eastern North and South Dakota and northeast Iowa, eastward through the Great Lakes states into New England, and southerly into the Mid-Atlantic States t"
    },
    {
        "Id": 1865,
        "Name": "Tulip",
        "Scientific name": "Tulipa",
        "Binomial": "TUx",
        "Plant Type": "Perennial",
        "Height": 36,
        "Spread": 12,
        "Root Depth": 0,
        "Seasonal Interest": "",
        "Notes": "Requires or tolerates dry summer and moist spring. Gray mold, tulip break virus and bulb rot are problems. Many hybrid tulips are best treated as annuals. Species tulips are more reliably perennial and do not seem to attract rabbits or mice.",
        "Flower Color": "Green, Orange, Pink, Purple, Red, Rust, White, Yellow",
        "Root Type": "Bulb",
        "Bloom Time": "Spring - Early Summer",
        "Fruit Time": "",
        "Texture": "Medium",
        "Form": "Upright",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade, Shade",
        "Hardiness Zone": "4 -- 7",
        "Soil Moisture": "Moderate",
        "Soil pH": "0.0 - 0.0",
        "Ecological Function": "Air Cleaner",
        "Human Use/Crop\r": "Cut Flower\r"
    },
    {
        "Id": 3087,
        "Name": "North American Turkey Pea (Hoary Pea)",
        "Scientific name": "Tephrosia virginiana",
        "Binomial": "TEVI",
        "Plant Type": "Perennial",
        "Height": 36,
        "Spread": 10,
        "Root Depth": 12,
        "Seasonal Interest": "Spring-Summer",
        "Notes": "Flowers resemble those of sweet peas. This species is the North American version of goats rue. Another common name, Devil's Shoestring, refers to its long stringy roots. Habitats include upland sand prairies, sandy hill prairies, sand dunes, upland sandy savannas, upland rocky savannas, and sandstone glades. In more wooded areas, Goats Rue typically occurs where oaks are the dominant trees. This member of the pea family has upright to sprawling stems. It is native to dry, open woods, and best grown from seed as its deep root system makes dividing and transplanting rarely successful.",
        "Flower Color": "Pink, Purple, Yellow",
        "Root Type": "Tap, Fibrous Shallow",
        "Bloom Time": "Early Spring - Early Summer",
        "Fruit Time": "Summer - Fall",
        "Texture": "Medium",
        "Form": "Columnar",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "3 -- 9",
        "Soil Moisture": "Moderate",
        "Soil pH": "5.0 - 7.0",
        "Ecological Function": "Domestic Animal Forage, Insectory, Nitrogen Fixer, Wildlife Food",
        "Human Use/Crop\r": "Food, Medicine, Medicine\"\r\n2872,Turmeric,Curcuma longa,CULO,Perennial,40,24,3,Spring-Fall,\"Grows best in a warm, hot climate. Fruit and seeds generally not produced. Needs soils with good drainage. Plants may not reliably flower."
    },
    {
        "Id": 8274,
        "Name": "Turumao (Oik, Nuo Mi Tuan)",
        "Scientific name": "Gonostegia hirta",
        "Binomial": "GOHI",
        "Plant Type": "Perennial",
        "Height": 4,
        "Spread": 4,
        "Root Depth": 2,
        "Seasonal Interest": "All Year",
        "Notes": "Gonostegia hirta is perennial but short lived tropical plant, that in some sub-tropical regions with cold winters appears as a annual herb. It is a creeping perennial plant that can grow up to 3-4 feet tall. RANGE: E. Asia - China, India, Japan, through southeast Asia to Australia. HABITAT: Sunny stream banks in valleys and weed patches alongside woodlands. Terrestrial or lithophyte, in rock crevices and at boulders, exposed or partially shaded, in woodland, Dry, rocky cliffs. Weedy places, thickets by ditches and rice fields at elevations of 328-3,281 feet, and occasionally to 8,858 feet. In the wild, C. hirta grows where it can keep its tops hot and feet cool; usually by hiding the latter under large rocks. CULTIVATION: The plant can be monoecious or dioecious. PROPAGATION: Seed. Flowers are yellowish, arranged at the leaf axils. This plant can be propagated through seeds, cutings or with layering technique, which is very easy, as Gonostegia is quickly growing roots at the nodes, often even without touching the ground.",
        "Flower Color": "Yellow",
        "Root Type": "Rhizome, Fibrous Shallow",
        "Bloom Time": "Summer",
        "Fruit Time": "Fall",
        "Texture": "Medium",
        "Form": "Creeping",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun",
        "Hardiness Zone": "7 -- 11",
        "Soil Moisture": "Moderate",
        "Soil pH": "4.7 - 6.5",
        "Ecological Function": "Domestic Animal Forage, Groundcover, Reclamator, Water Purifier",
        "Human Use/Crop\r": "Container Garden, Food, Medicine, Medicine, Medicine, Soap\"\r\n1823,Canada Milk Vetch (Locoweed),Astragalus canadensis,ASCA,Perennial,48,48,10,Summer,\"Longevity of Canada milkvetch is short, generally 3 to 4 years. Persistence may be enhanced by mowing or grazing to prevent seed formation. Plants may also be improved by phosphorous or potassium fertilizer. The plant is palatable to livestock and deer and is highly nutritious at certain times of the growing season. Needs stratification, 33-38 deg. F. for 10 days. Scarification required. Rocky soils. Plant community- Shores and banks."
    },
    {
        "Id": 3126,
        "Name": "Witch's Teeth",
        "Scientific name": "Hosackia gracilis",
        "Binomial": "HOGR",
        "Plant Type": "Perennial",
        "Height": 12,
        "Spread": 24,
        "Root Depth": 0,
        "Seasonal Interest": "Spring-Summer",
        "Notes": "Previously known by Lotus formosissimus. Goes dormant under drought conditions; most plants are dormant between August and December in their native habitat. Grows best in well-drained soil. Spreads from rhizomes and stolons. Endangered.",
        "Flower Color": "Pink, Yellow",
        "Root Type": "Short Rhizome, Tap",
        "Bloom Time": "Early Spring - Summer",
        "Fruit Time": "Summer",
        "Texture": "Fine",
        "Form": "Matlike",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Full_Sun, Partial_Shade",
        "Hardiness Zone": "8 -- 10",
        "Soil Moisture": "Wet, Moderate",
        "Soil pH": "5.5 - 7.0",
        "Ecological Function": "Groundcover, Insectory, Nitrogen Fixer",
        "Human Use/Crop\r": "Container Garden, Ornamental\"\r\n8241,White Wood Aster,Eurybia divaricata,EUDI,Perennial,36,30,6,Summer-Fall,\"Eurybia divaricata, or White Wood Aster, is a herbaceous perennial native to the Eastern United States that typically grows wild in dry open woods, primarily in Appalachian mountain areas. It prefers partial shade with 3-4 hrs of sun daily in average, medium to dry well-drained soils. It is shade, deer, and drought tolerant. The showy white flowers appear in clusters in late summer to fall and are a favorite of bees and butterflies. Its seeds are eaten by birds and small mammals. White Wood Asters can grow to a height of 3 feet and spread vigorously by rhizomes. Shearing the plant to 6 inches in early summer produces a more compact plant. The species prefers drier soils but is fairly tolerant of wet conditions."
    },
    {
        "Id": 1736,
        "Name": "Sweet Woodruff",
        "Scientific name": "Galium odoratum",
        "Binomial": "GAOD",
        "Plant Type": "Perennial",
        "Height": 8,
        "Spread": 24,
        "Root Depth": 4,
        "Seasonal Interest": "Spring",
        "Notes": "Bordering, edging, ground cover, mass planting, embankment and naturalized areas in the shade. Exquisitely whorled foliage that forms solid mat.Seed - best sown in situ as soon as it is ripe in late summer. The seed can also be sown in spring though it may be very slow to germinate. A period of cold stratification helps reduce the germination time. Lots of leafmold in the soil and the shade of trees also improves germination rates. Division in spring. The plant can also be successfully divided throughout the growing season if the divisions are kept moist until they are established. Very easy, larger clumps can be replanted direct into their permanent positions, though it is best to pot up smaller clumps and grow them on in a cold frame until they are rooting well. Plant them out in the spring. Cuttings of soft wood, after flowering, in a frame.",
        "Flower Color": "White",
        "Root Type": "Fibrous Deep",
        "Bloom Time": "Late Spring - Early Summer",
        "Fruit Time": "Fall",
        "Texture": "Fine",
        "Form": "Spreading",
        "Growth Rate": "Moderate",
        "Insect Predation": "Minor",
        "Disease": "Minor",
        "Light": "Partial_Shade, Shade",
        "Hardiness Zone": "4 -- 8",
        "Soil Moisture": "Moderate, Dry",
        "Soil pH": "4.3 - 8.3",
        "Ecological Function": "Erosion Control, Groundcover, Insectory, Soil Builder",
        "Human Use/Crop\r": "Aromatics/Fragrance, Aromatics/Fragrance, Aromatics/Fragrance, Dye, Dye, Food, Insect Repellent, Medicine\"\r\n2175,Wool Grass (Common Woolsedge),Scirpus cyperinus,SCCY,Perennial,60,12,12,Summer,\"Also known as cottongrass bulrush and brown woolly sedge. Aquatic perennial of the sedge family. Native to wet meadows, swamps, sloughs, marshes, bottomland prairies, stream/pond margins and wet disturbed areas. Green flower; green foliage"
    }
]